
&НаСервере
Процедура КочетовПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ЗаполнитьТипЦенника();
	
	ИсторияЦветаЦенника.Параметры.УстановитьЗначениеПараметра("Номенклатура",Объект.Ссылка);
КонецПроцедуры

процедура ЗаполнитьТипЦенника()
	Если ЭтаФорма.Параметры.Ключ<>Неопределено тогда
		Запрос=Новый Запрос;
		Запрос.УстановитьПараметр("ном",ЭтаФорма.Параметры.Ключ);
		//ИнтеграцияОфис=регистрыСведений.ИнтеграцияОфис.СоздатьНаборЗаписей();
		//ИнтеграцияОфис.Отбор.свойство.установить("КрасныйЦенник");
		//ИнтеграцияОфис.Прочитать();
		//КрасныйЦенник=ИнтеграцияОфис[0].ЗначениеВБазе;
		Запрос.УстановитьПараметр("красныйЦенник",Справочники.ххх_Справочник.КрасныйЦенник.Значение);
		Запрос.Текст="ВЫБРАТЬ
		             |	НоменклатураСегмента.Номенклатура
		             |ИЗ
		             |	РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
		             |ГДЕ
		             |	НоменклатураСегмента.Сегмент = &красныйЦенник
					 |	И НоменклатураСегмента.Номенклатура = &ном";
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЭтаФорма.Элементы.ТипЦенника.ЦветФона=Новый Цвет(255, 142, 162);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

