
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Запись.Инкримента=0
КонецПроцедуры


Функция йцу()
	Если Запись.Инкримента=0 Тогда
		Запрос=Новый запрос;
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		             |	ххх_КодыНоменклатурыВесыКассы.Инкримента КАК Инкримента
		             |ИЗ
		             |	РегистрСведений.ххх_КодыНоменклатурыВесыКассы КАК ххх_КодыНоменклатурыВесыКассы
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	Инкримента УБЫВ";
		Выборка=Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если выборка.Инкримента<2 Тогда
				СтараяИнкримента=2;
			Иначе
				СтараяИнкримента=выборка.Инкримента;	
			КонецЕсли;
		Иначе
			СтараяИнкримента=1;
		КонецЕсли;
		Запись.Инкримента=СтараяИнкримента+1;
	кОНЕЦеСЛИ;
	
	
	наб=РегистрыСведений.ххх_КодыНоменклатурыВесыКассы.СоздатьНаборЗаписей();
	наб.Отбор.Оборудование.установить(Запись.оборудование);
	наб.Прочитать();
	нОМЕРА=нАБ.ВыгрузитьКолонку("НомерДляСостава");
	НомерДляСостава=1;		
	Пока ЗначениеЗаполнено(нОМЕРА.Найти(НомерДляСостава)) или нОМЕРА.Найти(НомерДляСостава)=0 Цикл
		НомерДляСостава=НомерДляСостава+1;
	КонецЦикла;
	Запись.НомерДляСостава=НомерДляСостава;

КонецФункции



Функция ПолучитьПоследниюЯчейкуНаВесах()	
	
	Если Значениезаполнено(запись.Оборудование) Тогда
		
		Запрос=Новый запрос;
		Запрос.УстановитьПараметр("Весы",запись.Оборудование);
		Запрос.Текст="ВЫБРАТЬ ПЕРВЫЕ 1
		             |	ххх_КодыНоменклатурыВесыКассы.Код КАК Код,
		             |	ххх_КодыНоменклатурыВесыКассы.Оборудование КАК Оборудование
		             |ИЗ
		             |	РегистрСведений.ххх_КодыНоменклатурыВесыКассы КАК ххх_КодыНоменклатурыВесыКассы
		             |ГДЕ
		             |	ххх_КодыНоменклатурыВесыКассы.Оборудование = &весы
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	Код УБЫВ";
		выборка=Запрос.Выполнить().Выбрать();
		Если выборка.Следующий() Тогда
			ЗАпись.Код=Выборка.Код+1;
		Иначе
			Запись.Код=1;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОборудованиеПриИзменении(Элемент)
	ПолучитьПоследниюЯчейкуНаВесах()
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	ПроверкаПрав(Отказ);
	Если не отказ Тогда
		йцу();
	КонецЕсли;
КонецПроцедуры

Процедура ПроверкаПрав(Отказ)
	
	
	Если Запись.Оборудование.type=3 и не РольДоступна("ПолныеПрава") Тогда
		отказ=истина;
		Сообщить("Не достаточно прав.");
	КонецЕСли;
	
КонецПроцедуры