
&Перед("ДобавитьКомандыПечати")
Процедура КочетовДобавитьКомандыПечати(КомандыПечати)
	
	// Реестр товаров ВетИС
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрТоваровВЕТИС";
	КомандаПечати.Представление = НСтр("ru = 'Реестр товаров ВетИС (Яблоко)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;

КонецПроцедуры

&Перед("Печать")
Процедура КочетовПечать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрТоваровВЕТИС") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,"РеестрТоваровВЕТИС",
			НСтр("ru = 'Реестр товаров ВетИС (Яблоко)'"), 
			СформироватьПечатнуюФормуРеестрТоваровВЕТИС(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;

КонецПроцедуры

Функция СформироватьПечатнуюФормуРеестрТоваровВЕТИС(МассивОбъектов, ОбъектыПечати)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Реестр_товаров_ВЕТИС";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВходящаяТранспортнаяОперацияВЕТИС.ПФ_MXL_РеестрТоваровВЕТИС");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");
	ОблСтрокаТЧ  = Макет.ПолучитьОбласть("СтрокаТЧ");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВходящаяТранспортнаяОперацияВЕТИС.Ссылка КАК Ссылка,
	|	ВходящаяТранспортнаяОперацияВЕТИС.НомерТТН КАК НомерТТН,
	|	ВходящаяТранспортнаяОперацияВЕТИС.ГрузоотправительХозяйствующийСубъект КАК ГрузоотправительХозяйствующийСубъект,
	|	ВходящаяТранспортнаяОперацияВЕТИС.ДатаТТН КАК ДатаТТН,
	|	ВходящаяТранспортнаяОперацияВЕТИС.НомерТранспортногоСредства КАК НомерТранспортногоСредства
	|ИЗ
	|	Документ.ВходящаяТранспортнаяОперацияВЕТИС КАК ВходящаяТранспортнаяОперацияВЕТИС
	|ГДЕ
	|	ВходящаяТранспортнаяОперацияВЕТИС.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВходящаяТранспортнаяОперацияВЕТИСТовары.Ссылка КАК Ссылка,
	|	ВходящаяТранспортнаяОперацияВЕТИСТовары.НомерСтроки КАК НомерСтроки,
	|	ВходящаяТранспортнаяОперацияВЕТИСТовары.ВетеринарноСопроводительныйДокумент КАК ВетеринарноСопроводительныйДокумент,
	|	ВходящаяТранспортнаяОперацияВЕТИСТовары.Продукция КАК Продукция,
	|	ВходящаяТранспортнаяОперацияВЕТИСТовары.Номенклатура КАК Номенклатура,
	|	ВходящаяТранспортнаяОперацияВЕТИСТовары.Количество КАК Количество,
	|	ВходящаяТранспортнаяОперацияВЕТИСТовары.ЕдиницаИзмеренияВЕТИС КАК ЕдиницаИзмеренияВЕТИС,
	|	ВходящаяТранспортнаяОперацияВЕТИСТовары.КоличествоВЕТИС КАК КоличествоВЕТИС
	|ИЗ
	|	Документ.ВходящаяТранспортнаяОперацияВЕТИС.Товары КАК ВходящаяТранспортнаяОперацияВЕТИСТовары
	|ГДЕ
	|	ВходящаяТранспортнаяОперацияВЕТИСТовары.Ссылка В(&МассивОбъектов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	Результаты = Запрос.ВыполнитьПакет();
	
	ВыборкаПоДокументам		 = Результаты[0].Выбрать();	
	ВыборкаПоТабличнымЧастям = Результаты[1].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	//РезультатЗапроса = Запрос.Выполнить();
	//ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаПоДокументам.Следующий() Цикл
	//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		Если НЕ ВыборкаПоТабличнымЧастям.НайтиСледующий(Новый Структура("Ссылка",ВыборкаПоДокументам.Ссылка)) Тогда
			Продолжить;	
		КонецЕсли;
		
		ВыборкаПоСтрокамТЧ = ВыборкаПоТабличнымЧастям.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
		Если НЕ ПервыйДокумент Тогда	
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		ОбластьШапка.Параметры.Заполнить(ВыборкаПоДокументам);
		//ОбластьШапка.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		//// СТРОКИ ТЧ
		//Пока ВыборкаПоСтрокамТЧ.Следующий() Цикл
		//	ОблСтрокаТЧ.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);
		//	ОблСтрокаТЧ.Параметры.КоличествоНаше =  ВыборкаПоСтрокамТЧ.Количество/ВыборкаПоСтрокамТЧ.Номенклатура.ххх_Нетто;
		//	ОблСтрокаТЧ.Параметры.НаименованиеНаше = ВыборкаПоСтрокамТЧ.Номенклатура.ххх_НаименованиеЦенник;
		//	ОблСтрокаТЧ.Параметры.ЕдИзм = ВыборкаПоСтрокамТЧ.Номенклатура.ЕдиницаИзмерения;
		//	Если ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.ДатаПроизводстваКонецПериода = '00010101' Тогда
		//		ОблСтрокаТЧ.Параметры.ДатаВыработки = Формат(ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.ДатаПроизводстваНачалоПериода,"ДФ=dd.MM.yy");
		//	Иначе
		//		ОблСтрокаТЧ.Параметры.ДатаВыработки = Формат(ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.ДатаПроизводстваНачалоПериода,"ДФ=dd.MM.yy")+
		//		" - " + Формат(ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.ДатаПроизводстваКонецПериода,"ДФ=dd.MM.yy");
		//	КонецЕсли;
		//	Если ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.СрокГодностиКонецПериода = '00010101' Тогда
		//		ОблСтрокаТЧ.Параметры.ГоденДо = Формат(ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.СрокГодностиНачалоПериода,"ДФ=dd.MM.yy");	
		//	Иначе
		//		ОблСтрокаТЧ.Параметры.ГоденДо = Формат(ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.СрокГодностиНачалоПериода,"ДФ=dd.MM.yy")+
		//		" - " + Формат(ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.СрокГодностиКонецПериода,"ДФ=dd.MM.yy");	
		//	КонецЕсли;			
		//	
		//	ТабличныйДокумент.Вывести(ОблСтрокаТЧ);
		//	
		//КонецЦикла;
		
		// СТРОКИ ТЧ
		Пока ВыборкаПоСтрокамТЧ.Следующий() Цикл
			ОблСтрокаТЧ.Параметры.Заполнить(ВыборкаПоСтрокамТЧ);

			ОблСтрокаТЧ.Параметры.НаименованиеНаше = ВыборкаПоСтрокамТЧ.Номенклатура.ххх_НаименованиеЦенник;
			Если ВыборкаПоСтрокамТЧ.Номенклатура.ххх_Нетто>0 Тогда
				ОблСтрокаТЧ.Параметры.КоличествоНаше = ВыборкаПоСтрокамТЧ.Количество/ВыборкаПоСтрокамТЧ.Номенклатура.ххх_Нетто;
			Иначе
				ОблСтрокаТЧ.Параметры.КоличествоНаше = 0;
			КонецЕсли;
			
			ОблСтрокаТЧ.Параметры.ЕдИзм = ВыборкаПоСтрокамТЧ.Номенклатура.ЕдиницаИзмерения;
			Если ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.ДатаПроизводстваКонецПериода = '00010101' Тогда
				ОблСтрокаТЧ.Параметры.ДатаВыработки = Формат(ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.ДатаПроизводстваНачалоПериода,"ДФ=dd.MM.yy");
			Иначе
				ОблСтрокаТЧ.Параметры.ДатаВыработки = Формат(ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.ДатаПроизводстваНачалоПериода,"ДФ=dd.MM.yy")+
				" - " + Формат(ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.ДатаПроизводстваКонецПериода,"ДФ=dd.MM.yy");
			КонецЕсли;
			Если ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.СрокГодностиКонецПериода = '00010101' Тогда
				ОблСтрокаТЧ.Параметры.ГоденДо = Формат(ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.СрокГодностиНачалоПериода,"ДФ=dd.MM.yy");	
			Иначе
				ОблСтрокаТЧ.Параметры.ГоденДо = Формат(ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.СрокГодностиНачалоПериода,"ДФ=dd.MM.yy")+
				" - " + Формат(ВыборкаПоСтрокамТЧ.ВетеринарноСопроводительныйДокумент.СрокГодностиКонецПериода,"ДФ=dd.MM.yy");	
			КонецЕсли;			
			
			ТабличныйДокумент.Вывести(ОблСтрокаТЧ);
			
		КонецЦикла;		
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;

КонецФункции // СформироватьПечатнуюФормуРеестрТоваровВЕТИС()
