
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// &ЗамерПроизводительности
    ОценкаПроизводительностиРТКлиент.НачатьЗамер(
             Истина, "РегистрСведений.РаспределениеНоменклатуры.Форма.ФормаСписка.Открытие");
	
	Отбор = Новый Структура("Магазин", ПараметрКоманды);
	ПараметрыФормы = Новый Структура("Отбор, ЗапретитьИзменениеМагазина", Отбор, Истина);
	ОткрытьФорму("РегистрСведений.РаспределениеНоменклатуры.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры

