#Область ПрограммныйИнтерфейс

// Удаляет все записи из РС РаботаСотрудников по указанному сотруднику
//
// Параметры:
//  Сотрудник  - СправочникСсылка.ФизическиеЛица - сотрудник, записи которого необходимо удалить
//
Процедура УдалитьЗаписиРаботыСотрудника(Сотрудник) Экспорт
	
	НаборЗаписей = РегистрыСведений.РаботаСотрудников.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать(Истина);

КонецПроцедуры // УдалитьРаботыСотрудника()

#КонецОбласти