
&Вместо("ЗаполнитьЦенуЗакупкиВСтрокеТЧСервер")
Процедура КочетовЗаполнитьЦенуЗакупкиВСтрокеТЧСервер(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
	
	Перем СтруктураПараметровДействия;

	Если СтруктураДействий.Свойство("ЗаполнитьЦенуЗакупки", СтруктураПараметровДействия) Тогда
				
		Цена = ЗапасыСервер.ПолучитьЦенуПоследнейЗакупки(
			СтруктураПараметровДействия.Дата,
			СтруктураПараметровДействия.Магазин,
			СтруктураПараметровДействия.Контрагент, 
			СтруктураПараметровДействия.Ссылка, 
			ТекущаяСтрока.Номенклатура, 
			ТекущаяСтрока.Характеристика, 
			ТекущаяСтрока.Упаковка);
			
		//Если Цена > 0 Тогда
			ТекущаяСтрока.Цена = Цена;	
		//КонецЕсли;	
			
	КонецЕсли;

КонецПроцедуры