
&Вместо("ОткрытьФормуВыбораНоменклатуры")
Процедура КочетовОткрытьФормуВыбораНоменклатуры(Форма, ПараметрыНоменклатуры)
	
	//ПараметрыФормы = Новый Структура;
	//
	//Если ПараметрыНоменклатуры <> Неопределено Тогда
	//	Для Каждого КлючИЗначение Из ПараметрыНоменклатуры Цикл
	//		ПараметрыФормы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
	//	КонецЦикла;
	//КонецЕсли;
	//
	//ТипНоменклатуры  = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар");
	//ОсобенностьУчета = ПредопределенноеЗначение("Перечисление.ОсобенностиУчетаНоменклатуры.ПодконтрольнаяПродукцияВЕТИС");
	//
	//ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("ТипНоменклатуры",  ТипНоменклатуры);
	//ПараметрыОтбора.Вставить("ОсобенностьУчета", ОсобенностьУчета);
	//
	//ПараметрыФормы.Вставить("Отбор",                ПараметрыОтбора);
	//ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	
	//ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыФормы, Форма);

	
	ПараметрыФормы = Новый Структура;

	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Номенклатура",  ПараметрыНоменклатуры.НоменклатураВПоступлении);
	ПараметрыФормы.Вставить("Отбор",                ПараметрыОтбора);
	ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);

	ОткрытьФорму("Справочник.Номенклатура.Форма.КочетовФормаВыбораСписок",ПараметрыФормы , Форма);

КонецПроцедуры
