
Процедура СформироватьОтчет(ПараметрыОтчета, АдресХранилища) Экспорт
		
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач",ПараметрыОтчета.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон",ПараметрыОтчета.Период.ДатаОкончания);
	Запрос.Текст="ВЫБРАТЬ
	             |	МАКСИМУМ(ххх_БонусыИстория.Дата) КАК Дата,
	             |	ххх_БонусыИстория.Номенклатура КАК Номенклатура,
	             |	СУММА(ххх_БонусыИстория.СуммаСкидки) КАК СуммаСкидки,
	             |	СУММА(ххх_БонусыИстория.СуммаПроданного) КАК СуммаПроданного,
	             |	СУММА(ххх_БонусыИстория.КоличествоПродано) КАК КоличествоПродано
	             |ПОМЕСТИТЬ СрезПоследних
	             |ИЗ
	             |	РегистрСведений.ххх_БонусыИстория КАК ххх_БонусыИстория
	             |ГДЕ
	             |	ххх_БонусыИстория.Дата МЕЖДУ &ДатаНач И &ДатаКон
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	ххх_БонусыИстория.Номенклатура
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ххх_БонусыИсторияСрезПоследних.Дата КАК Период,
	             |	ххх_БонусыИсторияСрезПоследних.Поставщик КАК Поставщик,
	             |	ххх_БонусыИсторияСрезПоследних.Номенклатура КАК Номенклатура,
	             |	СрезПоследних.КоличествоПродано КАК КоличествоПродано,
	             |	СрезПоследних.СуммаПроданного КАК СуммаПроданного,
	             |	СрезПоследних.СуммаСкидки КАК СуммаСкидки,
	             |	ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа КАК ЦенаЗакупа,
	             |	ххх_БонусыИсторияСрезПоследних.ЦенаРозницы КАК ЦенаРозницы,
	             |	ххх_БонусыИсторияСрезПоследних.Остаток КАК Остаток,
	             |	ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа * ххх_БонусыИсторияСрезПоследних.Остаток КАК ОстатокВЦенахЗакупа,
	             |	ВЫБОР
	             |		КОГДА СрезПоследних.КоличествоПродано = 0
	             |			ТОГДА 0
	             |		ИНАЧЕ ххх_БонусыИсторияСрезПоследних.Остаток / СрезПоследних.КоличествоПродано
	             |	КОНЕЦ КАК ЗапасВДнях,
	             |	СрезПоследних.СуммаПроданного - ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа * СрезПоследних.КоличествоПродано КАК Прибыль,
	             |	ВЫБОР
	             |		КОГДА ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа = 0
	             |				ИЛИ СрезПоследних.КоличествоПродано = 0
	             |			ТОГДА 0
	             |		ИНАЧЕ СрезПоследних.СуммаПроданного / (ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа * СрезПоследних.КоличествоПродано) - 1
	             |	КОНЕЦ КАК ПроцентПрибыли,
	             |	ВЫБОР
	             |		КОГДА ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа = 0
	             |			ТОГДА 0
	             |		ИНАЧЕ ВЫРАЗИТЬ(ххх_БонусыИсторияСрезПоследних.ЦенаРозницы / ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа - 1 КАК ЧИСЛО(15, 2))
	             |	КОНЕЦ КАК ПроцентНаценки,
	             |	СрезПоследних.КоличествоПродано * ххх_БонусыИсторияСрезПоследних.ЦенаЗакупа КАК СуммаЗакупа,
	             |	ВЫБОР
	             |		КОГДА СрезПоследних.КоличествоПродано <> 0
	             |			ТОГДА 1
	             |		ИНАЧЕ 0
	             |	КОНЕЦ КАК КоличествоПродажSKU,
	             |	СрезПоследних.Номенклатура.Производитель КАК НоменклатураПроизводитель
	             |ИЗ
	             |	РегистрСведений.ххх_БонусыИстория КАК ххх_БонусыИсторияСрезПоследних
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СрезПоследних КАК СрезПоследних
	             |		ПО ххх_БонусыИсторияСрезПоследних.Дата = СрезПоследних.Дата
	             |			И ххх_БонусыИсторияСрезПоследних.Номенклатура = СрезПоследних.Номенклатура
	             |ГДЕ
	             |	ххх_БонусыИсторияСрезПоследних.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	ПоместитьВоВременноеХранилище(Запрос.Выполнить().Выгрузить(), АдресХранилища);
	
КонецПроцедуры 
