
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
    СтандартнаяОбработка=Ложь;
 //
 //   КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

 //   МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
 //   	КомпоновщикНастроек.ПолучитьНастройки(), , ,
 //   	Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));

 //   ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
 //   ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных);

 //   ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
 //   Тз = Новый ТаблицаЗначений;
 //   ПроцессорВывода.УстановитьОбъект(Тз);
 //   ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
 //   
 //   ВнешниеНаборыДанных = Новый Структура;	
 //   ВнешниеНаборыДанных.Вставить("Таблица",Таблица);
 //   
 //   ТаблицаРезультат.Загрузить(Таблица);	
КонецПроцедуры

