
&После("ПриЗаписи")
Процедура КочетовПриЗаписи(Отказ)
	//Если НЕ Отказ Тогда
	//	Выборка = ПланыОбмена.ПланОбменаСОборудованием.Выбрать();
	//	Пока Выборка.Следующий() Цикл 
	//		
	//		Если Выборка.Ссылка = ПланыОбмена.ПланОбменаСОборудованием.ЭтотУзел() или ТипЗнч(Выборка.Оборудование)<>Тип("СправочникСсылка.КассыККМ") Тогда
	//			Продолжить;
	//		КонецЕсли;
	//		
	//		Если ЭтоНовый() и (ЭтотОбъект.ТипШтрихкода=Перечисления.ТипыШтрихкодов.DataMatrix или ЭтотОбъект.ТипШтрихкода=Перечисления.ТипыШтрихкодов.PDF417) тогда
	//			ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, ссылка); 
	//		КонецЕсли;
	//		
	//	КонецЦикла;	
	//КонецЕсли;

КонецПроцедуры
