
Функция ExchangeOrders(Запрос)
	
	
	Попытка
		
		ОбработатьЗапрос(Запрос);
		//йцу=Число("йцу");
		Возврат Новый HTTPСервисОтвет(200);
		
	Исключение
		
		Ответ=Новый HTTPСервисОтвет(404);
		Ответ.УстановитьТелоИзСтроки(ОписаниеОшибки());

		Возврат Ответ;
		
	КонецПопытки;
	
КонецФункции


Функция ОбработатьЗапрос(Запрос)
	
	Строка=Запрос.ПолучитьТелоКакСтроку();
	ЧтениеXML = Новый ЧтениеXML();
	ЧтениеXML.УстановитьСтроку(Строка); 
	
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML);
	
	Заказ=Документы.ЗаказПокупателя.НайтиПоРеквизиту("НомерЗаказаНаСайте",ОбъектXDTO.Order.orderNumber);
	
	Если не ЗначениеЗаполнено(Заказ) Тогда
		заказ=Документы.ЗаказПокупателя.СоздатьДокумент();
		Заказ.НомерЗаказаНаСайте=ОбъектXDTO.Order.orderNumber;
	Иначе
		Заказ=Заказ.получитьОбъект();
		Заказ.УСтановитьПометкуУдаления(Ложь);
	КонецЕсли;
	
	Если не ОбъектXDTO.Order.deliveryStatus="0" Тогда
		
		Заказ.Организация=Справочники.ххх_Справочник.ИнтернетМагазин.значение.СкладПоступления.Организация;
		Заказ.Дата=ТекущаяДата();
		заказ.Статус=Перечисления.СтатусыЗаказовПокупателей.Согласован;
		Заказ.ДатаЗаказаНаСайте=Дата(преобразоватьСКЛДатуВ1сДату(ОбъектXDTO.Order.orderDate));
		
		Заказ.ЖелаемаяДатаПродажи=Дата(СтрЗаменить(ОбъектXDTO.order.deliveryDate,"-",""));
		Заказ.idFNLN=?(Строка(ОбъектXDTO.order.idFNLN)="ОбъектXDTO","",ОбъектXDTO.order.idFNLN);
		Заказ.FNLN=?(Строка(ОбъектXDTO.order.FNLN)="ОбъектXDTO","",ОбъектXDTO.order.FNLN);;
		Заказ.mail=?(Строка(ОбъектXDTO.order.mail)="ОбъектXDTO","",ОбъектXDTO.order.mail);;
		Заказ.АдресДоставки=?(Строка(ОбъектXDTO.order.deliveryAdress)="ОбъектXDTO","",ОбъектXDTO.order.deliveryAdress);;
		Заказ.phone=?(Строка(ОбъектXDTO.order.phone)="ОбъектXDTO","",ОбъектXDTO.order.phone);;
		Заказ.idDeliveryman=?(Строка(ОбъектXDTO.order.idDeliveryman)="ОбъектXDTO","",ОбъектXDTO.order.idDeliveryman);;
		Заказ.deliveryman=?(Строка(ОбъектXDTO.order.deliveryman)="ОбъектXDTO","",ОбъектXDTO.order.deliveryman);;
		Заказ.Комментарий=?(Строка(ОбъектXDTO.order.comment)="ОбъектXDTO","",ОбъектXDTO.order.comment);;
		Заказ.operatorComment=?(Строка(ОбъектXDTO.order.operatorComment)="ОбъектXDTO","",ОбъектXDTO.order.operatorComment);;
	    Заказ.deliveryStatus=ОбъектXDTO.Order.deliveryStatus;
	
		Заказ.Магазин=Справочники.ххх_Справочник.ИнтернетМагазин.значение;
		Заказ.Склад=Справочники.ххх_Справочник.ИнтернетМагазин.значение.складПродажи;
		Заказ.ЦенаВключаетНДС=истина;
		
		Если ОбъектXDTO.Order.deliveryStatus="1" Тогда
			Заказ.товары.очистить();
			Если проверкаНаОбъект(объектXDTO.Order.goods.row) Тогда
				ЗаполнитьСтрокуЗаказа(объектXDTO.Order.goods.row, Заказ.Товары);
			Иначе
				Для каждого стр из объектXDTO.Order.goods.row цикл
					ЗаполнитьСтрокуЗаказа(стр, Заказ.Товары);
				КонецЦикла;
			КонецЕсли;				
			Заказ.Товары.Свернуть("Номенклатура,Цена","ххх_КоличествоНаСайте,Сумма");
		КонецЕсли;
		
		Заказ.Записать();
		
	КонецЕсли;

	
	
КонецФункции	


Функция преобразоватьСКЛДатуВ1сДату(дата)
	стр=СтрЗаменить(дата,"-","");
	Пока Прав(стр,1)<>" " Цикл
		стр=Лев(стр,СтрДлина(стр)-1);
	КонецЦикла;
	стр=Лев(стр,СтрДлина(стр)-1);
	возврат стр;
КонецФункции


Процедура ЗаполнитьСтрокуЗаказа(row, Товары)
	
	//Хуево сделано
	Запрос=Новый запрос;
	Запрос.УстановитьПараметр("Ид",row.idGood);
	Запрос.Текст="ВЫБРАТЬ
	             |	Номенклатура.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.ххх_ИдЦентр = &Ид
	             |	И НЕ Номенклатура.ЭтоГруппа";
	тз=Запрос.Выполнить().Выгрузить();
	номка=тз[0].ссылка;
	//Хуево сделано
	
	стр=Товары.Добавить();
	стр.Номенклатура=номка;
	//стр.Количество=row.count;
	//стр.КоличествоУпаковок=стр.Количество;
	стр.Цена=row.price;
	стр.ххх_КоличествоНаСайте=row.count;
	стр.Сумма=row.sum;
	//стр.СтавкаНДС=;
	
КонецПроцедуры



Функция проверкаНаОбъект(объект)	
	Если ТипЗнч(объект)=Тип("ОбъектXDTO") Тогда
		возврат истина;
	Иначе
		возврат Ложь;
	КонецЕсли;	
КонецФункции








































