
&Вместо("ПроверитьВозможностьВводаНаОсновании")
Процедура КочетовПроверитьВозможностьВводаНаОсновании(ДокументОснование)
	
	//Если Не ДокументОснование.Проведен Тогда
	Если Не ДокументОснование.Проведен И Не ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
			
			ТекстОшибки = НСтр("ru='Документ %1 не проведен. Ввод на основании непроведенного документа невозможен.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ДокументОснование);
			
			ВызватьИсключение ТекстОшибки;
			
	КонецЕсли;

КонецПроцедуры
