
&НаКлиенте
Процедура КочетовТоварыУточнениеНоменклатураНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыНоменклатуры = ИнтеграцияВЕТИСВызовСервера.ПараметрыСозданияНоменклатуры(Продукция, ЕдиницаИзмеренияВЕТИС);
	
	//+++
	ВставитьКлючНоменклатураВПоступлении(ПараметрыНоменклатуры); 
	//---
	
	СобытияФормВЕТИСКлиентПереопределяемый.ОткрытьФормуВыбораНоменклатуры(ЭтотОбъект, ПараметрыНоменклатуры);

КонецПроцедуры

Процедура ВставитьКлючНоменклатураВПоступлении(ПараметрыНоменклатуры)

	Если ЗначениеЗаполнено(ЭтотОбъект.Ссылка.ДокументОснование) Тогда
		ПараметрыНоменклатуры.Вставить("НоменклатураВПоступлении", ЭтотОбъект.Ссылка.ДокументОснование.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура"));
	КонецЕсли;	

КонецПроцедуры // ВставитьКлючНоменклатураВПоступлении()

&НаКлиенте
Процедура КочетовТоварыУточнениеКоличествоВЕТИСПриИзмененииВместо(Элемент)
	
	ОчиститьСообщения();	
	ТекущиеДанные = Элементы.ТоварыУточнение.ТекущиеДанные;
	
	ПараметрыЗаполнения = ИнтеграцияВЕТИСКлиентСервер.ПараметрыЗаполненияТабличнойЧасти();
	ПараметрыЗаполнения.ЕдиницаИзмеренияВЕТИС              = ЕдиницаИзмеренияВЕТИС;
	ПараметрыЗаполнения.ПересчитатьКоличествоЕдиницПоВЕТИС = Истина;
	////Передаем имя табличной части и сведения о ее принадлежности
	//ПараметрыЗаполнения.Вставить("ТабличнаяЧастьТоварыРеквизитФормы", Истина);
	//ПараметрыЗаполнения.ИмяТабличнойЧасти = "ТоварыУточнение";
	
	//СобытияФормВЕТИСКлиентПереопределяемый.ПриИзмененииКоличестваВЕТИС(ЭтотОбъект, ТекущиеДанные,
	//	КэшированныеЗначения, ПараметрыЗаполнения);
		
	КоличествоВЕТИС = ТоварыУточнение.Итог("КоличествоВЕТИС");
	ПредставлениеКоличества = Новый ФорматированнаяСтрока(СтрШаблон("%1 (%2)", КоличествоВЕТИС, ЕдиницаИзмеренияВЕТИС));
	
КонецПроцедуры

&НаКлиенте
Процедура КочетовТоварыУточнениеКоличествоПриИзмененииВместо(Элемент)
	
	ОчиститьСообщения();
	ТекущиеДанные = Элементы.ТоварыУточнение.ТекущиеДанные;
	
	ПараметрыЗаполнения = ИнтеграцияВЕТИСКлиентСервер.ПараметрыЗаполненияТабличнойЧасти();
	ПараметрыЗаполнения.ЕдиницаИзмеренияВЕТИС = ЕдиницаИзмеренияВЕТИС;
	////Передаем имя табличной части и сведения о ее принадлежности
	//ПараметрыЗаполнения.Вставить("ТабличнаяЧастьТоварыРеквизитФормы", Истина);
	//ПараметрыЗаполнения.ИмяТабличнойЧасти = "ТоварыУточнение";
	
	Если РедактированиеФормыНедоступно Тогда
		
		ВведенноеЗначение = ТекущиеДанные.Количество;
		
		ПараметрыЗаполнения.ПересчитатьКоличествоЕдиницПоВЕТИС = Истина;
		
		//СобытияФормВЕТИСКлиентПереопределяемый.ПриИзмененииКоличестваВЕТИС(ЭтотОбъект, ТекущиеДанные,
		//	КэшированныеЗначения, ПараметрыЗаполнения);
			
		Если НЕ ВведенноеЗначение = ТекущиеДанные.Количество Тогда
			ТекстСообщения = НСтр("ru='Документ был передан в информационную систему ВетИС.
				|Количество номенклатуры должно соответствовать количеству ВетИС с учетом коэффициентов пересчета.'");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	Иначе
		
		ПараметрыЗаполнения.ПересчитатьКоличествоЕдиницВЕТИС = Истина;
		
		//СобытияФормВЕТИСКлиентПереопределяемый.ПриИзмененииКоличества(ЭтотОбъект, ТекущиеДанные,
		//КэшированныеЗначения, ПараметрыЗаполнения);
		
		КоличествоВЕТИС = ТоварыУточнение.Итог("КоличествоВЕТИС");
		ПредставлениеКоличества = Новый ФорматированнаяСтрока(СтрШаблон("%1 (%2)", КоличествоВЕТИС, ЕдиницаИзмеренияВЕТИС));
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура КочетовПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	дробитель=ТоварыУточнение.Количество();
	Кусок=КоличествоВЕТИС/дробитель;
	
	флаг=ложь;
	Для каждого стр из ТоварыУточнение цикл
		
		Если стр.количествоВетис=0 Тогда 
			стр.количество=Кусок;
			стр.количествоВетис=Кусок;
			флаг=Истина;
		КонецЕсли;	
			
	КонецЦикла;
	
	Если флаг Тогда
		ИтогКоличество=ТоварыУточнение.Итог("количество");
		если ИтогКоличество<>КоличествоВЕТИС Тогда
			стр=ТоварыУточнение[0];
			стр.количествоВетис=стр.количествоВетис+КоличествоВЕТИС-ИтогКоличество;
			стр.количество=стр.количествоВетис;
		КонецЕсли;
	КонецЕсли;
	
	//Если параметры.Свойство("параметры.Документ.ДокументОснование") Тогда
		ДокументОснование=параметры.Документ.ДокументОснование;
	//КонецЕсли;
	
	Модифицированность=Истина;
	
КонецПроцедуры


