
&После("ЗаполнитьСУчетомОтбора")
Процедура ПослеЗаполнитьСУчетомОтбораКочетов(Объект, НастройкиПересчета = Неопределено) Экспорт
	Запрос=Новый запрос;
	Запрос.установитьПараметр("товары",Объект.товары.выгрузить());
	Запрос.текст="ВЫБРАТЬ
	             |	Товары.Номенклатура КАК Номенклатура,
	             |	Товары.Количество КАК Количество,
	             |	Товары.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	             |	Товары.КоличествоУпаковок КАК КоличествоУпаковок,
	             |	Товары.КоличествоФакт КАК КоличествоФакт
	             |ПОМЕСТИТЬ йцу
	             |ИЗ
	             |	&Товары КАК Товары
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	йцу.Номенклатура КАК Номенклатура,
	             |	йцу.Количество КАК Количество,
	             |	йцу.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	             |	йцу.КоличествоУпаковок КАК КоличествоУпаковок,
	             |	йцу.КоличествоФакт КАК КоличествоФакт
	             |ИЗ
	             |	йцу КАК йцу
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Номенклатура.ххх_НаименованиеЦенник
	             |ИТОГИ ПО
	             |	Номенклатура ИЕРАРХИЯ";
				 
				 
	тз=Запрос.Выполнить().Выгрузить();
	й=0;
	Пока й<Тз.Количество() Цикл	
		если ТипЗнч(тз[й].Количество)<>Тип("Число") тогда
			Тз.Удалить(тз[й]);
			й=й-1;
		КонецЕсли;
		й=й+1;
	КонецЦикла;
	Объект.товары.загрузить(тз);			 
			
		
КонецПроцедуры

&Вместо("ОбработкаПолученияПредставления")
Процедура КочетовОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
	Представление=Строка(ТипЗнч(Данные.ссылка))+" № "+Строка(Данные.ссылка.ххх_ИдЦентр)+" от "+Строка(Данные.ссылка.Дата);
	ПродолжитьВызов(Данные, Представление, СтандартнаяОбработка);
КонецПроцедуры



