
&Вместо("ПередЗаписью")
Процедура КочетовПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	

	Если ОбменДанными.Загрузка Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если не ПараметрыСеанса.АвторизованныйПользователь.ххх_Ревизор и Ответственный.ххх_Ревизор Тогда
		Сообщить("Нельзя редактировать ревизию!");
		отказ=Истина;	
	КонецЕсли;
	
	
	ПроведениеСервер.УстановитьРежимПроведения(Проведен, РежимЗаписи, РежимПроведения);
	
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	ОбщегоНазначенияРТ.УстановитьНовоеЗначениеРеквизита(
		ЭтотОбъект,
		ОбработкаТабличнойЧастиТоварыКлиентСервер.ПолучитьСуммуДокумента(Товары, Истина),
		"СуммаДокумента");
		
	Если ДокументОснование.Статус = Перечисления.СтатусыПриказовНаПроведениеИнвентаризацийТоваров.Закрыт Тогда
		ТекстСообщения = НСтр("ru='По документу ""%1%"" пересчет завершен'");
		ТекстСообщения = СтрЗаменить(ТекстСообщения,"%1%",ДокументОснование);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстСообщения,
			ЭтотОбъект,
			"ДокументОснование" ,
			,
			Отказ);
		
	Иначе
		Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
				
			//Если НЕ УчетныеДанныеЗаполнены 
			//	И НЕ Отказ Тогда
			//	ЗаполнитьКоличествоПоУчету();
			//КонецЕсли;
			
		ИначеЕсли  РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда	
			
			УчетныеДанныеЗаполнены = Ложь;
			
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&После("ОбработкаЗаполнения")
Процедура КочетовОбработкаЗаполненияПосле(ДанныеЗаполнения, СтандартнаяОбработка)	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование",ДанныеЗаполнения);
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПересчетТоваров.Ссылка,
	|	ПересчетТоваров.ДокументОснование
	|ИЗ
	|	Документ.ПересчетТоваров КАК ПересчетТоваров
	|ГДЕ
	|	НЕ ПересчетТоваров.ПометкаУдаления
	|	И ПересчетТоваров.ДокументОснование = &ДокументОснование";
	выборка=Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		ВызватьИсключение "По данному приказу уже существует пересчет! "+Строка(Выборка.ссылка);
	КонецЕсли;
КонецПроцедуры

&После("ИнициализироватьДокумент")
Процедура КочетовИнициализироватьДокументПосле(ДанныеЗаполнения = Неопределено)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриказНаПроведениеИнвентаризацииТоваров") Тогда
		Запрос=новый запрос;
		Запрос.УстановитьПараметр("Номенклатура",Товары.ВыгрузитьКолонку("Номенклатура"));
		Запрос.Текст="ВЫБРАТЬ
		             |	ПоступлениеТоваровТовары.Ссылка КАК Ссылка
		             |ИЗ
		             |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
		             |ГДЕ
		             |	ПоступлениеТоваровТовары.Ссылка.Проведен = ЛОЖЬ
		             |	И ПоступлениеТоваровТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
		             |	И ПоступлениеТоваровТовары.Номенклатура В(&Номенклатура)
		             |
		             |СГРУППИРОВАТЬ ПО
		             |	ПоступлениеТоваровТовары.Ссылка
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	Ссылка";
		выборка=Запрос.Выполнить().Выбрать();
		флаг=ложь;
		СтрокаОшибки="";
		Пока выборка.Следующий() Цикл
			СтрокаОшибки=СтрокаОшибки+("Во входящей накладной: "+выборка.ссылка+", присутствует номенклатура учавствующая в текущем пересчете.")+символы.ВК;
			флаг=истина;
		КонецЦикла;
		Если флаг тогда
			ВызватьИсключение СтрокаОшибки+символы.ВК+"Формирование пересчета отменено. Закройте перечисленные накладные, или исключите группу с номенклатурой из отбора в приказе на пересчет товаров";
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&Вместо("ЗаполнитьКоличествоПоУчету")
Процедура КочетовЗаполнитьКоличествоПоУчетуВместо(ТаблицаНоменклатуры = Неопределено) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Таблица.Номенклатура КАК Номенклатура,
	                      |	Таблица.Характеристика КАК Характеристика,
	                      |	Таблица.КоличествоФакт КАК КоличествоФакт,
	                      |	Таблица.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	                      |	Таблица.Цена КАК Цена,
	                      |	Таблица.СуммаФакт КАК СуммаФакт,
	                      |	Таблица.НомерСтроки КАК НомерСтроки
	                      |ПОМЕСТИТЬ ТаблицаНоменклатуры
	                      |ИЗ
	                      |	&ТаблицаНоменклатуры КАК Таблица
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	ТаблицаНоменклатуры.Характеристика КАК Характеристика,
	                      |	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК КоличествоУпаковок,
	                      |	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК Количество,
	                      |	ТаблицаНоменклатуры.КоличествоФакт КАК КоличествоФакт,
	                      |	ТаблицаНоменклатуры.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	                      |	ТаблицаНоменклатуры.СуммаФакт КАК СуммаФакт,
	                      |	ТаблицаНоменклатуры.Цена КАК Цена,
	                      |	ТаблицаНоменклатуры.Цена * ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0) КАК Сумма,
	                      |	ТаблицаНоменклатуры.НомерСтроки КАК НомерСтроки
	                      |ПОМЕСТИТЬ ТаблицаСУчетомПоступлений
	                      |ИЗ
	                      |	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	                      |				&ДатаОстатков,
	                      |				(Номенклатура, Характеристика, Склад) В
	                      |						(ВЫБРАТЬ
	                      |							Таблица.Номенклатура,
	                      |							Таблица.Характеристика,
	                      |							&Склад
	                      |						ИЗ
	                      |							ТаблицаНоменклатуры КАК Таблица)
	                      |					И Номенклатура.ВидНоменклатуры <> &ВидНоменклатурыАлкоголь) КАК ТоварыНаСкладахОстатки
	                      |		ПО ТаблицаНоменклатуры.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	                      |			И ТаблицаНоменклатуры.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	                      |ГДЕ
	                      |	ТаблицаНоменклатуры.Номенклатура.ВидНоменклатуры <> &ВидНоменклатурыАлкоголь
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ТаблицаНоменклатуры.Номенклатура,
	                      |	ТаблицаНоменклатуры.Характеристика,
	                      |	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0),
	                      |	ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0),
	                      |	ТаблицаНоменклатуры.КоличествоФакт,
	                      |	ТаблицаНоменклатуры.КоличествоУпаковокФакт,
	                      |	ТаблицаНоменклатуры.СуммаФакт,
	                      |	ТаблицаНоменклатуры.Цена,
	                      |	ТаблицаНоменклатуры.Цена * ЕСТЬNULL(ТоварыНаСкладахОстатки.КоличествоОстаток, 0),
	                      |	ТаблицаНоменклатуры.НомерСтроки
	                      |ИЗ
	                      |	ТаблицаНоменклатуры КАК ТаблицаНоменклатуры
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
	                      |				&ДатаОстатковАлкоголя,
	                      |				(Номенклатура, Характеристика, Склад) В
	                      |						(ВЫБРАТЬ
	                      |							Таблица.Номенклатура,
	                      |							Таблица.Характеристика,
	                      |							&Склад
	                      |						ИЗ
	                      |							ТаблицаНоменклатуры КАК Таблица)
	                      |					И Номенклатура.ВидНоменклатуры = &ВидНоменклатурыАлкоголь) КАК ТоварыНаСкладахОстатки
	                      |		ПО ТаблицаНоменклатуры.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
	                      |			И ТаблицаНоменклатуры.Характеристика = ТоварыНаСкладахОстатки.Характеристика
	                      |ГДЕ
	                      |	ТаблицаНоменклатуры.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыАлкоголь
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	СУММА(ТоварыНаСкладахОбороты.КоличествоПриход) КАК КоличествоПриход,
	                      |	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура,
	                      |	ТоварыНаСкладахОбороты.Характеристика КАК Характеристика
	                      |ПОМЕСТИТЬ ОборотПоПоступлениям
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыНаСкладах.Обороты(
	                      |			&ДатаНач,
	                      |			&ДатаОстатков,
	                      |			Регистратор,
	                      |			Номенклатура В
	                      |					(ВЫБРАТЬ
	                      |						ТаблицаСУчетомПоступлений.Номенклатура КАК Номенклатура
	                      |					ИЗ
	                      |						ТаблицаСУчетомПоступлений КАК ТаблицаСУчетомПоступлений
	                      |					СГРУППИРОВАТЬ ПО
	                      |						ТаблицаСУчетомПоступлений.Номенклатура)
	                      |				И Склад = &Склад) КАК ТоварыНаСкладахОбороты
	                      |ГДЕ
	                      |	ТоварыНаСкладахОбороты.Регистратор ССЫЛКА Документ.ПоступлениеТоваров
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыНаСкладахОбороты.Номенклатура,
	                      |	ТоварыНаСкладахОбороты.Характеристика
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТаблицаСУчетомПоступлений.Номенклатура КАК Номенклатура,
	                      |	ТаблицаСУчетомПоступлений.Характеристика КАК Характеристика,
	                      |	ТаблицаСУчетомПоступлений.КоличествоУпаковок - ЕСТЬNULL(ОборотПоПоступлениям.КоличествоПриход, 0) КАК КоличествоУпаковок,
	                      |	ТаблицаСУчетомПоступлений.Количество - ЕСТЬNULL(ОборотПоПоступлениям.КоличествоПриход, 0) КАК Количество,
	                      |	ТаблицаСУчетомПоступлений.КоличествоФакт КАК КоличествоФакт,
	                      |	ТаблицаСУчетомПоступлений.КоличествоУпаковокФакт КАК КоличествоУпаковокФакт,
	                      |	ТаблицаСУчетомПоступлений.СуммаФакт КАК СуммаФакт,
	                      |	ТаблицаСУчетомПоступлений.Цена КАК Цена,
	                      |	ТаблицаСУчетомПоступлений.Сумма - ТаблицаСУчетомПоступлений.Цена * ЕСТЬNULL(ОборотПоПоступлениям.КоличествоПриход, 0) КАК Сумма,
	                      |	ТаблицаСУчетомПоступлений.НомерСтроки КАК НомерСтроки
	                      |ИЗ
	                      |	ТаблицаСУчетомПоступлений КАК ТаблицаСУчетомПоступлений
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ОборотПоПоступлениям КАК ОборотПоПоступлениям
	                      |		ПО ТаблицаСУчетомПоступлений.Номенклатура = ОборотПоПоступлениям.Номенклатура
	                      |			И ТаблицаСУчетомПоступлений.Характеристика = ОборотПоПоступлениям.Характеристика
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	НомерСтроки");
	
	Запрос.УстановитьПараметр("Склад", Склад);
	ТаблицаНоменклатуры = ?(ТаблицаНоменклатуры = Неопределено, Товары.Выгрузить(), ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("ТаблицаНоменклатуры", ТаблицаНоменклатуры);
	Запрос.УстановитьПараметр("ДатаОстатков", Дата+6*60*60);
	Запрос.УстановитьПараметр("ДатаОстатковАлкоголя", ДокументОснование.Дата);
	Запрос.УстановитьПараметр("ВидНоменклатурыАлкоголь", Справочники.ххх_Справочник.ВидНоменклатурыАлкоголь.значение);
	Запрос.УстановитьПараметр("ДатаНач", Дата);
	Товары.Загрузить(Запрос.Выполнить().Выгрузить());
	УчетныеДанныеЗаполнены = Истина;
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура КочетовОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ххх_АкцизныеМарки.Записывать=Истина;
	Движения.ххх_АкцизныеМарки.очистить();
	Запрос=Новый запрос;
	
	мас=Новый массив;
	Для каждого стр из АкцизныеМарки цикл
		Если СтрДлина(стр.АкцизнаяМарка)>100 Тогда
			
			стрДвиж=Движения.ххх_АкцизныеМарки.добавить();
			стрДвиж.ВидДвижения=ВидДвиженияНакопления.Приход;
			стрДвиж.Период=дата;
			стрДвиж.АкцизнаяМарка=стр.АкцизнаяМарка;
			стрДвиж.Количество=1;

		КонецЕсли;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("дата",Дата);
	Запрос.УстановитьПараметр("номенклатура",Товары.ВыгрузитьКолонку("номенклатура"));
	Запрос.Текст="ВЫБРАТЬ
	             |	СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция
	             |ПОМЕСТИТЬ алка
	             |ИЗ
	             |	РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	             |ГДЕ
	             |	СоответствиеНоменклатурыЕГАИС.Номенклатура В(&Номенклатура)
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	АкцизныеМаркиЕГАИС.АкцизнаяМарка.ЗначениеШтрихкода КАК АкцизнаяМаркаЗначениеШтрихкода
	             |ПОМЕСТИТЬ акцизи
	             |ИЗ
	             |	алка КАК алка
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АкцизныеМаркиЕГАИС КАК АкцизныеМаркиЕГАИС
	             |		ПО алка.АлкогольнаяПродукция = АкцизныеМаркиЕГАИС.АлкогольнаяПродукция
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ххх_АкцизныеМаркиОстатки.АкцизнаяМарка КАК АкцизнаяМарка,
	             |	ххх_АкцизныеМаркиОстатки.КоличествоОстаток КАК КоличествоОстаток
	             |ИЗ
	             |	РегистрНакопления.ххх_АкцизныеМарки.Остатки(
	             |			&Дата,
	             |			АкцизнаяМарка В
	             |				(ВЫБРАТЬ
	             |					акцизи.АкцизнаяМаркаЗначениеШтрихкода КАК АкцизнаяМаркаЗначениеШтрихкода
	             |				ИЗ
	             |					акцизи КАК акцизи)) КАК ххх_АкцизныеМаркиОстатки
	             |ГДЕ
	             |	ххх_АкцизныеМаркиОстатки.КоличествоОстаток <> 0";
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	Пока выборка.Следующий() Цикл
		                              
		стрДвиж=Движения.ххх_АкцизныеМарки.добавить();
		
		стрДвиж.ВидДвижения=ВидДвиженияНакопления.Расход;

		
		стрДвиж.Период=дата;
		стрДвиж.АкцизнаяМарка=выборка.АкцизнаяМарка;
		стрДвиж.Количество=выборка.КоличествоОстаток;
		
	КонецЦикла;
КонецПроцедуры


















