
&Вместо("НомерНаПечать")
Функция ВместоНомерНаПечатьКочетов(Знач НомерОбъекта, УдалитьПрефиксИнформационнойБазы = Ложь, УдалитьПользовательскийПрефикс = Ложь) Экспорт
	
	Если ТекущаяДата()<'20170801' Тогда
		Возврат СТрЗаменить(НомерОбъекта,"-","");
	Иначе
		Возврат НомерОбъекта;
	КонецЕсли;
	
КонецФункции

//// Получает номер документа для вывода на печать; из номера удаляются префиксы и лидирующие нули.
//// Функция:
//// отбрасывает префикс организации,
//// отбрасывает префикс информационной базы (опционально),
//// отбрасывает пользовательские префиксы (опционально),
//// удаляет лидирующие нули в номере объекта.
////
//// Параметры:
////    НомерОбъекта - Строка - номер или код объекта, который преобразуется для вывода на печать.
////    УдалитьПрефиксИнформационнойБазы - Булево - признак удаления префикса информационной базы.
////    УдалитьПользовательскийПрефикс - Булево - признак удаления пользовательского префикса.
////
//// Возвращаемое значение:
////     Строка - Номер на печать.
////
//Функция НомерНаПечать(Знач НомерОбъекта, УдалитьПрефиксИнформационнойБазы = Ложь, УдалитьПользовательскийПрефикс = Ложь) Экспорт
//	
//	// {Обработчик: ПриПолученииНомераНаПечать} Начало
//	СтандартнаяОбработка = Истина;
//	
//	ПрефиксацияОбъектовКлиентСерверПереопределяемый.ПриПолученииНомераНаПечать(НомерОбъекта, СтандартнаяОбработка,
//		УдалитьПрефиксИнформационнойБазы, УдалитьПользовательскийПрефикс);
//	
//	Если СтандартнаяОбработка = Ложь Тогда
//		Возврат НомерОбъекта;
//	КонецЕсли;
//	// {Обработчик: ПриПолученииНомераНаПечать} Окончание
//	
//	НомерОбъекта = СокрЛП(НомерОбъекта);
//	
//	// Удаляем пользовательские префиксы из номера объекта.
//	Если УдалитьПользовательскийПрефикс Тогда
//		
//		НомерОбъекта = УдалитьПользовательскиеПрефиксыИзНомераОбъекта(НомерОбъекта);
//		
//	КонецЕсли;
//	
//	// Удаляем лидирующие нули из номера объекта.
//	НомерОбъекта = УдалитьЛидирующиеНулиИзНомераОбъекта(НомерОбъекта);
//	
//	// Удаляем префикс организации и префикс информационной базы из номера объекта.
//	НомерОбъекта = УдалитьПрефиксыИзНомераОбъекта(НомерОбъекта, Истина, УдалитьПрефиксИнформационнойБазы);
//	
//	Возврат НомерОбъекта;
//КонецФункции



