
&НаКлиенте
Процедура СверитьСуммы(Команда)
	СверитьСуммыНаСервере();
КонецПроцедуры

&НаСервере
Процедура СверитьСуммыНаСервере()
	УстановитьПривилегированныйРежим(Истина);
	Запрос=Новый запрос;
	Запрос.УстановитьПараметр("Кассы",ЭтаФорма.СписокКасс.ВыгрузитьЗначения());
	Запрос.Текст="ВЫБРАТЬ
	             |	КассыККМ.Ссылка КАК КАсса
	             |ИЗ
	             |	Справочник.КассыККМ КАК КассыККМ
	             |ГДЕ
	             |	КассыККМ.Ссылка В(&Кассы)";				 
	ВыборкаКасс=Запрос.Выполнить().Выбрать();
	Пока ВыборкаКасс.Следующий() Цикл	 
					 
		пСоед = Новый ПараметрыСоединенияВнешнегоИсточникаДанных;
		пСоед.СтрокаСоединения = ВыборкаКасс.Касса.ххх_СтрокаСоединения;//"DRIVER={MySQL ODBC 5.3 Ansi Driver};SERVER=192.168.0.247;PORT=3306;DATABASE=cassa;uid=operator;pwd=;";
		пСоед.АутентификацияОС=Ложь;
		пСоед.АутентификацияСтандартная=Истина;
		пСоед.ИмяПользователя=ВыборкаКасс.Касса.ххх_ИмяПользователяКассы;//"operator";
		пСоед.СУБД=ВыборкаКасс.Касса.ххх_ТипСубд;//"MySQL";
		ВнешниеИсточникиДанных.Касса.УстановитьОбщиеПараметрыСоединения(пСоед);
		ВнешниеИсточникиДанных.Касса.УстановитьПараметрыСоединенияПользователя("Админ",пСоед);
		ВнешниеИсточникиДанных.Касса.УстановитьСоединение();

		Касса=ВыборкаКасс.КАсса.получитьобъект();
		Касса.СверитьКассы(смена);//.export_cheks_of_session(смена);
			
	КонецЦикла;
КонецПроцедуры









