&НаСервере
Процедура КочетовПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ Параметры.ОрганизацияЕГАИС.Пустая() Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ОрганизацияЕГАИС", Параметры.ОрганизацияЕГАИС);
	//КонецЕсли;
	
	//Если Параметры.ТолькоМаркируемая Тогда
	//	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Маркируемый", Истина, ВидСравненияКомпоновкиДанных.Равно,,
	//	Истина, РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный)
	//КонецЕсли;
	//
	//СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
	Если Параметры.Свойство("Номенклатура") Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "Номенклатура", Параметры.Номенклатура);
	КонецЕсли;

КонецПроцедуры
