#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


функция ЗафиксироватьАкцизы(ДокументСсылка)Экспорт
	
	Запрос=Новый запрос;
	Запрос.УстановитьПараметр("ттн",ДокументСсылка);
	Запрос.Текст="ВЫБРАТЬ
	             |	ПоступлениеТоваров.Ссылка КАК Ссылка
	             |ИЗ
	             |	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	             |ГДЕ
	             |	ПоступлениеТоваров.ТТНВходящаяЕГАИС = &ТТН
	             |	И НЕ ПоступлениеТоваров.ПометкаУдаления";
	
	
	выборка=запрос.Выполнить().Выбрать();
	выборка.Следующий();
	возврат выборка.ссылка
КонецФункции

&Вместо("ФорматОбмена")
Функция КочетовФорматОбмена(Шапка)
	возврат Перечисления.ФорматыОбменаЕГАИС.V3;
КонецФункции

&После("ДобавитьКомандыПечати")
Процедура КочетовДобавитьКомандыПечати(КомандыПечати)
	
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СравнениеЦен";
	КомандаПечати.Представление = НСтр("ru = 'Сравнение цен'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;

КонецПроцедуры



функция ПечатьСравнениеЦен(МассивОбъектов, ОбъектыПечати) Экспорт
	
	
	ТабДок=Новый ТабличныйДокумент;
	
	Для каждого док из МассивОбъектов Цикл
	
		Запрос=Новый Запрос;
		
		Запрос.УстановитьПараметр("ссылка",док.ссылка);
		Запрос.УстановитьПараметр("Дата",док.дата);
		Запрос.УстановитьПараметр("ВидЦены",Справочники.ххх_Справочник.ЗакупочнаяЦена.Значение);
		Запрос.Текст="ВЫБРАТЬ
		             |	ТТНВходящаяЕГАИСТовары.Номенклатура КАК Номенклатура,
		             |	ТТНВходящаяЕГАИСТовары.Цена КАК НоваяЦена,
		             |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0) КАК СтараяЦена
		             |ИЗ
		             |	Документ.ТТНВходящаяЕГАИС.Товары КАК ТТНВходящаяЕГАИСТовары
		             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Дата, ВидЦены = &ВидЦены) КАК ЦеныНоменклатурыСрезПоследних
		             |		ПО ТТНВходящаяЕГАИСТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		             |ГДЕ
		             |	ТТНВходящаяЕГАИСТовары.Ссылка = &ссылка";
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ТТНВходящаяЕГАИС.СравнениеЦен");
		
		ОбластьЗаголовок 		= Макет.ПолучитьОбласть("Шапка");
		
		ОбластьЗаголовок.Параметры.Контрагент=док.Грузоотправитель;
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Выборка=Запрос.Выполнить().Выбрать();
		
		й=1;
		
		Пока Выборка.Следующий() Цикл
			
			Строка = Макет.ПолучитьОбласть("Строка");
			Строка.Параметры.номер=й;
			Строка.Параметры.Код=Выборка.Номенклатура.ххх_ИдЦентр;
			Строка.Параметры.Товар=Выборка.Номенклатура;
			Строка.Параметры.СтараяЦена=Выборка.СтараяЦена;
			Строка.Параметры.НоваяЦена=Выборка.НоваяЦена;
			Строка.Параметры.Изменение=Выборка.НоваяЦена-Выборка.СтараяЦена;
			ТабДок.Вывести(Строка);
			й=й+1;
			
		КонецЦикла;	
			
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;	
	
	возврат ТабДок;
	
КонецФункции

&После("Печать")
Процедура КочетовПечать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СравнениеЦен") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СравнениеЦен", 
			НСтр("ru = 'Сравнение цен'") , 
			ПечатьСравнениеЦен(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
КонецПроцедуры

#КонецЕсли
