
#Область ПрограммныйИнтерфейс

// (См. ЭлектронноеВзаимодействиеМОТП.ЗаполнитьСведенияОМаркировке)
//   Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
// 
Процедура ЗаполнитьСведенияОМаркировке(Приемник, Источник, ДанныеШтрихкодовУпаковок, СтандартнаяОбработка) Экспорт
	
	ЭлектронноеВзаимодействиеМОТПРТ.ЗаполнитьСведенияОМаркировке(Приемник, Источник, ДанныеШтрихкодовУпаковок, СтандартнаяОбработка);
	
КонецПроцедуры

// (См. ЭлектронноеВзаимодействиеМОТП.ЗаполнитьСведенияОМаркировке)
//   Переопределяет заполнение сведений о маркировке. Установить СтандартнаяОбработка=Ложь для переопределенных вызовов.
// 
Процедура ЗаполнитьСведенияОМаркировке_2019(Приемник, Источник, ДанныеШтрихкодовУпаковок, СтандартнаяОбработка) Экспорт
	
	Возврат;
	
КонецПроцедуры

Процедура ПроверитьМаркируемуюПродукциюДокумента(Ссылка, Отказ) Экспорт
	
	Возврат;
	
КонецПроцедуры

#КонецОбласти
