

Процедура НачатьОбмен() Экспорт
	ВыполнитьОбменСМанагерскойПрограммой()
КонецПроцедуры


процедура ВыполнитьОбменСМанагерскойПрограммой()
	
	ЗагрузитьСвязкиВЕТИСНомкаСНашейНомкой()
	
КонецПроцедуры

процедура ЗагрузитьСвязкиВЕТИСНомкаСНашейНомкой()
	
	АдресСайта = "mail.tc-apple.ru" ;
	//Порт = 21;
	Логин = "1c";
	Пароль = "!MegaRoot";
	ИмяКаталога = "/Exchange/Shops/"+СокрЛП(справочники.ххх_Справочник.Магазин.значение.Код);
	FTPСоединение = Новый FTPСоединение(АдресСайта,,Логин,Пароль);
	FTPСоединение.УстановитьТекущийКаталог(ИмяКаталога);
	
	Если FTPСоединение.НайтиФайлы("itemGuid.xml").Количество() = 0 тогда
		Возврат;
	КонецЕсли;


	FTPСоединение.Получить("itemGuid.xml","C:\itemGuid.xml");

	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.ОткрытьФайл("C:\itemGuid.xml");
	ТипЗначенияXDTO = ФабрикаXDTO.Тип("Новый", "Root");
	ОбъектXDTO = ФабрикаXDTO.ПрочитатьXML(ЧтениеXML,ТипЗначенияXDTO);

	Тч=Новый таблицаЗначений;
	Тч.Колонки.Добавить("ххх_ИдЦентр",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(150)));
	Тч.Колонки.Добавить("Идентификатор",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(150)));

	
	Для каждого стр из ОбъектXDTO.Nomenсlatures.Nomenсlature Цикл
		стрТч=Тч.Добавить();
		стрТч.ххх_ИдЦентр=стр.OurId;
		стрТч.Идентификатор=стр.TheirId;
	КонецЦикла;
	
	Запрос=Новый запрос;
	Запрос.УстановитьПараметр("Тч",тч);
	Запрос.Текст="ВЫБРАТЬ
	             |	Тч.ххх_ИдЦентр КАК ххх_ИдЦентр,
	             |	Тч.Идентификатор КАК Идентификатор
	             |ПОМЕСТИТЬ йцу
	             |ИЗ
	             |	&Тч КАК Тч
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Номенклатура.Ссылка КАК Номенклатура,
	             |	ПродукцияВЕТИС.Ссылка КАК Продукция
	             |ИЗ
	             |	йцу КАК йцу
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	             |		ПО йцу.ххх_ИдЦентр = Номенклатура.ххх_ИдЦентр
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПродукцияВЕТИС КАК ПродукцияВЕТИС
	             |		ПО йцу.Идентификатор = ПродукцияВЕТИС.Идентификатор
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	Номенклатура.Ссылка,
	             |	ПродукцияВЕТИС.Ссылка";
	
	
	Тз=Запрос.Выполнить().Выгрузить();
	
	Наб=РегистрыСведений.СоответствиеНоменклатурыВЕТИС.СоздатьНаборЗаписей();
	Наб.Прочитать();
	Наб.Очистить();
	Наб.Записать();
	Наб.Загрузить(Тз);
	Наб.Записать();
	
	FTPСоединение.Удалить(ИмяКаталога,"itemGuid.xml");
	
	//ТекстовыйДок = Новый ТекстовыйДокумент;

	//ТекстовыйДок.Прочитать(ИмяФайла, "windows-1251");

	//ТекстовыйДок.Записать("C:\itemGuid.xml");

	
	
	//ФайлыАкций=НайтиФайлы(путь+"\","mDocs_"+НаименованиеДляФайлов+"*"+".xml");
	//Если ФайлыАкций.Количество()>0 Тогда
	//	Для каждого файл из ФайлыАкций цикл
	//		ЗагрузитьАкцию(файл.ПолноеИмя);
	//	КонецЦикла;
	//КонецЕсли;	
	
КонецПроцедуры