

//&После("ПриЗаписи")
//Процедура КочетовПослеПриЗаписи(Отказ)
//	Если не отказ Тогда
//		Если ТипЗнч(ДокументОснование)=Тип("ДокументСсылка.ТТНВходящаяЕГАИС") и не ЗначениеЗаполнено(Справка1) Тогда
//			ИнтеграцияЕГАИСВызовСервера.ПодготовитьЗапросДанныхСправкиКПередачеКочетов(ДокументОснование.Грузополучатель, 
//			перечисления.ВидыДокументовЕГАИС.ЗапросСправки1, НомерСправки1)
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры

//&После("ПередЗаписью")
//Процедура КочетовПередЗаписью(Отказ)
//	Если не отказ Тогда
//		Если не ЗначениеЗаполнено(Справка1) Тогда
//			Справка1=Справочники.Справки1ЕГАИС.НайтиПоРеквизиту("РегистрационныйНомер",НомерСправки1)
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры
