


// Функция вызывается перед формированием печатной формы.
// Установка цен номенклатуры
//
Функция ОбработкаКомандыПечатиУстановкиЦенШтрихкоды(ПараметрыПечати) Экспорт
    
    // &ЗамерПроизводительности
	ОценкаПроизводительностиРТКлиент.НачатьЗамер(
		     Истина, "Документ.УстановкаЦенНоменклатуры.Форма.ВыборЦенНоменклатуры.Открытие");
             
	ПараметрыФормы = Новый Структура("МассивДокументов", ПараметрыПечати.ОбъектыПечати);
	ОбработчикОповещения = Новый ОписаниеОповещения("ОбработкаКомандыПечатиЗавершение", ЭтотОбъект, ПараметрыПечати);
	
	ОткрытьФорму("Документ.УстановкаЦенНоменклатуры.Форма.ВыборЦенНоменклатуры",
				ПараметрыФормы,
				ПараметрыПечати.Форма,
				Новый УникальныйИдентификатор,
				,
				,
				ОбработчикОповещения,
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецФункции 
