
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	//СобытияФормЕГАИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьПустыеАкцизныеМаркиНаСервере()

	Запрос=Новый запрос;
	Запрос.УстановитьПараметр("номкаПустая",Справочники.Номенклатура.ПустаяСсылка());
	Запрос.Текст="ВЫБРАТЬ
	             |	ШтрихкодыУпаковокТоваров.Ссылка КАК акциз,
	             |	ТТНВходящаяЕГАИСТовары.Ссылка КАК номка
	             |ИЗ
	             |	Документ.ТТНВходящаяЕГАИС.АкцизныеМарки КАК ТТНВходящаяЕГАИСАкцизныеМарки
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	             |		ПО ТТНВходящаяЕГАИСАкцизныеМарки.АкцизнаяМарка = ШтрихкодыУпаковокТоваров.Ссылка
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ТТНВходящаяЕГАИС.Товары КАК ТТНВходящаяЕГАИСТовары
	             |		ПО ТТНВходящаяЕГАИСАкцизныеМарки.ИдентификаторСтроки = ТТНВходящаяЕГАИСТовары.ИдентификаторСтроки
	             |			И ТТНВходящаяЕГАИСАкцизныеМарки.Ссылка = ТТНВходящаяЕГАИСТовары.Ссылка
	             |ГДЕ
	             |	(ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Номенклатура, &НомкаПустая) = &НомкаПустая
	             |			ИЛИ ШтрихкодыУпаковокТоваров.Номенклатура = НЕОПРЕДЕЛЕНО)
	             |
	             |ОБЪЕДИНИТЬ ВСЕ
	             |
	             |ВЫБРАТЬ
	             |	ШтрихкодыУпаковокТоваров.Ссылка,
	             |	АктПостановкиНаБалансЕГАИСТовары.Ссылка
	             |ИЗ
	             |	Документ.АктПостановкиНаБалансЕГАИС.АкцизныеМарки КАК АктПостановкиНаБалансЕГАИСАкцизныеМарки
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ШтрихкодыУпаковокТоваров КАК ШтрихкодыУпаковокТоваров
	             |		ПО АктПостановкиНаБалансЕГАИСАкцизныеМарки.АкцизнаяМарка = ШтрихкодыУпаковокТоваров.Ссылка
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктПостановкиНаБалансЕГАИС.Товары КАК АктПостановкиНаБалансЕГАИСТовары
	             |		ПО АктПостановкиНаБалансЕГАИСАкцизныеМарки.Ссылка = АктПостановкиНаБалансЕГАИСТовары.Ссылка
	             |			И АктПостановкиНаБалансЕГАИСАкцизныеМарки.ИдентификаторСтроки = АктПостановкиНаБалансЕГАИСТовары.ИдентификаторСтроки
	             |ГДЕ
	             |	ЕСТЬNULL(ШтрихкодыУпаковокТоваров.Номенклатура, &НомкаПустая) = &НомкаПустая";
	
	
	Выборка=Запрос.Выполнить().Выбрать();
	
	
	Пока выборка.Следующий() Цикл
		
		акциз=выборка.акциз.получитьОбъект();
		акциз.номенклатура=выборка.номка;
		акциз.записать();
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПустыеАкцизныеМарки(Команда)
	ЗаполнитьПустыеАкцизныеМаркиНаСервере();
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти