



&После("ОбработкаЗаполнения")
Процедура ПослеОбработкаЗаполненияКочетов(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда
		ДокументОснование=ДанныеЗаполнения;
		НомерТТН=ДанныеЗаполнения.Номер;
	КонецЕсли;
	
КонецПроцедуры

&Вместо("ОбработкаПроверкиЗаполнения")
Процедура КочетовОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		МассивНепроверяемыхРеквизитов = Новый Массив;
	
	// Отправка данных на самого себя портит данные регистра Акцизные марки ЕГАИС
	Если Грузоотправитель = Грузополучатель Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			НСтр("ru = 'Грузополучатель должен отличаться от грузоотправителя.'"),
			ЭтотОбъект,
			"Грузополучатель",,
			Отказ);
		
	КонецЕсли;
	
	ИнтеграцияЕГАИСПереопределяемый.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры

&После("ОбработкаПроведения")
Процедура КочетовОбработкаПроведения(Отказ, РежимПроведения)
	
	мен=РегистрыСведений.СтатусыДокументовЕГАИС.СоздатьМенеджерЗаписи();
	мен.Документ=ссылка;
	мен.Прочитать();
	Если мен.Статус=Перечисления.СтатусыОбработкиТТНИсходящейЕГАИС.Подтвержден или мен.Статус=Перечисления.СтатусыОбработкиТТНВходящейЕГАИС.ПодтвержденСРасхождениями Тогда
		
		
		ххх_Сервер.ОтразитьДвиженияАкцизныхМарок(Движения,Ссылка,ВидДвиженияНакопления.Расход);
		
		
	КонецЕсли;

КонецПроцедуры
