
&Вместо("ПодготовитьСтруктуруДанныхЦенниковИЭтикетокДляУстановкиЦен")
Функция КочетовПодготовитьСтруктуруДанныхЦенниковИЭтикетокДляУстановкиЦен(МассивДокументов, МассивНепроведенныхДокументов, ПараметрыПечатиЦенниковИЭтикеток)
		
	Запрос = Новый Запрос;
	//+++
	Если ПараметрыПечатиЦенниковИЭтикеток.УстановитьРежим="ПечатьИзменившихсяЦенников" тогда
		Запрос.УстановитьПараметр("Розница",Справочники.ххх_Справочник.РозничнаяЦена.значение);
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УстановкаЦенНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	УстановкаЦенНоменклатурыТовары.Характеристика КАК Характеристика,
		|	УстановкаЦенНоменклатурыТовары.Упаковка КАК Упаковка,
		|	УстановкаЦенНоменклатурыТовары.НомерСтроки КАК НомерСтроки,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		|				,
		|				ВидЦены = &Розница
		|					И НЕ Регистратор В (&МассивДокументов)) КАК ЦеныНоменклатурыСрезПоследних
		|		ПО УстановкаЦенНоменклатурыТовары.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		|			И (УстановкаЦенНоменклатурыТовары.Цена <> ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена, 0))
		|			И УстановкаЦенНоменклатурыТовары.ВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
		|ГДЕ
		|	УстановкаЦенНоменклатурыТовары.Ссылка В(&МассивДокументов)
		|	И НЕ УстановкаЦенНоменклатурыТовары.Ссылка В (&МассивНепроведенныхДокументов)
		|	И НЕ(УстановкаЦенНоменклатурыТовары.Номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики
		|				И УстановкаЦенНоменклатурыТовары.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаЦенНоменклатурыТовары.Номенклатура,
		|	УстановкаЦенНоменклатурыТовары.Характеристика,
		|	УстановкаЦенНоменклатурыТовары.Упаковка,
		|	УстановкаЦенНоменклатурыТовары.НомерСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	УстановкаЦенНоменклатурыТовары.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УстановкаЦенНоменклатуры.ВидЦены КАК ВидЦены
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ВидыЦен КАК УстановкаЦенНоменклатуры
		|ГДЕ
		|	УстановкаЦенНоменклатуры.Ссылка В(&МассивДокументов)
		|	И НЕ УстановкаЦенНоменклатуры.Ссылка В (&МассивНепроведенныхДокументов)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановкаЦенНоменклатуры.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
		|ГДЕ
		|	УстановкаЦенНоменклатуры.Ссылка В(&МассивДокументов)
		|	И НЕ УстановкаЦенНоменклатуры.Ссылка В (&МассивНепроведенныхДокументов)";
	Иначе
	//---
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УстановкаЦенНоменклатурыТовары.Номенклатура КАК Номенклатура,
		|	УстановкаЦенНоменклатурыТовары.Характеристика КАК Характеристика,
		|	УстановкаЦенНоменклатурыТовары.Упаковка КАК Упаковка,
		|	УстановкаЦенНоменклатурыТовары.НомерСтроки,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.Товары КАК УстановкаЦенНоменклатурыТовары
		|ГДЕ
		|	УстановкаЦенНоменклатурыТовары.Ссылка В(&МассивДокументов)
		|	И НЕ УстановкаЦенНоменклатурыТовары.Ссылка В (&МассивНепроведенныхДокументов)
		|	И НЕ(УстановкаЦенНоменклатурыТовары.Номенклатура.ВидНоменклатуры.ИспользоватьХарактеристики
		|				И УстановкаЦенНоменклатурыТовары.Характеристика = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	УстановкаЦенНоменклатурыТовары.Номенклатура,
		|	УстановкаЦенНоменклатурыТовары.Характеристика,
		|	УстановкаЦенНоменклатурыТовары.Упаковка,
		|	УстановкаЦенНоменклатурыТовары.НомерСтроки
		|
		|УПОРЯДОЧИТЬ ПО
		|	УстановкаЦенНоменклатурыТовары.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УстановкаЦенНоменклатуры.ВидЦены КАК ВидЦены
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры.ВидыЦен КАК УстановкаЦенНоменклатуры
		|ГДЕ
		|	УстановкаЦенНоменклатуры.Ссылка В(&МассивДокументов)
		|	И НЕ УстановкаЦенНоменклатуры.Ссылка В (&МассивНепроведенныхДокументов)
		|
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановкаЦенНоменклатуры.Ссылка
		|ИЗ
		|	Документ.УстановкаЦенНоменклатуры КАК УстановкаЦенНоменклатуры
		|ГДЕ
		|	УстановкаЦенНоменклатуры.Ссылка В(&МассивДокументов)
		|	И НЕ УстановкаЦенНоменклатуры.Ссылка В (&МассивНепроведенныхДокументов)";
	КонецЕсли; //ПараметрыПечатиЦенниковИЭтикеток.УстановитьРежим="ПечатьИзменившихсяЦенников"
	Запрос.УстановитьПараметр("МассивНепроведенныхДокументов", МассивНепроведенныхДокументов);
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	МассивРезультатов = Запрос.ВыполнитьПакет();
	МассивПроведенныхДокументов = МассивРезультатов[2].Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	ТаблицаРеквизитыДокументов = МассивРезультатов[1].Выгрузить();
	МассивВидовЦен = ТаблицаРеквизитыДокументов.ВыгрузитьКолонку(0);
	
	
	// Подготовка структуры действий для обработки печати ценников и этикеток.
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ЗаполнитьСклад", Неопределено);
	СтруктураДействий.Вставить("ЗаполнитьВидЦены", ?(МассивВидовЦен.Количество() > 0, МассивВидовЦен[0], Неопределено));
	СтруктураДействий.Вставить("УстановитьСпособПолученияЦен", 1);
	СтруктураДействий.Вставить("ПоказыватьКолонкуКоличествоВДокументе", Ложь);
	СтруктураДействий.Вставить("УстановитьРежимПечатиИзДокумента");
	СтруктураДействий.Вставить("УстановитьРежим", ПараметрыПечатиЦенниковИЭтикеток.УстановитьРежим);
	СтруктураДействий.Вставить("ЗаполнитьКоличествоЭтикетокПоОстаткамНаСкладе");
	СтруктураДействий.Вставить("ЗаполнитьТаблицуТоваров");
	СтруктураДействий.Вставить("СкрыватьКомандуЗаполненияПоДокументу");
	
	
	// Подготовка данных для заполнения табличной части обработки печати ценников и этикеток.
	СтруктураРезультат = Новый Структура;
	СтруктураРезультат.Вставить("Товары", МассивРезультатов[0].Выгрузить());
	СтруктураРезультат.Вставить("СтруктураДействий", СтруктураДействий);
	СтруктураРезультат.Вставить("МассивДокументов", МассивПроведенныхДокументов);
	
	Возврат ПоместитьВоВременноеХранилище(СтруктураРезультат);
	
КонецФункции
