
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
	
	НАстройки=ЭтотОбъект.КомпоновщикНастроек.ПолучитьНастройки();
	
	ДатаНачала=НАстройки.ПараметрыДанных.Элементы.Найти("Период").Значение.ДатаНачала;
	ДатаОкончания=НАстройки.ПараметрыДанных.Элементы.Найти("Период").Значение.ДатаОкончания;
	
 	ДатаБегунок=ДатаНачала;
	
	
	
	
	ТзСмен=Новый ТаблицаЗначений;
	ТзСмен.Колонки.Добавить("Смена",Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(10,0)));
	ТзСмен.Колонки.Добавить("СменаСортировки",Новый ОписаниеТипов("Строка",Новый КвалификаторыСтроки(20)));
	Пока ДатаБегунок<ДатаОкончания Цикл
		стр=ТзСмен.Добавить();
		стр.Смена=Число(Формат(ДатаБегунок,"ДФ=ддММгг"));
		стр.СменаСортировки=Формат(ДатаБегунок,"ДФ=ггММдд");
		ДатаБегунок=ДатаБегунок+60*60*24;
	КонецЦикла;
	
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТзСмен", ТзСмен);
	
	Запрос.Текст=  "ВЫБРАТЬ
	               |	ТзСмен.Смена КАК Смена,
	               |	ТзСмен.СменаСортировки КАК СменаСортировки
	               |ПОМЕСТИТЬ Смены
	               |ИЗ
	               |	&ТзСмен КАК ТзСмен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Смена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	МАКСИМУМ(ЧекККМ.Дата) КАК Конец,
	               |	МИНИМУМ(ЧекККМ.Дата) КАК Начало
	               |ИЗ
	               |	Документ.ЧекККМ КАК ЧекККМ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Смены КАК Смены
	               |		ПО ЧекККМ.НомерСменыККМ = Смены.Смена
	               |ГДЕ
	               |	ЧекККМ.Проведен";
				   
	выборка=Запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() Тогда
		Конец=Выборка.конец;
		Начало=Выборка.Начало;
	Иначе
		возврат;
	КонецЕсли;	
							   
	Запрос = Новый Запрос;     
	Запрос.УстановитьПараметр("Начало",Начало);
	Запрос.УстановитьПараметр("Конец",Конец);
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТзСмен.Смена КАК Смена,
	               |	ТзСмен.СменаСортировки КАК СменаСортировки
	               |ПОМЕСТИТЬ Смены
	               |ИЗ
	               |	&ТзСмен КАК ТзСмен
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	Смена
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПродажиОбороты.ДокументПродажи.НомерСменыККМ КАК ДокументПродажиНомерСменыККМ,
	               |	СУММА(ПродажиОбороты.СтоимостьОборот) КАК Сумма,
	               |	СУММА(ПродажиОбороты.СтоимостьБезСкидокОборот - ПродажиОбороты.СтоимостьОборот) КАК Скидка,
	               |	ПродажиОбороты.ДокументПродажи.КассаККМ КАК ДокументПродажиКассаККМ,
	               |	Смены.СменаСортировки КАК СменаСортировки
	               |ПОМЕСТИТЬ йцу
	               |ИЗ
	               |	РегистрНакопления.Продажи.Обороты(&Начало, &Конец, Авто, ДокументПродажи ССЫЛКА Документ.ЧекККМ) КАК ПродажиОбороты
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Смены КАК Смены
	               |		ПО ПродажиОбороты.ДокументПродажи.НомерСменыККМ = Смены.Смена
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажиОбороты.ДокументПродажи.НомерСменыККМ,
	               |	ПродажиОбороты.ДокументПродажи.КассаККМ,
	               |	Смены.СменаСортировки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	йцу.ДокументПродажиНомерСменыККМ КАК НомерСменыККМ,
	               |	йцу.Сумма КАК Сумма,
	               |	йцу.Скидка КАК Скидка,
	               |	йцу.ДокументПродажиКассаККМ КАК КассаККМ,
	               |	йцу.СменаСортировки КАК СменаСортировки,
	               |	йцу.ДокументПродажиКассаККМ.Наименование КАК ДокументПродажиКассаККМНаименование
	               |ИЗ
	               |	йцу КАК йцу
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СменаСортировки,
	               |	ДокументПродажиКассаККМНаименование";
	//Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	//Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("ТзСмен", ТзСмен);
 
	ТЗ = Запрос.Выполнить().Выгрузить() ;
	
	
		
					
	//// Например чет там делаем, чего в запросе нельзя намутить
	//Для Каждого Стр Из ТЗ Цикл
	//	
	//	
	//КонецЦикла;
			
	//Связь между таблицей значений и именами в СКД 
	ВнешниеНаборыДанных = Новый Структура;
	ВнешниеНаборыДанных.Вставить("НаборДанных1", ТЗ);
	
	//Макет компоновки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ЭтотОбъект.СхемаКомпоновкиДанных, НАстройки, ДанныеРасшифровки);
	
	//Компоновка данных 
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки, ВнешниеНаборыДанных, ДанныеРасшифровки);
	
	//Вывод результата 
	ДокументРезультат.Очистить();
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);	
КонецПроцедуры




























