
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	ОбъектПрямой=РеквизитФормыВЗначение("Объект");
	ОбъектПрямой.сформировать();
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	Объект.ТабличныйДокумент.АвтоМасштаб=Истина;
	Объект.ТабличныйДокумент.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
КонецПроцедуры



&НаКлиенте
Процедура Сохранить(Команда)
	ОбъектыПечати=Новый СписокЗначений;
	ОбъектыПечати.Добавить(объект.ТабличныйДокумент);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектыПечати", ОбъектыПечати);
	ОткрытьФорму("ОбщаяФорма.СохранениеПечатнойФормы", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры
