
&Вместо("ВвестиШтрихкод")
Процедура ВместоВвестиШтрихкодКочетов(Объект) Экспорт	
	
	Штрихкод = "";
	ТекстЗаголовка = НСтр("ru = 'Введите штрихкод'");
	ОписаниеОповещения = Новый ОписаниеОповещения("ОповещениеПоискаПоШтрихкоду", Объект);
	
	//ПоказатьВводСтроки(ОписаниеОповещения, Штрихкод, ТекстЗаголовка);	
	ОткрытьФорму("ОбщаяФорма.КочетовФормаПоискаПоШтрихКоду",,Объект,,ВариантОткрытияОкна.ОтдельноеОкно,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры
