
#Область ПрограммныйИнтерфейс

// Заполняет виды доступа, используемые в ограничениях прав доступа.
// Примечание: виды доступа Пользователи и ВнешниеПользователи предопределены,
// но их можно удалить из списка ВидыДоступа, если они не требуются для ограничения прав доступа.
//
// Параметры:
//  ВидыДоступа - ТаблицаЗначений - с колонками:
//   * Имя                    - Строка - имя используемое в описании поставляемых
//                                       профилей групп доступа и текстах ОДД.
//   * Представление          - Строка - представляет вид доступа в профилях и группах доступа.
//   * ТипЗначений            - Тип    - тип ссылки значений доступа,
//                                       например, Тип("СправочникСсылка.Номенклатура").
//   * ТипГруппЗначений       - Тип    - тип ссылки групп значений доступа,
//                                       например, Тип("СправочникСсылка.ГруппыДоступаНоменклатуры").
//   * НесколькоГруппЗначений - Булево - Истина указывает, что для значения доступа (Номенклатуры), можно
//                                       выбрать несколько групп значений (Групп доступа номенклатуры).
//
// Пример:
//  1. Для настройки прав доступа в разрезе организаций:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "Организации";
//  ВидДоступа.Представление = НСтр("ru = 'Организации'");
//  ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Организации");
//
//  2. Для настройки прав доступа в разрезе групп партнеров:
//  ВидДоступа = ВидыДоступа.Добавить();
//  ВидДоступа.Имя = "ГруппыПартнеров";
//  ВидДоступа.Представление    = НСтр("ru = 'Группы партнеров'");
//  ВидДоступа.ТипЗначений      = Тип("СправочникСсылка.Партнеры");
//  ВидДоступа.ТипГруппЗначений = Тип("СправочникСсылка.ГруппыДоступаПартнеров");
//
Процедура ПриЗаполненииВидовДоступа(ВидыДоступа) Экспорт
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "ВидыЦен";
	ВидДоступа.Представление = НСтр("ru = 'Виды цен'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.ВидыЦен");
	
	ВидДоступа = ВидыДоступа.Добавить();
	ВидДоступа.Имя = "Магазины";
	ВидДоступа.Представление = НСтр("ru = 'Магазины'");
	ВидДоступа.ТипЗначений   = Тип("СправочникСсылка.Магазины");
	
КонецПроцедуры

//// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
//	
//	Ограничение.Текст =
//	"РазрешитьЧтениеИзменение
//	|ГДЕ
//	|	ЗначениеРазрешено(Организация)
//	|	И ЗначениеРазрешено(Контрагент)";
//	
//КонецПроцедуры
//
// Параметры:
//  Списки - Соответствие - списки с ограничением доступа:
//             * Ключ     - ОбъектМетаданных - список с ограничением доступа.
//             * Значение - Булево - Истина - текст ограничения в модуле менеджера.
//                                 - Ложь   - текст ограничения в этом переопределяемом
//                модуле в процедуре ПриЗаполненииОграниченияДоступа.
//
Процедура ПриЗаполненииСписковСОграничениемДоступа(Списки) Экспорт
	
	Списки.Вставить(Метаданные.Документы.ВводОстатковДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатковРасчетовСПоставщиками, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиПользователей, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СоответствиеПодразделенийОрганизацийМагазинам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СкорректированныеФискальныеОперации, Истина);
	Списки.Вставить(Метаданные.Документы.АктОРасхожденияхПриПриемкеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказНаПеремещение, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомитентуОПродажах, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетКомитентуОСписании, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаТоваровМеждуОрганизациями, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремещениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.УстановкаСебестоимости, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗакупкиТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасхожденияПриПриемке, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСПоставщиками, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.СебестоимостьПоставкиТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыКПоступлению, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НоменклатураПоставщиков, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.СебестоимостьНоменклатуры, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаВыпускКиЗГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбИмпортеМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОПоступленииМаркированныхТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.УведомлениеОСписанииКиЗГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратТоваровПоставщику, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказПоставщику, Истина);
	Списки.Вставить(Метаданные.Документы.ПоступлениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ЗапросАкцизныхМарокЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ТТНВходящаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ТТНИсходящаяЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекЕГАИСВозврат, Истина);
	Списки.Вставить(Метаданные.Документы.ИзменениеАссортимента, Истина);
	Списки.Вставить(Метаданные.Документы.МаркетинговаяАкция, Истина);
	Списки.Вставить(Метаданные.Документы.ПрименениеЦенНоменклатуры, Истина);
	Списки.Вставить(Метаданные.Документы.РегистрацияПодсчетаПосетителей, Истина);
	Списки.Вставить(Метаданные.Документы.УстановкаЦенНоменклатуры, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.Посетители, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.Ассортимент, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДвиженияСерийныхНомеров, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДействиеСкидокНаценок, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДействующиеЦеныНоменклатуры, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ЦеныНоменклатуры, Истина);
	Списки.Вставить(Метаданные.Справочники.ВидыЦен, Истина);
	Списки.Вставить(Метаданные.Справочники.ПравилаЦенообразования, Истина);
	Списки.Вставить(Метаданные.Справочники.СкидкиНаценки, Истина);
	Списки.Вставить(Метаданные.Справочники.СчетчикиПодсчетаПосетителей, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УдалитьВидыОсобыхНалоговОрганизаций, Истина);
	Списки.Вставить(Метаданные.Справочники.КассыККМ, Истина);
	Списки.Вставить(Метаданные.Справочники.Магазины, Истина);
	Списки.Вставить(Метаданные.Документы.ЕжедневныйОтчет, Истина);
	Списки.Вставить(Метаданные.Документы.ЗарплатаКВыплатеОрганизаций, Истина);
	Списки.Вставить(Метаданные.Документы.ПоложениеОПремировании, Истина);
	Списки.Вставить(Метаданные.Документы.РасчетПремийПоЛичнымПродажам, Истина);
	Списки.Вставить(Метаданные.Документы.ТабельУчетаРабочегоВремени, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПремииПоЛичнымПродажам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ФактическоеРабочееВремяСотрудников, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ВыплаченнаяЗарплата, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ГрафикиРаботыМагазинов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ДействующиеПравилаРасчетаПремий, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПланируемоеРабочееВремяСотрудников, Истина);
	Списки.Вставить(Метаданные.Справочники.ИнтервалыРаботыМагазинов, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ФискальныеОперации, Истина);
	Списки.Вставить(Метаданные.Документы.ВводОстатковРасчетовСКлиентами, Истина);
	Списки.Вставить(Метаданные.Документы.ВнесениеДенежныхСредствВКассуККМ, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратТоваровОтПокупателя, Истина);
	Списки.Вставить(Метаданные.Документы.ВыемкаДенежныхСредствИзКассыККМ, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаменаДисконтныхКарт, Истина);
	Списки.Вставить(Метаданные.Документы.КассоваяСмена, Истина);
	Списки.Вставить(Метаданные.Документы.ОтчетОРозничныхПродажах, Истина);
	Списки.Вставить(Метаданные.Документы.РеализацияТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.СводныйОтчетПоКассовойСмене, Истина);
	Списки.Вставить(Метаданные.Документы.УстановкаПлощадиВыкладки, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекККМ, Истина);
	Списки.Вставить(Метаданные.Документы.ЧекКоррекции, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДвиженияСерийТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваККМ, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ЗаказыПокупателей, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.Продажи, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ПродажиПоПлатежнымКартам, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.РасчетыСКлиентами, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПлощадьТорговогоПространства, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПопыткиПродажПревышающихОстаток, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УдалитьРаспределениеПродажУслугПоОрганизациям, Истина);
	Списки.Вставить(Метаданные.Документы.АктПостановкиНаБалансЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.АктСписанияЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ВозвратИзРегистра2ЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.МаркировкаТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ОприходованиеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаОтражениеИзлишковТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаОтражениеНедостачТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаОтражениеРезультатовПересчетовТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОрдерНаПеремещениеТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ОстаткиЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ПередачаВРегистр2ЕГАИС, Истина);
	Списки.Вставить(Метаданные.Документы.ПеремаркировкаТоваровГИСМ, Истина);
	Списки.Вставить(Метаданные.Документы.ПересортицаТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПересчетТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПриказНаПроведениеИнвентаризацииТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.ПриходныйОрдерНаТовары, Истина);
	Списки.Вставить(Метаданные.Документы.РасходныйОрдерНаТовары, Истина);
	Списки.Вставить(Метаданные.Документы.СборкаТоваров, Истина);
	Списки.Вставить(Метаданные.Документы.СписаниеТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыКОтгрузке, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыКОформлениюИзлишковНедостач, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыНаСкладах, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ТоварыОрганизаций, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ИнформативныеОстаткиТоваровПоМагазинам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ИнформативныеОстаткиТоваровПоСкладам, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.НастройкиВариантовРаспределенияТоваров, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УдалитьРаспределениеПоступлений, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.УдалитьРаспределениеПродаж, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаказПокупателя, Истина);
	Списки.Вставить(Метаданные.Документы.ЗаявкаНаРасходованиеДенежныхСредств, Истина);
	Списки.Вставить(Метаданные.Документы.ОплатаОтПокупателяПлатежнойКартой, Истина);
	Списки.Вставить(Метаданные.Документы.ПриходныйКассовыйОрдер, Истина);
	Списки.Вставить(Метаданные.Документы.РасходныйКассовыйОрдер, Истина);
	Списки.Вставить(Метаданные.Документы.РегистрацияБезналичнойОплаты, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваКВыплате, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваКПоступлениюНаличные, Истина);
	Списки.Вставить(Метаданные.РегистрыНакопления.ДенежныеСредстваНаличные, Истина);
	Списки.Вставить(Метаданные.Справочники.Кассы, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.ПрименениеСистемНалогообложения, Истина);
	Списки.Вставить(Метаданные.РегистрыСведений.РаспределениеНоменклатуры, Истина);
	
	ЭлектронноеВзаимодействие.ПриЗаполненииСписковСОграничениемДоступа(Списки);
	
КонецПроцедуры

// Заполняет описания поставляемых профилей групп доступа и
// переопределяет параметры обновления профилей и групп доступа.
//
// Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  ОписанияПрофилей    - Массив - добавить описания профилей групп доступа (Структура).
//                        Состав свойств структуры см. УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа.
//
//  ПараметрыОбновления - Структура - содержит свойства:
//   * ОбновлятьИзмененныеПрофили - Булево - начальное значение Истина.
//   * ЗапретитьИзменениеПрофилей - Булево - начальное значение Истина.
//       Если установить Ложь, тогда поставляемые профили можно не только просматривать, но и редактировать.
//   * ОбновлятьГруппыДоступа     - Булево - начальное значение Истина.
//   * ОбновлятьГруппыДоступаСУстаревшимиНастройками - Булево - начальное значение Ложь.
//       Если установить Истина, то настройки значений, выполненные администратором для
//       вида доступа который был удален из профиля, будут также удалены из групп доступа.
//
// Пример:
//  ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
//  ОписаниеПрофиля.Имя           = "Менеджер";
//  ОписаниеПрофиля.Идентификатор = "75fa0ecb-98aa-11df-b54f-e0cb4ed5f655";
//  ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер по продажам'", Метаданные.ОсновнойЯзык.КодЯзыка);
//  ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
//  ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
//  ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
//  ОписаниеПрофиля.Роли.Добавить("Подсистема_Продажи");
//  ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовПокупателей");
//  ОписаниеПрофиля.Роли.Добавить("ПросмотрОтчетаКнигаПокупок");
//  ОписанияПрофилей.Добавить(ОписаниеПрофиля);
//
Процедура ПриЗаполненииПоставляемыхПрофилейГруппДоступа(ОписанияПрофилей, ПараметрыОбновления) Экспорт
	
	ОписанияПрофилей = Новый Массив;
	ОписатьПрофиль_Кладовщик(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_ОтветственныйЗаПодведениеИтоговИнвентаризации(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_Маркетолог(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_Кассир(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_Продавец(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_КассирОперационнойКассы(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_Управляющий(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_Менеджер(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_ОтветственныйЗаВедениеНоменклатуры(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_ОтветственныйЗаВедениеКонтрагентов(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_ОтветственныйЗаВедениеОрганизаций(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_АдминистраторСинхронизацииДанных(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_ПользовательСинхронизацииДанных(ОписанияПрофилей, ПараметрыОбновления);
	ОписатьПрофиль_ОтветственныйЗаОбменДаннымиСПодключаемымОборудованием(ОписанияПрофилей, ПараметрыОбновления);
	
КонецПроцедуры

// Заполняет зависимости прав доступа "подчиненного" объекта, например, задачи ЗадачаИсполнителя,
// от "ведущего" объекта, например,  бизнес-процесса Задание, которые отличаются от стандартных.
//
// Зависимости прав используются в стандартном шаблоне ограничения доступа для вида доступа "Объект".
// 1. Стандартно при чтении "подчиненного" объекта
//    проверяется наличие права чтения "ведущего" объекта и
//    проверяется отсутствие ограничения чтения "ведущего" объекта.
// 2. Стандартно при добавлении, изменении, удалении "подчиненного" объекта
//    проверяется наличие права изменения "ведущего" объекта и
//    проверяется отсутствие ограничения изменения "ведущего" объекта.
//
// Допускается только одно переназначение по сравнению со стандартным -
// в пункте "2)" вместо проверки права изменения "ведущего" объекта установить
// проверку права чтения "ведущего" объекта.
//
// Параметры:
//  ЗависимостиПрав - ТаблицаЗначений - с колонками:
//   * ВедущаяТаблица     - Строка - например, Метаданные.БизнесПроцессы.Задание.ПолноеИмя().
//   * ПодчиненнаяТаблица - Строка - например, Метаданные.Задачи.ЗадачаИсполнителя.ПолноеИмя().
//
Процедура ПриЗаполненииЗависимостейПравДоступа(ЗависимостиПрав) Экспорт
	
	
	
КонецПроцедуры

// Заполняет описания возможных прав, назначаемых для объектов, указанных типов.
// 
// Параметры:
//  ВозможныеПрава - ТаблицаЗначений - с колонками:
//   ВладелецПрав - Строка - полное имя таблицы значения доступа.
//
//   Имя          - Строка - идентификатор права, например, ИзменениеПапок. Право с именем УправлениеПравами
//                  должно быть обязательно определено для общей формы настройки прав "Права доступа".
//                  УправлениеПравами - это право на изменение прав по владельцу прав, которое проверяется
//                  при открытии РегистрСведений.НастройкиПравОбъектов.Форма.НастройкиПравОбъектов.
//
//   Заголовок    - Строка - заголовок права, например в форме НастройкиПравОбъектов:
//                  "Изменение.
//                  |папок".
//
//   Подсказка    - Строка - подсказка к заголовку права,
//                  например, "Добавление, изменение и пометка удаления папок".
//
//   НачальноеЗначение - Булево - начальное значение флажка права при добавлении новой строки
//                  в форме "Права доступа".
//
//   ТребуемыеПрава - Массив строк - имена прав, требуемых для от этого права,
//                  например, право "ДобавлениеФайлов" требует право "ИзменениеФайлов".
//
//   ЧтениеВТаблицах - Массив строк - полные имена таблиц, для которых это право обозначает право Чтение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц"
//                  т.к. право Чтение может зависеть только от права Чтение, то имеет смысл только символ "*"
//                  (требуется для работы шаблонов ограничения доступа).
//
//   ИзменениеВТаблицах - Массив строк - полные имена таблиц, для которых это право обозначает право Изменение.
//                  Возможно использование символа "*", который обозначает "для всех остальных таблиц"
//                  (требуется для работы шаблонов ограничения доступа).
//
Процедура ПриЗаполненииВозможныхПравДляНастройкиПравОбъектов(ВозможныеПрава) Экспорт
	
КонецПроцедуры

// Определяет вид используемого интерфейса пользователя для настройки доступа.
//
// Параметры:
//  УпрощенныйИнтерфейс - Булево - начальное значение Ложь.
//
Процедура ПриОпределенииИнтерфейсаНастройкиДоступа(УпрощенныйИнтерфейс) Экспорт
	
КонецПроцедуры

// Заполняет использование видов доступа в зависимости от функциональных опций конфигурации,
// например, ИспользоватьГруппыДоступаНоменклатуры.
//
// Параметры:
//  ВидДоступа    - Строка - имя вида доступа заданное в процедуре ПриЗаполненииВидовДоступа.
//  Использование - Булево - начальное значение Истина.
// 
Процедура ПриЗаполненииИспользованияВидаДоступа(ВидДоступа, Использование) Экспорт
	
	
	
КонецПроцедуры

// Позволяет переопределить ограничение, указанное в модуле менеджера объекта метаданных.
//
// Параметры:
//  Список - ОбъектМетаданных - список, для которого нужно вернуть текст ограничения.
//                              В процедуре ПриЗаполненииСписковСОграничениемДоступа нужно
//                              указать для списка значение Ложь, иначе вызова не будет.
//
//  Ограничение - Структура - со свойствами, как для процедур в модулях менеджеров. См. свойства
//                            в комментарии к процедуре ПриЗаполненииСписковСОграничениемДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Список, Ограничение) Экспорт
	
	
КонецПроцедуры

// Заполняет состав видов доступа, используемых при ограничении прав объектов метаданных.
// Если состав видов доступа не заполнен, отчет "Права доступа" покажет некорректные сведения.
//
// Обязательно требуется заполнить только виды доступа, используемые в шаблонах ограничения доступа
// явно, а виды доступа, используемые в наборах значений доступа могут быть получены из текущего
// состояния регистра сведений НаборыЗначенийДоступа.
//
//  Для автоматической подготовки содержимого процедуры следует воспользоваться инструментами
// разработчика для подсистемы Управление доступом.
//
// Параметры:
//  Описание     - Строка - многострочная строка формата <Таблица>.<Право>.<ВидДоступа>[.Таблица объекта],
//                 например, "Документ.ПриходнаяНакладная.Чтение.Организации",
//                           "Документ.ПриходнаяНакладная.Чтение.Контрагенты",
//                           "Документ.ПриходнаяНакладная.Изменение.Организации",
//                           "Документ.ПриходнаяНакладная.Изменение.Контрагенты",
//                           "Документ.ЭлектронныеПисьма.Чтение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.ЭлектронныеПисьма.Изменение.Объект.Документ.ЭлектронныеПисьма",
//                           "Документ.Файлы.Чтение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Чтение.Объект.Документ.ЭлектронноеПисьмо",
//                           "Документ.Файлы.Изменение.Объект.Справочник.ПапкиФайлов",
//                           "Документ.Файлы.Изменение.Объект.Документ.ЭлектронноеПисьмо".
//                 Вид доступа Объект предопределен, как литерал. Этот вид доступа используется в
//                 шаблонах ограничений доступа, как "ссылка" на другой объект, по которому
//                 ограничивается текущий объект таблицы.
//                 Когда вид доступа "Объект" задан, также требуется задать типы таблиц,
//                 которые используются для этого вида доступа. Т.е. перечислить типы,
//                 которые соответствуют полю, использованному в шаблоне ограничения доступа
//                 в паре с видом доступа "Объект". При перечислении типов по виду доступа "Объект"
//                 нужно перечислить только те типы поля, которые есть
//                 у поля РегистрыСведений.НаборыЗначенийДоступа.Объект, остальные типы лишние.
// 
Процедура ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание) Экспорт
	
	Описание =
	"
	|Справочник.ВерсииФайлов.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВерсииФайлов.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.ВидыЦен.Чтение.ВидыЦен
	|Справочник.ВидыЦен.Изменение.ВидыЦен
	|Справочник.ВнешниеПользователи.Чтение.ВнешниеПользователи
	|Справочник.ВнешниеПользователи.Изменение.ВнешниеПользователи
	|Справочник.ГруппыВнешнихПользователей.Чтение.ВнешниеПользователи
	|Справочник.ГруппыПользователей.Чтение.Пользователи
	|Справочник.ДополнительныеОтчетыИОбработки.Чтение.ДополнительныеОтчетыИОбработки
	|Справочник.ЗначенияСвойствОбъектов.Чтение.ДополнительныеСведения
	|Справочник.ЗначенияСвойствОбъектовИерархия.Чтение.ДополнительныеСведения
	|Справочник.ИнтервалыРаботыМагазинов.Чтение.Магазины
	|Справочник.ИнтервалыРаботыМагазинов.Изменение.Магазины
	|Справочник.Кассы.Чтение.Магазины
	|Справочник.Кассы.Изменение.Магазины
	|Справочник.КассыККМ.Чтение.Магазины
	|Справочник.КассыККМ.Изменение.Магазины
	|Справочник.Магазины.Изменение.Магазины
	|Справочник.ПапкиФайлов.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ПапкиФайлов.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Пользователи.Чтение.Пользователи
	|Справочник.Пользователи.Изменение.Пользователи
	|Справочник.ПравилаЦенообразования.Чтение.Объект.Справочник.ПравилаЦенообразования
	|Справочник.ПравилаЦенообразования.Изменение.Объект.Справочник.ПравилаЦенообразования
	|Справочник.СкидкиНаценки.Чтение.ВидыЦен
	|Справочник.СкидкиНаценки.Изменение.ВидыЦен
	|Справочник.СчетчикиПодсчетаПосетителей.Чтение.Магазины
	|Справочник.СчетчикиПодсчетаПосетителей.Изменение.Магазины
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.УчетныеЗаписиЭлектроннойПочты
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Чтение.Пользователи
	|Справочник.УчетныеЗаписиЭлектроннойПочты.Изменение.Пользователи
	|Справочник.Файлы.Чтение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.Объект.Справочник.ПапкиФайлов
	|Справочник.Файлы.Чтение.ВнешниеПользователи
	|Справочник.Файлы.Чтение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.Файлы.Изменение.ВнешниеПользователи
	|Справочник.Файлы.Изменение.НастройкиПрав.Справочник.ПапкиФайлов
	|Справочник.ШаблоныСообщений.Чтение.Пользователи
	|Справочник.ШаблоныСообщений.Изменение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Чтение.Пользователи
	|Справочник.ШаблоныСообщенийПрисоединенныеФайлы.Изменение.Пользователи
	|Документ.АктОРасхожденияхПриПриемкеТоваров.Чтение.Магазины
	|Документ.АктОРасхожденияхПриПриемкеТоваров.Изменение.Магазины
	|Документ.АктПостановкиНаБалансЕГАИС.Чтение.Магазины
	|Документ.АктПостановкиНаБалансЕГАИС.Изменение.Магазины
	|Документ.АктСписанияЕГАИС.Чтение.Магазины
	|Документ.АктСписанияЕГАИС.Изменение.Магазины
	|Документ.ВводОстатковДенежныхСредств.Чтение.Магазины
	|Документ.ВводОстатковДенежныхСредств.Изменение.Магазины
	|Документ.ВводОстатковРасчетовСКлиентами.Чтение.Магазины
	|Документ.ВводОстатковРасчетовСКлиентами.Изменение.Магазины
	|Документ.ВводОстатковРасчетовСПоставщиками.Чтение.Магазины
	|Документ.ВводОстатковРасчетовСПоставщиками.Изменение.Магазины
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Чтение.Магазины
	|Документ.ВнесениеДенежныхСредствВКассуККМ.Изменение.Магазины
	|Документ.ВозвратИзРегистра2ЕГАИС.Чтение.Магазины
	|Документ.ВозвратИзРегистра2ЕГАИС.Изменение.Магазины
	|Документ.ВозвратТоваровОтПокупателя.Чтение.Магазины
	|Документ.ВозвратТоваровОтПокупателя.Изменение.Магазины
	|Документ.ВозвратТоваровПоставщику.Чтение.Магазины
	|Документ.ВозвратТоваровПоставщику.Изменение.Магазины
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Чтение.Магазины
	|Документ.ВыемкаДенежныхСредствИзКассыККМ.Изменение.Магазины
	|Документ.ЕжедневныйОтчет.Чтение.Магазины
	|Документ.ЕжедневныйОтчет.Изменение.Магазины
	|Документ.ЗаказНаПеремещение.Чтение.Магазины
	|Документ.ЗаказНаПеремещение.Изменение.Магазины
	|Документ.ЗаказПокупателя.Чтение.Магазины
	|Документ.ЗаказПокупателя.Изменение.Магазины
	|Документ.ЗаказПоставщику.Чтение.Магазины
	|Документ.ЗаказПоставщику.Изменение.Магазины
	|Документ.ЗаменаДисконтныхКарт.Чтение.Магазины
	|Документ.ЗаменаДисконтныхКарт.Изменение.Магазины
	|Документ.ЗапросАкцизныхМарокЕГАИС.Чтение.Магазины
	|Документ.ЗапросАкцизныхМарокЕГАИС.Изменение.Магазины
	|Документ.ЗарплатаКВыплатеОрганизаций.Чтение.Магазины
	|Документ.ЗарплатаКВыплатеОрганизаций.Изменение.Магазины
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Чтение.Магазины
	|Документ.ЗаявкаНаВыпускКиЗГИСМ.Изменение.Магазины
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Чтение.Магазины
	|Документ.ЗаявкаНаРасходованиеДенежныхСредств.Изменение.Магазины
	|Документ.ИзменениеАссортимента.Чтение.Объект.Документ.ИзменениеАссортимента
	|Документ.ИзменениеАссортимента.Изменение.Объект.Документ.ИзменениеАссортимента
	|Документ.КассоваяСмена.Чтение.Магазины
	|Документ.КассоваяСмена.Изменение.Магазины
	|Документ.МаркетинговаяАкция.Чтение.Объект.Документ.МаркетинговаяАкция
	|Документ.МаркетинговаяАкция.Изменение.Объект.Документ.МаркетинговаяАкция
	|Документ.МаркировкаТоваровГИСМ.Чтение.Магазины
	|Документ.МаркировкаТоваровГИСМ.Изменение.Магазины
	|Документ.ОплатаОтПокупателяПлатежнойКартой.Чтение.Магазины
	|Документ.ОплатаОтПокупателяПлатежнойКартой.Изменение.Магазины
	|Документ.ОприходованиеТоваров.Чтение.Магазины
	|Документ.ОприходованиеТоваров.Изменение.Магазины
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Чтение.Магазины
	|Документ.ОрдерНаОтражениеИзлишковТоваров.Изменение.Магазины
	|Документ.ОрдерНаОтражениеНедостачТоваров.Чтение.Магазины
	|Документ.ОрдерНаОтражениеНедостачТоваров.Изменение.Магазины
	|Документ.ОрдерНаОтражениеРезультатовПересчетовТоваров.Чтение.Магазины
	|Документ.ОрдерНаОтражениеРезультатовПересчетовТоваров.Изменение.Магазины
	|Документ.ОрдерНаПеремещениеТоваров.Чтение.Магазины
	|Документ.ОрдерНаПеремещениеТоваров.Изменение.Магазины
	|Документ.ОстаткиЕГАИС.Чтение.Магазины
	|Документ.ОстаткиЕГАИС.Изменение.Магазины
	|Документ.ОтчетЕГАИС.Чтение.Магазины
	|Документ.ОтчетЕГАИС.Изменение.Магазины
	|Документ.ОтчетКомитентуОПродажах.Чтение.Магазины
	|Документ.ОтчетКомитентуОПродажах.Изменение.Магазины
	|Документ.ОтчетКомитентуОСписании.Чтение.Магазины
	|Документ.ОтчетКомитентуОСписании.Изменение.Магазины
	|Документ.ОтчетОРозничныхПродажах.Чтение.Магазины
	|Документ.ОтчетОРозничныхПродажах.Изменение.Магазины
	|Документ.ПередачаВРегистр2ЕГАИС.Чтение.Магазины
	|Документ.ПередачаВРегистр2ЕГАИС.Изменение.Магазины
	|Документ.ПередачаТоваровМеждуОрганизациями.Чтение.Объект.Документ.ПередачаТоваровМеждуОрганизациями
	|Документ.ПередачаТоваровМеждуОрганизациями.Изменение.Объект.Документ.ПередачаТоваровМеждуОрганизациями
	|Документ.ПеремаркировкаТоваровГИСМ.Чтение.Магазины
	|Документ.ПеремаркировкаТоваровГИСМ.Изменение.Магазины
	|Документ.ПеремещениеТоваров.Чтение.Магазины
	|Документ.ПеремещениеТоваров.Изменение.Магазины
	|Документ.ПересортицаТоваров.Чтение.Магазины
	|Документ.ПересортицаТоваров.Изменение.Магазины
	|Документ.ПересчетТоваров.Чтение.Магазины
	|Документ.ПересчетТоваров.Изменение.Магазины
	|Документ.ПоложениеОПремировании.Чтение.Объект.Документ.ПоложениеОПремировании
	|Документ.ПоложениеОПремировании.Изменение.Объект.Документ.ПоложениеОПремировании
	|Документ.ПоступлениеТоваров.Чтение.Магазины
	|Документ.ПоступлениеТоваров.Изменение.Магазины
	|Документ.ПриказНаПроведениеИнвентаризацииТоваров.Чтение.Магазины
	|Документ.ПриказНаПроведениеИнвентаризацииТоваров.Изменение.Магазины
	|Документ.ПрименениеЦенНоменклатуры.Чтение.Магазины
	|Документ.ПрименениеЦенНоменклатуры.Изменение.Магазины
	|Документ.ПриходныйКассовыйОрдер.Чтение.Магазины
	|Документ.ПриходныйКассовыйОрдер.Изменение.Магазины
	|Документ.ПриходныйОрдерНаТовары.Чтение.Магазины
	|Документ.ПриходныйОрдерНаТовары.Изменение.Магазины
	|Документ.РасходныйКассовыйОрдер.Чтение.Магазины
	|Документ.РасходныйКассовыйОрдер.Изменение.Магазины
	|Документ.РасходныйОрдерНаТовары.Чтение.Магазины
	|Документ.РасходныйОрдерНаТовары.Изменение.Магазины
	|Документ.РасчетПремийПоЛичнымПродажам.Чтение.Магазины
	|Документ.РасчетПремийПоЛичнымПродажам.Изменение.Магазины
	|Документ.РеализацияТоваров.Чтение.Магазины
	|Документ.РеализацияТоваров.Изменение.Магазины
	|Документ.РегистрацияБезналичнойОплаты.Чтение.Магазины
	|Документ.РегистрацияБезналичнойОплаты.Изменение.Магазины
	|Документ.РегистрацияПодсчетаПосетителей.Чтение.Магазины
	|Документ.РегистрацияПодсчетаПосетителей.Изменение.Магазины
	|Документ.СборкаТоваров.Чтение.Магазины
	|Документ.СборкаТоваров.Изменение.Магазины
	|Документ.СводныйОтчетПоКассовойСмене.Чтение.Магазины
	|Документ.СводныйОтчетПоКассовойСмене.Изменение.Магазины
	|Документ.СписаниеТоваров.Чтение.Магазины
	|Документ.СписаниеТоваров.Изменение.Магазины
	|Документ.ТабельУчетаРабочегоВремени.Чтение.Магазины
	|Документ.ТабельУчетаРабочегоВремени.Изменение.Магазины
	|Документ.ТТНВходящаяЕГАИС.Чтение.Магазины
	|Документ.ТТНВходящаяЕГАИС.Изменение.Магазины
	|Документ.ТТНИсходящаяЕГАИС.Чтение.Магазины
	|Документ.ТТНИсходящаяЕГАИС.Изменение.Магазины
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Чтение.Магазины
	|Документ.УведомлениеОбИмпортеМаркированныхТоваровГИСМ.Изменение.Магазины
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Чтение.Магазины
	|Документ.УведомлениеОбОтгрузкеМаркированныхТоваровГИСМ.Изменение.Магазины
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Чтение.Магазины
	|Документ.УведомлениеОВвозеМаркированныхТоваровИзЕАЭСГИСМ.Изменение.Магазины
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Чтение.Магазины
	|Документ.УведомлениеОПоступленииМаркированныхТоваровГИСМ.Изменение.Магазины
	|Документ.УведомлениеОСписанииКиЗГИСМ.Чтение.Магазины
	|Документ.УведомлениеОСписанииКиЗГИСМ.Изменение.Магазины
	|Документ.УстановкаПлощадиВыкладки.Чтение.Магазины
	|Документ.УстановкаПлощадиВыкладки.Изменение.Магазины
	|Документ.УстановкаСебестоимости.Чтение.Магазины
	|Документ.УстановкаСебестоимости.Изменение.Магазины
	|Документ.УстановкаЦенНоменклатуры.Чтение.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.УстановкаЦенНоменклатуры.Изменение.Объект.Документ.УстановкаЦенНоменклатуры
	|Документ.ЧекЕГАИС.Чтение.Магазины
	|Документ.ЧекЕГАИС.Изменение.Магазины
	|Документ.ЧекЕГАИСВозврат.Чтение.Магазины
	|Документ.ЧекЕГАИСВозврат.Изменение.Магазины
	|Документ.ЧекККМ.Чтение.Магазины
	|Документ.ЧекККМ.Изменение.Магазины
	|Документ.ЧекКоррекции.Чтение.Магазины
	|Документ.ЧекКоррекции.Изменение.Магазины
	|ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.Ассортимент.Чтение.ВидыЦен
	|РегистрСведений.ВыплаченнаяЗарплата.Чтение.Магазины
	|РегистрСведений.ГрафикиРаботыМагазинов.Чтение.Магазины
	|РегистрСведений.ГрафикиРаботыМагазинов.Изменение.Магазины
	|РегистрСведений.ДанныеБизнесПроцессов.Чтение.Объект.БизнесПроцесс.Задание
	|РегистрСведений.ДвиженияСерийныхНомеров.Чтение.Магазины
	|РегистрСведений.ДействиеСкидокНаценок.Чтение.Магазины
	|РегистрСведений.ДействующиеПравилаРасчетаПремий.Чтение.Объект.Документ.ПоложениеОПремировании
	|РегистрСведений.ДействующиеЦеныНоменклатуры.Чтение.Магазины
	|РегистрСведений.ДополнительныеСведения.Чтение.ДополнительныеСведения
	|РегистрСведений.ДополнительныеСведения.Изменение.ДополнительныеСведения
	|РегистрСведений.ИнформативныеОстаткиТоваровПоМагазинам.Чтение.Магазины
	|РегистрСведений.ИнформативныеОстаткиТоваровПоСкладам.Чтение.Магазины
	|РегистрСведений.НастройкиВариантовРаспределенияТоваров.Чтение.Магазины
	|РегистрСведений.НастройкиВариантовРаспределенияТоваров.Изменение.Магазины
	|РегистрСведений.НастройкиПользователей.Чтение.Магазины
	|РегистрСведений.НоменклатураПоставщиков.Чтение.Магазины
	|РегистрСведений.НоменклатураПоставщиков.Изменение.Магазины
	|РегистрСведений.ПланируемоеРабочееВремяСотрудников.Чтение.Магазины
	|РегистрСведений.ПланируемоеРабочееВремяСотрудников.Изменение.Магазины
	|РегистрСведений.ПлощадьТорговогоПространства.Чтение.Магазины
	|РегистрСведений.ПлощадьТорговогоПространства.Изменение.Магазины
	|РегистрСведений.ПопыткиПродажПревышающихОстаток.Чтение.Магазины
	|РегистрСведений.УдалитьВидыОсобыхНалоговОрганизаций.Чтение.Магазины
	|РегистрСведений.УдалитьВидыОсобыхНалоговОрганизаций.Изменение.Магазины
	|РегистрСведений.УдалитьРаспределениеПоступлений.Чтение.Магазины
	|РегистрСведений.УдалитьРаспределениеПоступлений.Изменение.Магазины
	|РегистрСведений.УдалитьРаспределениеПродаж.Чтение.Магазины
	|РегистрСведений.УдалитьРаспределениеПродаж.Изменение.Магазины
	|РегистрСведений.УдалитьРаспределениеПродажУслугПоОрганизациям.Чтение.Магазины
	|РегистрСведений.УдалитьРаспределениеПродажУслугПоОрганизациям.Изменение.Магазины
	|РегистрСведений.РаспределениеНоменклатуры.Чтение.Магазины
	|РегистрСведений.РаспределениеНоменклатуры.Изменение.Магазины
	|РегистрСведений.СебестоимостьНоменклатуры.Чтение.Магазины
	|РегистрСведений.СкорректированныеФискальныеОперации.Изменение.Магазины
	|РегистрСведений.СоответствиеПодразделенийОрганизацийМагазинам.Чтение.Магазины
	|РегистрСведений.СоответствиеПодразделенийОрганизацийМагазинам.Изменение.Магазины
	|РегистрСведений.СоставыГруппПользователей.Чтение.ВнешниеПользователи
	|РегистрСведений.СоставыГруппПользователей.Чтение.Пользователи
	|РегистрСведений.УдалитьХранимыеФайлыВерсий.Чтение.Объект.БизнесПроцесс.Задание
	|РегистрСведений.УдалитьХранимыеФайлыВерсий.Чтение.Объект.Справочник.Контрагенты
	|РегистрСведений.УдалитьХранимыеФайлыВерсий.Чтение.Объект.Справочник.НастройкиРМК
	|РегистрСведений.УдалитьХранимыеФайлыВерсий.Чтение.Объект.Справочник.Номенклатура
	|РегистрСведений.УдалитьХранимыеФайлыВерсий.Чтение.Объект.Справочник.ПапкиФайлов
	|РегистрСведений.ЦеныНоменклатуры.Чтение.ВидыЦен
	|РегистрСведений.ФискальныеОперации.Чтение.Магазины
	|РегистрСведений.ФискальныеОперации.Изменение.Магазины
	|РегистрНакопления.ДвиженияСерийТоваров.Чтение.Магазины
	|РегистрНакопления.ДенежныеСредстваКВыплате.Чтение.Магазины
	|РегистрНакопления.ДенежныеСредстваККМ.Чтение.Магазины
	|РегистрНакопления.ДенежныеСредстваНаличные.Чтение.Магазины
	|РегистрНакопления.ДенежныеСредстваКПоступлениюНаличные.Чтение.Магазины
	|РегистрНакопления.ЗаказыПокупателей.Чтение.Магазины
	|РегистрНакопления.ЗаказыТоваров.Чтение.Магазины
	|РегистрНакопления.ЗакупкиТоваров.Чтение.Магазины
	|РегистрНакопления.ЗакупкиТоваров.Изменение.Магазины
	|РегистрНакопления.Посетители.Чтение.Магазины
	|РегистрНакопления.ПремииПоЛичнымПродажам.Чтение.Магазины
	|РегистрНакопления.Продажи.Чтение.Магазины
	|РегистрНакопления.ПродажиПоПлатежнымКартам.Чтение.Магазины
	|РегистрНакопления.РасчетыСПоставщиками.Чтение.Магазины
	|РегистрНакопления.РасчетыСКлиентами.Чтение.Магазины
	|РегистрНакопления.РасхожденияПриПриемке.Чтение.Магазины
	|РегистрНакопления.СебестоимостьПоставкиТоваров.Чтение.Магазины
	|РегистрНакопления.ТоварыКОтгрузке.Чтение.Магазины
	|РегистрНакопления.ТоварыКОформлениюИзлишковНедостач.Чтение.Магазины
	|РегистрНакопления.ТоварыКПоступлению.Чтение.Магазины
	|РегистрНакопления.ТоварыНаСкладах.Чтение.Магазины
	|РегистрНакопления.ТоварыОрганизаций.Чтение.Магазины
	|РегистрНакопления.ФактическоеРабочееВремяСотрудников.Чтение.Магазины
	|БизнесПроцесс.Задание.Чтение.Пользователи
	|БизнесПроцесс.Задание.Изменение.Пользователи
	|Задача.ЗадачаИсполнителя.Чтение.Объект.БизнесПроцесс.Задание
	|Задача.ЗадачаИсполнителя.Чтение.Пользователи
	|Задача.ЗадачаИсполнителя.Изменение.Пользователи
	|";
	
	ЭлектронноеВзаимодействие.ПриЗаполненииВидовОграниченийПравОбъектовМетаданных(Описание);
	
КонецПроцедуры

// Позволяет реализовать перезапись зависимых наборов значений доступа других объектов.
//
// Вызывается из процедур
//  УправлениеДоступомСлужебный.ЗаписатьНаборыЗначенийДоступа,
//  УправлениеДоступомСлужебный.ЗаписатьЗависимыеНаборыЗначенийДоступа.
//
// Параметры:
//  Ссылка       - СправочникСсылка, ДокументСсылка, ... - ссылка на объект, для которого
//                 записаны наборы значений доступа.
//
//  СсылкиНаЗависимыеОбъекты - Массив - массив элементов типа СправочникСсылка, ДокументСсылка, ...
//                 Содержит ссылки на объекты с зависимыми наборами значений доступа.
//                 Начальное значение - пустой массив.
//
Процедура ПриИзмененииНаборовЗначенийДоступа(Ссылка, СсылкиНаЗависимыеОбъекты) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОписатьПрофиль_Кладовщик(ОписанияПрофилей, ПараметрыОбновления)
	
	// Описание для заполнения профиля "Кладовщик".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Кладовщик";
	ОписаниеПрофиля.Идентификатор = "44639859-e400-461d-a1f8-c469b03298e4";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Кладовщик'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Под профилем происходит выполнение операций по приемке, отгрузке и сборке товаров.'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрдеровНаОтражениеНедостачИзлишков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрдеровНаПеремещениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШтрихкодов");

	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКладовщика");

	ОписаниеПрофиля.Роли.Добавить("ПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ПрименениеЦенНоменклатуры");

	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПриПриемкеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхОпросаПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоКонтрагентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоМагазинам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОснованияВыдачиДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровРегистраторы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровВозвратовТоваровПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилОтбораТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриказНаПроведениеИнвентаризацииТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкидки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовРаспределения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОСписании");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНомеровГТД");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачВРегистр2ЕГАИСРТ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЕГАИСРТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовЕГАИС");
	
	// Виды Доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("Магазины", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	//Подсистемы
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаЗапасыИЗакупкиЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаЗапасыИЗакупкиСнабжение");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаЗапасыИЗакупкиРаботаСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаНормативноСправочнаяИнформация");
	
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСкладСкладскиеОперации");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСкладИнвентаризация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСкладПриемкаОтгрузка");
	
	//Рабочий стол
	ОписаниеПрофиля.Роли.Добавить("РабочийСтолКладовщика");
	
	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировокТоваровГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОбОтгрузкеМаркированныхТоваровГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОСписанииКиЗГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	
	//ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеХозяйствующихСубъектовВЕТИС");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_ОтветственныйЗаПодведениеИтоговИнвентаризации(ОписанияПрофилей, ПараметрыОбновления)
	
	// Описание для заполнения профиля "ОтветственныйЗаПодведениеИтоговИнвентаризации".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаПодведениеИтоговИнвентаризации";
	ОписаниеПрофиля.Идентификатор = "42455a45-a4d4-4cef-b472-ac602cd2be19";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за подведение итогов инвентаризации'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Под профилем происходит выполнение операций по приемке, отгрузке и сборке товаров.'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСкладскихАктов");
	
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКладовщика");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиОтветственногоЗаПроведениеИнвентаризации");

	ОписаниеПрофиля.Роли.Добавить("ПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ПрименениеЦенНоменклатуры");

	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхОпросаПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоКонтрагентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоМагазинам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОснованияВыдачиДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровРегистраторы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаОтражениеНедостачИзлишков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаПеремещениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровВозвратовТоваровПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилОтбораТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриказНаПроведениеИнвентаризацииТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкидки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНомеровГТД");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОСписании");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовЕГАИСРТ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЕГАИСРТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовЕГАИС");
	
	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОСписанииКиЗГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	
	// Виды Доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("Магазины", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	//Подсистемы
	
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСкладСкладскиеОперации");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСкладИнвентаризация");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_Маркетолог(ОписанияПрофилей, ПараметрыОбновления)
	
	// Описание для заполнения профиля "Маркетолог".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Маркетолог";
	ОписаниеПрофиля.Идентификатор = "6922f79c-402d-42ca-92fb-b9eb0e23e21a";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Маркетолог'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Маркетолог'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхОпросаПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаОстатковПоНакопительнымСкидкам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаменДисконтныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформационныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсполнителейРолейПоОбъектамАдресации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркетинговыхАкций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилЦенообразования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродаж");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродажиПоПлатежнымКартам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСкидки");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШтрихкодов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАссортимента");

	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиМаркетолога");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПодарочныеСертификаты");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПоПерсоналу");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПоЭффективности");

	ОписаниеПрофиля.Роли.Добавить("ПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ПрименениеЦенНоменклатуры");

	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоНакопительнымСкидкам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводОстатковРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнешнихПользователей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхОпросаПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕжедневныхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаменДисконтныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗарплатыКВыплатеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоКонтрагентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоМагазинам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПерсоналу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоРаботеПерсонала");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхСмен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРегистров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаркетинговыхАкций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОплатОтПокупателяПлатежнойКартой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаОтражениеНедостачИзлишков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаПеремещениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОснованияВыдачиДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассахККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствНаличных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровРегистраторы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОСписании");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровВозвратовТоваровПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилОтбораТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриказНаПроведениеИнвентаризацииТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродажиПоПлатежнымКартам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистрацийПодсчетаПосетителей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСводныхОтчетовПоКассовойСмене");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетчиковПодсчетаПосетителей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоварыКПоступлениюРеализации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУстановокСебестоимости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНомеровГТД");
	
	// Виды Доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("Магазины", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	//Подсистемы
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингМаркетинговыеАкции");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингПодарочныеСертификаты");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингПосетители");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингПрименениеЦен");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингСегментация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингЦенообразование");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингАссортимент");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаЗапасыИЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПродажи");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_Кассир(ОписанияПрофилей, ПараметрыОбновления)
	
	// Описание для заполнения профиля "Кассир".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Кассир";
	ОписаниеПрофиля.Идентификатор = "e8621c62-d520-4c79-aa32-d831c6140a5f";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Кассир'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Кассир ККМ'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровОтПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхОпросаПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаменДисконтныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформационныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовыхСмен");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекПродаж");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОплатОтПокупателяПлатежнойКартой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСводныхОтчетовПоКассовойСмене");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШтрихкодов");
	
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиВозвратТоваровОтРозничногоПокупателя");

	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКассира");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиПродавца");
	
	ОписаниеПрофиля.Роли.Добавить("ПрименениеЦенНоменклатуры");

	ОписаниеПрофиля.Роли.Добавить("ЧтениеБезналичнойОплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоНакопительнымСкидкам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводОстатковРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕжедневныхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗарплатыКВыплатеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоКонтрагентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоМагазинам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформационныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРегистров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаркетинговыхАкций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОплатОтПокупателяПлатежнойКартой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаОтражениеНедостачИзлишков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаПеремещениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОснованияВыдачиДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассахККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствНаличных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОСписании");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровРегистраторы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровВозвратовТоваровПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилОтбораТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриказНаПроведениеИнвентаризацииТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистрацийПодсчетаПосетителей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкидки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоварыКПоступлениюРеализации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУстановокСебестоимости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНомеровГТД");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовСписанияЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИСРТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЕГАИСРТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	
	// Виды Доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("Магазины", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	//Подсистемы
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПродажи");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПродажиПрочее");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПродажиРозничныеПродажи");
	
	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОбОтгрузкеМаркированныхТоваровГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОСписанииКиЗГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_Продавец(ОписанияПрофилей, ПараметрыОбновления)
	
	// Описание для заполнения профиля "Продавец".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Продавец";
	ОписаниеПрофиля.Идентификатор = "91cfadaa-9c9e-4535-ae62-4fc5e5749182";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Продавец'");
	ОписаниеПрофиля.Описание = НСтр("ru = 'Продавец'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВозвратовТоваровОтПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхОпросаПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаменДисконтныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформационныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРеализацииТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШтрихкодов");
	
	//ОписаниеПрофиля.Роли.Добавить("НастройкаНормативноСправочнойИнформации");

	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКладовщика");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиПродавца");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПодарочныеСертификаты");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПоПерсоналу");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПродажи");

	ОписаниеПрофиля.Роли.Добавить("ПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ПрименениеЦенНоменклатуры");

	ОписаниеПрофиля.Роли.Добавить("ЧтениеБезналичнойОплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковПоНакопительнымСкидкам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводОстатковРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЕжедневныхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗадач");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗарплатыКВыплатеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоКонтрагентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоМагазинам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоРаботеПерсонала");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформационныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхСмен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКорректировокРегистров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаркетинговыхАкций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОплатОтПокупателяПлатежнойКартой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОплатОтПокупателяПлатежнойКартой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаОтражениеНедостачИзлишков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаПеремещениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОснованияВыдачиДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассахККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствНаличных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровРегистраторы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОСписании");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровВозвратовТоваровПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилОтбораТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриказНаПроведениеИнвентаризацииТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПриходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасходныхОрдеровНаТовары");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистрацийПодсчетаПосетителей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСборокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСводныхОтчетовПоКассовойСмене");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкидки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУстановокСебестоимости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНомеровГТД");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧековЕГАИСРТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЕГАИСРТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовЕГАИС");
	
	//МОТП
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	
	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОбОтгрузкеМаркированныхТоваровГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	
	//ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеХозяйствующихСубъектовВЕТИС");
	
	// Виды Доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("Магазины", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	//Подсистемы
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПродажи");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПродажиПрочее");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПродажиРозничныеПродажи");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаЗапасыИЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_КассирОперационнойКассы(ОписанияПрофилей, ПараметрыОбновления)
	
	// Описание для заполнения профиля "КассирОперационнойКассы".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "КассирОперационнойКассы";
	ОписаниеПрофиля.Идентификатор = "4885520e-0ed2-4357-aca8-23041ea4998e";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Кассир операционной кассы'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Кассир операционной кассы'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыплаченнаяЗарплата");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеЗарплатыКВыплатеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКассовыхСмен");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОплатОтПокупателяПлатежнойКартой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродаж");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБезналичнойОплаты");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛистовКассовойКниги");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасчетовСКлиентами");

	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКассира");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКассираОперационнойКассы");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПодарочныеСертификаты");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПоПерсоналу");

	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводОстатковРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнаяЗарплата");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхОпросаПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоКонтрагентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоМагазинам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОснованияВыдачиДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровРегистраторы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОСписании");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовОРозничныхПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоступленийТоваровВозвратовТоваровПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкидки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНомеровГТД");
	
	// Виды Доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("Магазины", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	//Подсистемы
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаФинансы");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаФинансыДенежныеСредства");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаФинансыПланированиеИКонтрольДС");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_Управляющий(ОписанияПрофилей, ПараметрыОбновления)
	
	// Описание для заполнения профиля "Управляющий".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Управляющий";
	ОписаниеПрофиля.Идентификатор = "7d509b56-976f-4b67-9f0b-a93de75c2134";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Управляющий'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Управляющий'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВыплаченнаяЗарплата");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхОпросаПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДействующихЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЕжедневныхОтчетов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗарплатыКВыплатеОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформацииПоПерсоналу");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформацииПоРаботеПерсонала");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПриказНаПроведениеИнвентаризацииТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродаж");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродажиПоПлатежнымКартам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеТоварыКПоступлениюРеализации");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШтрихкодов");
	
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКассира");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКассираОперационнойКассы");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиКладовщика");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиМаркетолога");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиМенеджера");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиПродавца");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПодарочныеСертификаты");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПоПерсоналу");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПоЭффективности");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПродажи");

	ОписаниеПрофиля.Роли.Добавить("ПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ПрименениеЦенНоменклатуры");

	ОписаниеПрофиля.Роли.Добавить("ЧтениеАктовОРасхожденияхПриПриемкеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводаОстатковРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводОстатковРасчетовСПоставщиками");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВнесенияВыемкиДСПоКассеККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВыплаченнаяЗарплата");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхОпросаПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаменДисконтныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоКонтрагентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоМагазинам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоРаботеПерсонала");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхСмен");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаркетинговыхАкций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОплатОтПокупателяПлатежнойКартой");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаОтражениеНедостачИзлишков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОснованияВыдачиДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредств");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствВКассахККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствКПоступлению");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковДенежныхСредствНаличных");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровРегистраторы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОПродажах");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовКомитентуОСписании");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПередачТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПодключаемогоОборудования");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилОтбораТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродажиПоПлатежнымКартам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетовСКлиентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРегистрацийПодсчетаПосетителей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкидки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСчетчиковПодсчетаПосетителей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТоварыКПоступлениюРеализации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБезналичнойОплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовойКниги");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУстановокСебестоимости");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилаРасчетаПремий");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРасчетПремийПоЛичнымПродажам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПоложениеОПремировании");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилаРасчетаПремий");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоложениеОПремировании");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеРасчетПремийПоЛичнымПродажам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеТабельУчетаРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЧтениеТабельУчетаРабочегоВремени");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВариантовРаспределения");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНомеровГТД");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЕГАИСРТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовЕГАИС");
	
	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("НастройкиОбменаГИСМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДокументовЗакупкиГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаркировокТоваровГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОбОтгрузкеМаркированныхТоваровГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУведомленийОСписанииКиЗГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	
	//ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеХозяйствующихСубъектовВЕТИС");
	
	//ИПП
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	
	//БЭД
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложенийБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоВзаимодействия");
	// БЭД из БСП
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	
	// Виды Доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("Магазины", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	//Подсистемы
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаЗапасыИЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетинг");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингАссортимент");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингМаркетинговыеАкции");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингПодарочныеСертификаты");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингПосетители");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингПрименениеЦен");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингСегментация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаМаркетингЦенообразование");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаФинансы");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПродажи");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаПерсонал");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСкладСкладскиеОперации");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСкладИнвентаризация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСкладПриемкаОтгрузка");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаФинансыПланированиеИКонтрольДС");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_Менеджер(ОписанияПрофилей, ПараметрыОбновления)
	
	// Описание для заполнения профиля "Менеджер".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "Менеджер";
	ОписаниеПрофиля.Идентификатор = "069a4464-42a0-4c5e-93da-4fcd98c713a7";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Менеджер'");
	ОписаниеПрофиля.Описание =
		НСтр("ru = 'Менеджер'");
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАктовОРасхожденияхПриПриемкеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДействующихЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовНаПеремещение");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаказовПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОплатОтПокупателяПлатежнойКартой");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрдеровНаПеремещениеТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПередачТоваровМеждуОрганизациями");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПеремещенийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийТоваровВозвратовПоставщику");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПоступленийТоваровВозвратовТоваровПоставщикам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПравилЦенообразования");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродаж");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродажиПоПлатежнымКартам");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУстановокСебестоимости");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаявокНаРасходДС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВариантовРаспределения");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомитентуОПродажах");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОтчетовКомитентуОСписании");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНомеровГТД");
	
	ОписаниеПрофиля.Роли.Добавить("РаботаСПоставляемойНоменклатурой");
	
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиМаркетолога");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыИОбработкиМенеджера");
	ОписаниеПрофиля.Роли.Добавить("ОтчетыПоЭффективности");

	ОписаниеПрофиля.Роли.Добавить("ПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ПрименениеЦенНоменклатуры");

	ОписаниеПрофиля.Роли.Добавить("ЧтениеВозвратовТоваровОтПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДанныхОпросаПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаказовПокупателей");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаменДисконтныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоКонтрагентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоМагазинам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКассовыхОрдеров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаркетинговыхАкций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрдеровНаОтражениеНедостачИзлишков");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОснованияВыдачиДС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровРегистраторы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПравилОтбораТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродаж");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродажиПоПлатежнымКартам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеРеализацийТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСебестоимостиТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкидки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкладскихАктов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЧековККМ");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеБезналичнойОплаты");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВводОстатковРасчетовСПоставщиками");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЕГАИСРТ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("СопоставлениеНоменклатурыЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("СопоставлениеОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОтчетовЕГАИС");
	
	//МОТП
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПроверкаИПодборТабачнойПродукцииМОТП");
	
	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДокументовЗакупкиГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеМаркировокТоваровГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОбОтгрузкеМаркированныхТоваровГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУведомленийОСписанииКиЗГИСМРТ");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанель1СМаркировка");
	
	//ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеХозяйствующихСубъектовВЕТИС");
	
	//ИПП
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНовостей");
	
	//БЭД
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДокументамиБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхДокументов");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНастроекТорговыхПредложений");
	ОписаниеПрофиля.Роли.Добавить("ПоискТорговыхПредложенийБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеМаршрутовПодписания");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекБизнесСеть");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекОбменаСКонтрагентами");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНастроекЭлектронногоВзаимодействия");
	// БЭД из БСП
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	
	// Виды Доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("Магазины", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	//Подсистемы
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаЗапасыИЗакупки");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаНормативноСправочнаяИнформация");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСклад");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаФинансыПланированиеИКонтрольДС");
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаСкладПриемкаОтгрузка");
	
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_ОтветственныйЗаВедениеНоменклатуры(ОписанияПрофилей, ПараметрыОбновления)
	
	// Описание для заполнения профиля "Ответственный за ведение номенклатуры".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеНоменклатуры";
	ОписаниеПрофиля.Идентификатор = "b6d3784f-cb6d-4eec-a6d8-a0557d154325";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение номенклатуры'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Ответственный за ведение номенклатуры'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификаторовИНастроекНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНоменклатуры");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформационныхКарт");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеШтрихкодов");
	ОписаниеПрофиля.Роли.Добавить("ПечатьЭтикетокИЦенников");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоКонтрагентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоМагазинам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковТоваровРегистраторы");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСкидки");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЦенНоменклатуры");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("СопоставлениеНоменклатурыЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("СопоставлениеОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТТНЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТТНЕГАИС");
	
	// БЭД
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДанныхРаботаСНоменклатурой");
	
	// Виды Доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("Магазины", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	//Подсистемы
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаНормативноСправочнаяИнформация");
	
	// Описание поставляемого профиля.
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_ОтветственныйЗаВедениеКонтрагентов(ОписанияПрофилей, ПараметрыОбновления)

	// Описание для заполнения профиля "Ответственный за ведение контрагентов".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеКонтрагентов";
	ОписаниеПрофиля.Идентификатор = "5f45f518-f814-4695-a18d-08b6b9ab7285";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение контрагентов'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Ответственный за ведение контрагентов'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеИнформацииПоКонтрагентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоКонтрагентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоМагазинам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПерсоналу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("СопоставлениеОрганизацийЕГАИС");
	
	// Виды Доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("Магазины", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	//Подсистемы
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаНормативноСправочнаяИнформация");
	
	// Описание поставляемого профиля.
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_ОтветственныйЗаВедениеОрганизаций(ОписанияПрофилей, ПараметрыОбновления)
	
	// Описание для заполнения профиля "Ответственный за ведение организаций".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаВедениеОрганизаций";
	ОписаниеПрофиля.Идентификатор = "3fbec37c-447f-4897-a663-52c504f3e078";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за ведение организаций'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Ответственный за ведение организаций'");
	
	ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля);

	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеДополнительныхРеквизитовИСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеАдресныхСведений");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеБанков");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоКонтрагентам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоМагазинам");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоНоменклатуре");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоПерсоналу");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииПоРаботеПерсонала");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНормативноСправочнойИнформации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОрганизацийИБанковскихСчетовОрганизаций");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПерсональныхДанныхФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеФизическихЛиц");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАссортимента");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("СопоставлениеОрганизацийЕГАИС");
	
	// Виды Доступа
	ОписаниеПрофиля.ВидыДоступа.Добавить("Магазины", "ВначалеВсеРазрешены");
	ОписаниеПрофиля.ВидыДоступа.Добавить("ВидыЦен", "ВначалеВсеРазрешены");
	
	//Подсистемы
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаНормативноСправочнаяИнформация");
	
	// Описание поставляемого профиля.
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_АдминистраторСинхронизацииДанных(ОписанияПрофилей, ПараметрыОбновления)
	
	// Описание для заполнения профиля "Администратор синхронизации данных".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "АдминистраторСинхронизацииДанных";
	ОписаниеПрофиля.Идентификатор = "6b0e2d0d-0fe8-11e3-94f9-5404a6a6831f";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Администратор синхронизации данных'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Администратор синхронизации данных'");
	
	ОписаниеПрофиля.Роли.Добавить("Администрирование");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиССайтом");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеВводаНачальныхОстатковУзла");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУзловПлановОбмена");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ОбновлениеКонфигурацииБазыДанных");
	
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("УдаленныйДоступБазоваяФункциональность");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийПодсистем");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОВерсияхОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНаборовЗначенийДоступа");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбщихНастроекУзловИнформационныхБаз");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУзловПлановОбмена");
	
	//подсистемы
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаАдминистрированиеУправлениеОбменамиДанных");
	
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_ПользовательСинхронизацииДанных(ОписанияПрофилей, ПараметрыОбновления)
	
	// Профиль "Пользователь обмена".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ПользовательСинхронизацииДанных";
	ОписаниеПрофиля.Идентификатор = "6b0e2d0e-0fe8-11e3-94f9-5404a6a6831f";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Пользователь синхронизации данных'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Пользователь обменов данными'");
	
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменовДаннымиССайтом");
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеСинхронизацииДанных");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ОбновлениеКонфигурацииБазыДанных");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрЖурналаРегистрации");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнформацииОВерсияхОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУзловПлановОбмена");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ОписатьПрофиль_ОтветственныйЗаОбменДаннымиСПодключаемымОборудованием(ОписанияПрофилей, ПараметрыОбновления)
	
	// Профиль "Пользователь обмена с подключаемым оборудованием".
	ОписаниеПрофиля = УправлениеДоступом.НовоеОписаниеПрофиляГруппДоступа();
	ОписаниеПрофиля.Имя           = "ОтветственныйЗаОбменДаннымиСПодключаемымОборудованием";
	ОписаниеПрофиля.Идентификатор = "520adc77-53cc-483c-846a-60953670d183";
	ОписаниеПрофиля.Наименование  = НСтр("ru = 'Ответственный за обмен данными с подключаемым оборудованием'");
	ОписаниеПрофиля.Описание      = НСтр("ru = 'Ответственный за обмен данными с подключаемым оборудованием'");
		
	ОписаниеПрофиля.Роли.Добавить("ВыполнениеОбменаДанныхСПодключаемымОборудованием");
	ОписанияПрофилей.Добавить(ОписаниеПрофиля);
	
КонецПроцедуры

Процедура ДополнитьПрофильОбязательнымиРолями(ОписаниеПрофиля)

	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваБСП");
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваРТ");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТонкогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускТолстогоКлиента");
	ОписаниеПрофиля.Роли.Добавить("ЗапускВебКлиента");
	// Заметки
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаметок");
	// Напоминание
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеНапоминаний");
	// Задачи и задания.
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЗаданий");
	ОписаниеПрофиля.Роли.Добавить("ИзменениеВыполнениеЗадач");
	ОписаниеПрофиля.ВидыДоступа.Добавить("Пользователи","ВначалеВсеРазрешены");
	// Печать
	ОписаниеПрофиля.Роли.Добавить("ВыводНаПринтерФайлБуферОбмена");
	ОписаниеПрофиля.Роли.Добавить("РедактированиеПечатныхФорм");
	// Файлы и папки файлов
	// Подсистема органайзер в целом.
	ОписаниеПрофиля.Роли.Добавить("ПодсистемаОрганайзер");
	// Дополнительные сведения.
	ОписаниеПрофиля.Роли.Добавить("ИзменениеДополнительныхСведений");
	// Редактирование реквизитов объектов.
	ОписаниеПрофиля.Роли.Добавить("РедактированиеРеквизитовОбъектов");
	//Серии
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеСерий");
	//Вариантов отчетов
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЛичныхВариантовОтчетов");
	// Использование дополнительных отчетов и обработок.
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеГлобальныхДополнительныхОтчетовИОбработок");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеДополнительныхОтчетовИОбработок");
	// Работа с почтовыми сообщениями
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеУчетныхЗаписейЭлектроннойПочты");
	
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеПапокИФайлов");
	
	ОписаниеПрофиля.Роли.Добавить("СохранениеДанныхПользователя");
	ОписаниеПрофиля.Роли.Добавить("ПросмотрСвязанныеДокументы");
	ОписаниеПрофиля.Роли.Добавить("ДобавлениеИзменениеЭлектронныхПодписейИШифрование");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВерсийОбъектов");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеУзловПлановОбмена");
	
	// БИП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваИПП");
	
	// БЭД
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЭД");
	
	// ЕГАИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораАлкогольнойПродукцииЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеКлассификатораОрганизацийЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСправокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеАкцизныхМарокЕГАИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковАлкогольнойПродукции");
	
	// МОТП
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваМОТП");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеШтрихкодовУпаковокТоваров");
	
	// ВЕТИС
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ИспользованиеОбработкиПанельОбменВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВетеринарноСопроводительныхДокументовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеВходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаболеванийУсловийРегионализацииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗаписейСкладскогоЖурналаВРезервеВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеЗапросовСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИнвентаризацийПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеИсходящихТранспортныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеНазначенийГрузовВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОбъединенийЗаписейСкладскогоЖурналаВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеОстатковПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПродукцииВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеПроизводственныхОперацийВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеСоответствияНоменклатурыВЕТИС");
	ОписаниеПрофиля.Роли.Добавить("ЧтениеХозяйствующихСубъектовВЕТИС");
	
	ОписаниеПрофиля.Роли.Добавить("ПодсистемыВЕТИС");
	
	// ГИСМ
	ОписаниеПрофиля.Роли.Добавить("БазовыеПраваГИСМ");
	
КонецПроцедуры

#КонецОбласти
