
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СообщениеОбОшибке=Параметры.ошибка;
КонецПроцедуры

&НаКлиенте
Процедура Ок(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьОшибки(Команда)
	ОчиститьОшибкиНАСервере()
КонецПроцедуры

Процедура ОчиститьОшибкиНАСервере()
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("КлючФоновогоЗадания","ОшибкиПрогрузкиВесов");
	Запрос.Текст="ВЫБРАТЬ
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Период КАК Период,
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.КлючФоновогоЗадания КАК КлючФоновогоЗадания,
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Измерение1 КАК Измерение1,
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Измерение2 КАК Измерение2,
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Измерение3 КАК Измерение3,
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Сообщение КАК Сообщение,
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Обработан КАК Обработан
	             |ИЗ
	             |	РегистрСведений.ххх_СообщенияПользователюРегламентныеЗадания.СрезПоследних(, КлючФоновогоЗадания = &КлючФоновогоЗадания) КАК ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних
	             |ГДЕ
	             |	ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.Обработан = ЛОЖЬ
	             |	И ххх_СообщенияПользователюРегламентныеЗаданияСрезПоследних.КлючФоновогоЗадания = &КлючФоновогоЗадания";
	выборка=Запрос.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл		
		стр=РегистрыСведений.ххх_СообщенияПользователюРегламентныеЗадания.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(стр,выборка);
		стр.Обработан=Истина;
		стр.Записать();		
	КонецЦикла;
КонецПроцедуры