
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЭтаФорма.Параметры.Свойство("номка")тогда
		ЭтаФорма.Параметры.РежимВыбора=истина;
		ЭтаФорма.Параметры.ЗакрыватьПриВыборе=Истина;
		ЭтаФорма.Таблица.Параметры.УстановитьЗначениеПараметра("Ном", Параметры.Номка);	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	//ВыбраннаяСтрока=ЭтаФОрма.ТекущийЭлемент.ТекущиеДанные.Номенклатура;	
	ОповеститьОВыборе(ЭтаФОрма.ТекущийЭлемент.ТекущиеДанные.Цена);
КонецПроцедуры
