
&НаСервере
&После("ДоступностьЭлементовФормы")
Процедура КочетовДоступностьЭлементовФормы()
	толькоПросмотр=Ложь;
	Элементы.ОстаткиПоДаннымЕГАИС.толькоПросмотр=Ложь;
	
КонецПроцедуры


&НаСервере
Процедура КочетовПередЗаписьюНаСервереПеред(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если не Объект.СтатусОбработки = Перечисления.СтатусыОбработкиОстатковЕГАИС.Новый и не РольДоступна("ПолныеПрава")Тогда
		отказ=истина;
		сообщить("Нельзя перепроводить!");
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура КочетовПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Запрос=Новый Запрос;
	тз=Объект.ОстаткиПоДаннымЕГАИС.Выгрузить();
	Запрос.УстановитьПараметр("справкиБ",тз.ВыгрузитьКолонку("СправкаБ"));
	Запрос.Текст="ВЫБРАТЬ
	             |	СправкиАЕГАИС.ДатаРозлива КАК ДатаРозлива,
	             |	СправкиБЕГАИС.Ссылка КАК СправкаБ
	             |ИЗ
	             |	Справочник.СправкиБЕГАИС КАК СправкиБЕГАИС
	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СправкиАЕГАИС КАК СправкиАЕГАИС
	             |		ПО СправкиБЕГАИС.НомерСправкиА = СправкиАЕГАИС.РегистрационныйНомер
	             |ГДЕ
	             |	СправкиБЕГАИС.Ссылка В(&справкиБ)
	             |
	             |СГРУППИРОВАТЬ ПО
	             |	СправкиАЕГАИС.ДатаРозлива,
	             |	СправкиБЕГАИС.Ссылка";
	выборка=Запрос.Выполнить().Выбрать();
	тз=Объект.ОстаткиПоДаннымЕГАИС.Выгрузить();
	пока выборка.Следующий() Цикл
		стр=тз.Найти(выборка.СправкаБ,"СправкаБ");
		стр.ДатаРозлива=выборка.ДатаРозлива;
	КонецЦикла;
	Объект.ОстаткиПоДаннымЕГАИС.Загрузить(тз);
	
КонецПроцедуры

