
&Вместо("ПодготовкаДанныхДляПередачиДанныеВЕГАИС")
Функция КочетовПодготовкаДанныхДляПередачиДанныеВЕГАИС(ДокументОбъект, ДанныеЕГАИСДостаточны, ОсобыйВыводСообщения, ТекстПолногоСообщения)
	ПродажаСПроверкойЕГАИС = ПродажаСПроверкойЕГАИС(ДокументОбъект.Организация, ДокументОбъект.Магазин, ДокументОбъект.Дата);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Товары.НомерСтроки,
	|	ВЫРАЗИТЬ(Товары.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Количество,
	|	Товары.Цена,
	|	Товары.Сумма,
	|	Товары.СтавкаНДС,
	|	Товары.СуммаНДС,
	|	Товары.Упаковка,
	|	Товары.КоличествоУпаковок,
	|	Товары.КлючСвязи,
	|	Товары.СуммаАвтоматическойСкидки,
	|	Товары.СуммаРучнойСкидки,
	|	Товары.Штрихкод
	|ПОМЕСТИТЬ ТаблицаТоварыЧека
	|ИЗ
	|	&Товары КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Товары.НомерСтроки,
	|	Товары.Номенклатура,
	|	Товары.Характеристика,
	|	Товары.Количество,
	|	Товары.Цена,
	|	Товары.Сумма,
	|	Товары.СтавкаНДС,
	|	Товары.СуммаНДС,
	|	Товары.Упаковка,
	|	Товары.КоличествоУпаковок,
	|	Товары.КлючСвязи,
	|	Товары.СуммаАвтоматическойСкидки,
	|	Товары.СуммаРучнойСкидки,
	|	Товары.Штрихкод,
	|	ЕСТЬNULL(Товары.Номенклатура.ОбъемДАЛ, 0) КАК ОбъемДАЛ,
	|	ЕСТЬNULL(Товары.Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ) КАК Маркируемый,
	|	ЕСТЬNULL(Товары.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ) КАК ПродаетсяВРозлив,
	|	ЕСТЬNULL(Товары.Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Код, """") КАК КодВидаПродукции,
	|	ЕСТЬNULL(Товары.Номенклатура.АлкогольнаяПродукция, ЛОЖЬ) КАК АлкогольнаяПродукция,
	|	ЕСТЬNULL(Товары.Номенклатура.Крепость, 0) КАК Крепость
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	ТаблицаТоварыЧека КАК Товары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АкцизныеМарки.НомерСтроки,
	|	АкцизныеМарки.КлючСвязи,
	|	АкцизныеМарки.КодАкцизнойМарки
	|ПОМЕСТИТЬ ТаблицаАкцизныхМарок
	|ИЗ
	|	&АкцизныеМарки КАК АкцизныеМарки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.Цена,
	|	ТаблицаТовары.Сумма,
	|	ТаблицаТовары.СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС,
	|	ТаблицаТовары.Упаковка,
	|	ТаблицаТовары.КоличествоУпаковок,
	|	ТаблицаТовары.КлючСвязи,
	|	ТаблицаТовары.Номенклатура.ТабачнаяПродукция КАК ТабачнаяПродукция,
	|	ТаблицаТовары.СуммаАвтоматическойСкидки,
	|	ТаблицаТовары.СуммаРучнойСкидки,
	|	ТаблицаТовары.Штрихкод,
	|	ВЫБОР
	|		КОГДА &ПродажаСПроверкойЕГАИС
	|			ТОГДА ВЫБОР
	|					КОГДА ТаблицаТовары.Маркируемый
	|							И НЕ ТаблицаАкцизныхМарок.КодАкцизнойМарки ЕСТЬ NULL 
	|						ТОГДА ТаблицаАкцизныхМарок.КодАкцизнойМарки
	|					ИНАЧЕ """"
	|				КОНЕЦ
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КодАкцизнойМарки,
	|	ВЫБОР
	|		КОГДА &ПродажаСПроверкойЕГАИС
	|			ТОГДА ТаблицаТовары.Маркируемый
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Маркируемый,
	|	ВЫБОР
	|		КОГДА &ПродажаСПроверкойЕГАИС
	|			ТОГДА ТаблицаТовары.КодВидаПродукции
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК КодВидаПродукции,
	|	ВЫБОР
	|		КОГДА &ПродажаСПроверкойЕГАИС
	|				И ТаблицаТовары.АлкогольнаяПродукция
	|			ТОГДА ТаблицаТовары.ОбъемДАЛ
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ОбъемДАЛ,
	|	ВЫБОР
	|		КОГДА &ПродажаСПроверкойЕГАИС
	|				И ТаблицаТовары.АлкогольнаяПродукция
	|			ТОГДА ТаблицаТовары.Крепость
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Крепость,
	|	ВЫБОР
	|		КОГДА &ПродажаСПроверкойЕГАИС
	|			ТОГДА ТаблицаТовары.АлкогольнаяПродукция
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК АлкогольнаяПродукция
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаАкцизныхМарок КАК ТаблицаАкцизныхМарок
	|		ПО ТаблицаТовары.КлючСвязи = ТаблицаАкцизныхМарок.КлючСвязи
	|ГДЕ
	|	&ПродажаСПроверкойЕГАИС
	|	И ТаблицаТовары.АлкогольнаяПродукция
	|	И ТаблицаТовары.Маркируемый
	|	И НЕ ТаблицаТовары.ПродаетсяВРозлив
	|;
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.КоличествоУпаковок,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаАкцизныхМарок.КодАкцизнойМарки) КАК КоличествоАкцизныхМарок
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаАкцизныхМарок КАК ТаблицаАкцизныхМарок
	|		ПО ТаблицаТовары.КлючСвязи = ТаблицаАкцизныхМарок.КлючСвязи
	|ГДЕ
	|	&ПродажаСПроверкойЕГАИС
	|	И ТаблицаТовары.АлкогольнаяПродукция
	|	И ТаблицаТовары.Маркируемый
	|	И НЕ ТаблицаТовары.ПродаетсяВРозлив
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.НомерСтроки,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.КоличествоУпаковок
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаАкцизныхМарок.КодАкцизнойМарки) <> ТаблицаТовары.Количество
	|	И КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТаблицаАкцизныхМарок.КодАкцизнойМарки) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.НомерСтроки,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Количество,
	|	ТаблицаТовары.Цена,
	|	ТаблицаТовары.Сумма,
	|	ТаблицаТовары.СтавкаНДС,
	|	ТаблицаТовары.СуммаНДС,
	|	ТаблицаТовары.Упаковка,
	|	ТаблицаТовары.КоличествоУпаковок,
	|	ТаблицаТовары.КлючСвязи,
	|	ТаблицаТовары.СуммаАвтоматическойСкидки,
	|	ТаблицаТовары.СуммаРучнойСкидки,
	|	ТаблицаТовары.Штрихкод,
	|	ТаблицаТовары.ОбъемДАЛ КАК ОбъемДАЛ,
	|	ТаблицаТовары.Маркируемый КАК Маркируемый,
	|	ТаблицаТовары.КодВидаПродукции КАК КодВидаПродукции,
	|	ТаблицаТовары.Номенклатура.ТабачнаяПродукция КАК ТабачнаяПродукция,
	|	ТаблицаТовары.АлкогольнаяПродукция И НЕ ТаблицаТовары.ПродаетсяВРозлив КАК АлкогольнаяПродукция,
	|	ТаблицаТовары.Крепость КАК Крепость,
	|	ТаблицаТовары.ПродаетсяВРозлив КАК ПродаетсяВРозлив,
	|	"""" КАК КодАкцизнойМарки
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|";
	
	Запрос.УстановитьПараметр("Товары", ДокументОбъект.Товары.Выгрузить());
	Запрос.УстановитьПараметр("АкцизныеМарки", ДокументОбъект.АкцизныеМарки.Выгрузить());
	Запрос.УстановитьПараметр("ПродажаСПроверкойЕГАИС", ПродажаСПроверкойЕГАИС);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаТоваровЕГАИС = Результат[3].Выгрузить();
	ТаблицаНедостающихМарокЕГАИС = Результат[4].Выгрузить();
	ТаблицаТоваровЧека = Результат[5].Выгрузить();
	
	Если ПродажаСПроверкойЕГАИС Тогда
		ИнтеграцияЕГАИСРТ.ПроверитьДанныеЕГАИС(ТаблицаТоваровЕГАИС, ТаблицаНедостающихМарокЕГАИС, ДанныеЕГАИСДостаточны, ДокументОбъект, ОсобыйВыводСообщения, ТекстПолногоСообщения);
	Иначе
		ДанныеЕГАИСДостаточны = Истина;
	КонецЕсли;
	
	СтруктураТаблиц = Новый Структура;
	СтруктураТаблиц.Вставить("ТаблицаТоваровЧека", ТаблицаТоваровЧека);
	СтруктураТаблиц.Вставить("ТаблицаТоваровЕГАИС", ТаблицаТоваровЕГАИС);
	
	Возврат СтруктураТаблиц;
	

КонецФункции
