#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьИдентификаторСтроки(Строка) Экспорт

	Строка.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);

КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает представление номенклатуры контрагента.
//
// Параметры:
//  НоменклатураКонтрагента - Структура - номенклатура контрагента. См. ОбменСКонтрагентамиКлиентСервер.НоваяНоменклатураКонтрагента
//
// Возвращаемое значение:
//  Строка - представление номенклатуры контрагента.
//
Функция ПредставлениеНоменклатурыКонтрагента(НоменклатураКонтрагента) Экспорт
	
	Представление = НоменклатураКонтрагента.Наименование;
	Если ЗначениеЗаполнено(НоменклатураКонтрагента.Характеристика) Тогда
		Представление = Представление + ", " + НоменклатураКонтрагента.Характеристика;
	КонецЕсли;
	Если ЗначениеЗаполнено(НоменклатураКонтрагента.ЕдиницаИзмерения) Тогда
		Представление = Представление + ", " + НоменклатураКонтрагента.ЕдиницаИзмерения;
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

#КонецОбласти