
//&Вместо("ОбработкаПолученияПредставления")
//Процедура КочетовОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
//	//// Вставить содержимое обработчика.
//	//ПродолжитьВызов(Данные, Представление, СтандартнаяОбработка);
//	
//	
//	
//	
//	Если не Данные.ссылка.ЭтоГруппа Тогда
//		Если текущаяДата()>Данные.ссылка.ххх_ПериодДействияАкцииНачало  и текущаяДата()<Данные.ссылка.ххх_ПериодДействияАкцииКонец Тогда
//			СтандартнаяОбработка=ложь;
//			Представление="Акция!"+День(Данные.ссылка.ххх_ПериодДействияАкцииНачало)+"-"+День(Данные.ссылка.ххх_ПериодДействияАкцииКонец)+"!"+Данные.Наименование;
//		КонецЕсли;
//	КонецЕсли;
//КонецПроцедуры
