
&После("ПриЗаписи")
Процедура КочетовПриЗаписи(Отказ)
	
	
	Если не Отказ тогда  //При записи группы она тоже регается на изменения, дальше вся её иерархия улетит на весы и кассы;
		Выборка = ПланыОбмена.ПланОбменаСОборудованием.Выбрать();
		Пока Выборка.Следующий() Цикл 
			Если Выборка.Ссылка = ПланыОбмена.ПланОбменаСОборудованием.ЭтотУзел() Тогда
				Продолжить;
			КонецЕсли;
			ПланыОбмена.ЗарегистрироватьИзменения(Выборка.Ссылка, ЭтотОбъект.Ссылка); 
		КонецЦикла;	
	КонецЕсли;
	
	
	Если не Отказ и не ЭтоГруппа тогда
		
		мен=РегистрыСведений.КонтурEDI_ДополнительныеРеквизиты.СоздатьМенеджерЗаписи();
		мен.Объект=ххх_Поставщик.Ссылка;
		мен.Свойство="ПартнерКонтрагента";
		мен.Прочитать();
		
		
		Если мен.Выбран() Тогда
			
			Партнер=мен.Значение;
			
			мен=РегистрыСведений.КонтурEDI_СоответствияТоваров.СоздатьМенеджерЗаписи();
			мен.Единица=ЕдиницаИзмерения;
			мен.Номенклатура=ссылка;
			мен.Партнер=партнер;
				
			мен.Прочитать();
			
			Если не мен.Выбран() Тогда
				
				мен.GTIN=ххх_ИдЦентр;
				мен.Единица=ЕдиницаИзмерения;
				мен.Номенклатура=ссылка;
				мен.Партнер=партнер;
				мен.НаименованиеПартнера=ххх_НаименованиеЦенник;
				мен.ОсновноеСоответствие=Истина;
				мен.Записать(Истина);
				
			КонецЕсли;
			
			
		КонецЕсли;	
		
	КонецЕсли;
	
	
	Если не Отказ и не ЭтоГруппа и ЭтоНовый() тогда

		мен=РегистрыСведений.ххх_ИстиорияЦветаЦенника.СоздатьМенеджерЗаписи();
		мен.Номенклатура=ссылка;
		мен.Период=ТекущаяДата();
		мен.ЦветЦенника="Белый";
		мен.прочитать();
		мен.Записать();
		
	КонецЕсли;	
		
		
КонецПроцедуры












































