
&Вместо("ДанныеПоШтрихкодам")
Функция КочетовДанныеПоШтрихкодам(СписокШтрихкодов, ПараметрыСканирования, КэшированныеЗначения)
	// Вставить содержимое метода.
	//Результат = ПродолжитьВызов(СписокШтрихкодов, ПараметрыСканирования, КэшированныеЗначения);
	//Возврат Результат
	
	ПараметрыСканирования.КонтрольРасхожденийСДокументомОснованием=ложь;
	
	ДанныеПоШтрихкодам = ШтрихкодированиеИС.ДанныеПоШтрихкодам(СписокШтрихкодов, ПараметрыСканирования, КэшированныеЗначения);
	Если ДанныеПоШтрихкодам.ШтрихкодыПродукцииДляСопоставления.Количество() > 0 Тогда
		Возврат ДанныеПоШтрихкодам;
	КонецЕсли;
	
	ШтрихкодированиеИС.ВыполнитьПроверкуНаОшибкиДанныхПоШтрихкодам(ДанныеПоШтрихкодам, ПараметрыСканирования);
	
	Возврат ДанныеПоШтрихкодам;

КонецФункции
