
//Процедура ПриЗаписи(Отказ, Замещение)
//	// Вставить содержимое обработчика.
//	//Если Замещение=Ложь Тогда
//	//	Запрос=Новый запрос;
//	//	Запрос.УстановитьПараметр("Наб",ЭтотОбъект.Выгрузить());
//	//	Запрос.Текст="ВЫБРАТЬ
//	//	             |	Наб.номенклатура,
//	//	             |	Наб.Оборудование,
//	//	             |	Наб.код
//	//	             |ПОМЕСТИТЬ наб
//	//	             |ИЗ
//	//	             |	&Наб КАК Наб
//	//	             |;
//	//	             |
//	//	             |////////////////////////////////////////////////////////////////////////////////
//	//	             |ВЫБРАТЬ
//	//	             |	наб.номенклатура,
//	//	             |	наб.Оборудование,
//	//	             |	наб.код
//	//	             |ИЗ
//	//	             |	РегистрСведений.ххх_КодыНоменклатурыВесыКассы КАК ххх_КодыНоменклатурыВесыКассы
//	//	             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ наб КАК наб
//	//	             |		ПО ххх_КодыНоменклатурыВесыКассы.Оборудование = наб.Оборудование
//	//	             |			И ххх_КодыНоменклатурыВесыКассы.Код = наб.код
//	//	             |			И ххх_КодыНоменклатурыВесыКассы.Номенклатура <> наб.номенклатура";
//	//	Выборка=запрос.Выполнить().Выбрать();
//	//	Если выборка.Количество()<>0 Тогда
//	//		СОобщить("На данный код уже зарегистрирована другая номенклатура");
//	//		Отказ=истина;
//	//	КонецЕсли;
//	//КонецЕсли;
//	
//	Запрос=Новый запрос;
//	Запрос.УстановитьПараметр("Номка",ЭтотОбъект.Выгрузить());
//	Запрос.Текст="ВЫБРАТЬ
//	             |	Номка.Номенклатура КАК Номенклатура,
//	             |	Номка.Оборудование КАК Оборудование,
//	             |	Номка.Код КАК Код
//	             |ПОМЕСТИТЬ номка
//	             |ИЗ
//	             |	&Номка КАК Номка
//	             |;
//	             |
//	             |////////////////////////////////////////////////////////////////////////////////
//	             |ВЫБРАТЬ
//	             |	номка.Номенклатура КАК Номенклатура,
//	             |	ЕСТЬNULL(ххх_КодыНоменклатурыВесыКассыТекущееСостояние.Оборудование, номка.Оборудование) КАК Оборудование,
//	             |	ЕСТЬNULL(ххх_КодыНоменклатурыВесыКассыТекущееСостояние.Код, номка.Код) КАК Код
//	             |ИЗ
//	             |	номка КАК номка
//	             |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ххх_КодыНоменклатурыВесыКассыТекущееСостояние КАК ххх_КодыНоменклатурыВесыКассыТекущееСостояние
//	             |		ПО номка.Номенклатура = ххх_КодыНоменклатурыВесыКассыТекущееСостояние.Номенклатура
//	             |
//	             |СГРУППИРОВАТЬ ПО
//	             |	номка.Номенклатура,
//	             |	ЕСТЬNULL(ххх_КодыНоменклатурыВесыКассыТекущееСостояние.Оборудование, номка.Оборудование),
//	             |	ЕСТЬNULL(ххх_КодыНоменклатурыВесыКассыТекущееСостояние.Код, номка.Код)
//	             |ИТОГИ ПО
//	             |	Номенклатура";
//	Выборка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
//	
//	СостояниеНаВесах=справочники.ххх_Справочник.СостояниеНаВесах.Значение;
//	
//	Пока выборка.Следующий() Цикл		
//		стр=РегистрыСведений.ДополнительныеСведения.СоздатьМенеджерЗаписи();
//		стр.Объект=выборка.номенклатура;
//		стр.Свойство=СостояниеНаВесах;	
//		Элы=Выборка.Выбрать();
//		Пока элы.Следующий() Цикл			
//			стр.Значение=Строка(стр.Значение)+"("+элы.оборудование.Код+")*"+Строка(элы.Код)+"|";			
//		КонецЦикла;
//		УстановитьПривилегированныйРежим(Истина);
//		стр.Записать(истина);	
//		УстановитьПривилегированныйРежим(Ложь);
//	КонецЦикла;	
//КонецПроцедуры

























