
&НаСервере
Процедура КочетовПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если параметры.свойство("ИНН") Тогда
		
		
		НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КонтрагентИНН"); 
		НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

		НовЭлементОтбора.Использование = Истина;

		НовЭлементОтбора.ПравоеЗначение = параметры.ИНН;
		
		ИНН=параметры.ИНН;
		
		//НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НомерВходящегоДокумента"); 
		//НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

		//НовЭлементОтбора.Использование = Истина;

		//НовЭлементОтбора.ПравоеЗначение = параметры.НомерВходящегоДокумента;

		//
		НомерВходящегоДокумента=параметры.НомерВходящегоДокумента;
		//
		эЛЕМЕНТЫ.НомерВходящегоДокумента.Видимость=Истина;
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"НомерВходящегоДокумента",параметры.НомерВходящегоДокумента,ВидСравненияКомпоновкиДанных.Равно,,истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ)
		
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КочетовНомерВходящегоДокументаПриИзмененииПосле(Элемент)
	
	Если ЗначениеЗаполнено(НомерВходящегоДокумента)	 Тогда
		//НовЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		//НовЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("НомерВходящегоДокумента"); 
		//НовЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;

		//НовЭлементОтбора.Использование = Истина;

		//Список.Отбор.Элементы.Очистить();
		//Список.КомпоновщикНастроек.ПолучитьНастройки()Список.КомпоновщикНастроек.ФиксированныеНастройки;
		
		//Список.КомпоновщикНастроек.Восстановить();
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "НомерВходящегоДокумента"); 
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"НомерВходящегоДокумента",НомерВходящегоДокумента,ВидСравненияКомпоновкиДанных.Равно,,истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ);
		
		//ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,"КонтрагентИНН",ИНН,ВидСравненияКомпоновкиДанных.Равно,,истина,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ,"КонтрагентИНН");
		
		//Список.Отбор.Элементы.НомерВходящегоДокумента=НомерВходящегоДокумента;
		//НовЭлементОтбора.ПравоеЗначение = НомерВходящегоДокумента;
	Иначе
		//Список.Отбор.Элементы.Очистить();
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список,"НомерВходящегоДокумента");
	КонецеСли;

КонецПроцедуры












