#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТаблицаДенежныхСредств.Касса КАК Касса,
	|	ТаблицаДенежныхСредств.Касса.Владелец КАК Организация,
	|	ТаблицаДенежныхСредств.Касса.Магазин КАК Магазин,
	|	ТаблицаДенежныхСредств.ДоговорПлатежногоАгента КАК ДоговорПлатежногоАгента,
	|	ТаблицаДенежныхСредств.Сумма КАК Сумма,
	|	ТаблицаДенежныхСредств.Дата КАК Период
	|ИЗ
	|	Документ.ВводОстатковДенежныхСредств КАК ТаблицаДенежныхСредств
	|ГДЕ
	|	ТаблицаДенежныхСредств.Ссылка = &Ссылка
	|	И (НЕ ТаблицаДенежныхСредств.Касса.КассаУправляющейСистемы)");
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДенежныеСредстваНаличные", Результат[0].Выгрузить());
	
КонецПроцедуры

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
	
КонецПроцедуры

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"ПрисоединитьДополнительныеТаблицы
	|ЭтотСписок КАК ЭтотСписок
	|
	|ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Магазины КАК Магазины 
	|	ПО Магазины.Ссылка = ЭтотСписок.Касса.Магазин
	|;
	|РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Касса.Магазин)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецЕсли

