
&НаСервере
Процедура КочетовРасполовинитьДокументВместоНаСервере(ссылка)
	СтарДок=ссылка.ПолучитьОбъект();
	ТОВАРЫ=СтарДок.товары.выгрузить();
	
	Пачка1=Окр(СтарДок.товары.Количество()/2-1);
	Пачка2=СтарДок.товары.Количество()-пачка1+1;
	
	док=Документы.АктСписанияЕГАИС.СоздатьДокумент();
	й=0;
	Пока й<>Пачка1 Цикл
		стр=док.Товары.Добавить(); 
		ЗаполнитьЗначенияСвойств(стр,товары[й]);
		й=й+1;
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Док,СтарДок);
	Док.номер="";
	Док.Проведен=Ложь;
	Док.Дата=ТекущаяДата();
	Док.Записать();
	
	
	Пачка1=Окр(СтарДок.товары.Количество()/2-1);
	Пачка2=СтарДок.товары.Количество()-пачка1-1;
	
	док=Документы.АктСписанияЕГАИС.СоздатьДокумент();
	й=Пачка2;
	Пока й<>Товары.количество() Цикл
		стр=док.Товары.Добавить(); 
		ЗаполнитьЗначенияСвойств(стр,товары[й]);
		й=й+1;
	КонецЦикла;
	ЗаполнитьЗначенияСвойств(Док,СтарДок);
	Док.номер="";
	Док.Проведен=Ложь;
	Док.Дата=ТекущаяДата();
	Док.Записать();

	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КочетовРасполовинитьДокументВместо()
	КочетовРасполовинитьДокументВместоНаСервере(Элементы.Список.ТекущиеДанные.ссылка);
КонецПроцедуры
