
&После("ПриЗаписи")
Процедура КочетовПриЗаписи(Отказ)
	Если не отказ Тогда		
		справки2=товары.ВыгрузитьКолонку("Справка2");		
		Для каждого справка из справки2 Цикл
			//справка1=Справочники.Справки1ЕГАИС.НайтиПоРеквизиту("РегистрационныйНомер",справка.РегистрационныйНомер);
			Если Не ЗначениеЗаполнено(справка.Справка1) Тогда
				ИнтеграцияЕГАИСВызовСервера.ПодготовитьЗапросДанныхСправкиКПередачеКочетов(Грузополучатель, 
					перечисления.ВидыДокументовЕГАИС.ЗапросСправки1, справка.НомерСправки1);
			КонецЕсли;		
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры


&Вместо("ОбработкаПроведения")
Процедура КочетовОбработкаПроведения(Отказ, РежимПроведения)
	
	мен=РегистрыСведений.СтатусыДокументовЕГАИС.СоздатьМенеджерЗаписи();
	мен.Документ=ссылка;
	мен.Прочитать();
	Если мен.Статус=Перечисления.СтатусыОбработкиТТНВходящейЕГАИС.Подтвержден или мен.Статус=Перечисления.СтатусыОбработкиТТНВходящейЕГАИС.ПодтвержденСРасхождениями Тогда
		
		
		ххх_Сервер.ОтразитьДвиженияАкцизныхМарок(Движения,Ссылка,ВидДвиженияНакопления.Приход);
		
		
	КонецЕсли;
	
	
	Если мен.Статус<>перечисления.СтатусыОбработкиТТНИсходящейЕГАИС.Черновик и не ЗначениеЗаполнено(ДокументОснование) Тогда
		
		
		
	КонецЕсли;	
	
КонецПроцедуры
