
&НаКлиенте
Процедура КочетовТипШтрихкодаНачалоВыбораПеред(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура КочетовПередЗаписьюПеред(Отказ, ПараметрыЗаписи)
	Отказ=ПроверитьЗаполнениеТипаШтрихКода(Отказ);	
	Отказ=ПроверитьРазрешениенаЗапись(Отказ);	
КонецПроцедуры


Функция ПроверитьРазрешениенаЗапись(Отказ)
	Запрос=Новый запрос;
	запрос.УстановитьПараметр("номка",запись.Владелец);
	наб=РегистрыСведений.ххх_НоменклатураЗапрещеноЗаводитьШтрихкода.СоздатьНаборЗаписей();
	наб.Прочитать();
	запрос.УстановитьПараметр("ИсключенныеПапки",наб.ВыгрузитьКолонку("номенклатура"));
	Запрос.Текст="ВЫБРАТЬ
	             |	Номенклатура.Ссылка КАК Ссылка
	             |ПОМЕСТИТЬ йцу
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.Ссылка = &номка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	йцу.Ссылка КАК Ссылка
	             |ИЗ
	             |	йцу КАК йцу
	             |ГДЕ
	             |	йцу.Ссылка В ИЕРАРХИИ(&ИсключенныеПапки)";
	выборка=Запрос.Выполнить().Выбрать();
	Если выборка.Следующий() Тогда
		сообщить("Да данную карточку запрещенно заводить штрихкоды!");
		возврат истина;
	Иначе
		возврат отказ;
	КонецЕсли;
КонецФункции


Функция ПолучитьМассивТиповШтрихКодов ()
	Массив= Новый Массив;
	Массив.Добавить(ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8);
	Массив.Добавить(ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13);
	Массив.Добавить(Справочники.ххх_Справочник.НашШтрихкод.Значение);
 	возврат массив
КонецФункции

Функция	ПроверитьЗаполнениеТипаШтрихКода(Отказ);
	Если Не значениеЗаполнено(Запись.ТипШтрихкода) 
		или не
		(
		Запись.ТипШтрихкода=ПланыВидовХарактеристик.ТипыШтрихкодов.EAN8 
		или Запись.ТипШтрихкода=ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13
		или Запись.ТипШтрихкода=Справочники.ххх_Справочник.НашШтрихкод.Значение 
		)
		Тогда
			Отказ=Истина;
			Сообщить("Не заполнен тип штрихкода.");
		КонецЕсли;
	возврат отказ;
КонецФункции

&НаКлиенте
Процедура КочетовПриОткрытииПосле(Отказ)
	// Вставить содержимое обработчика.
	Элементы.ТипШтрихкода.СписокВыбора.ЗагрузитьЗначения(ПолучитьМассивТиповШтрихКодов());
	Элементы.ТипШтрихкода.СписокВыбора.НайтиПоЗначению(запись.ТипШтрихкода);
КонецПроцедуры

&НаКлиенте
Процедура КочетовВладелецНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=ложь;
	струк=новый структура;
	струк.Вставить("РазрешеныЗакупки",истина);
	параметры1=Новый Структура;
	параметры1.Вставить("Отбор",струк);
	
	ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаВыбора",параметры1,элемент,истина,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	// Вставить содержимое обработчика.
КонецПроцедуры
