
&Вместо("ПриНачалеРаботыСистемы")
Процедура КочетовПриНачалеРаботыСистемы(Параметры)
	
КонецПроцедуры

//// См. ОбщегоНазначенияКлиентПереопределяемый.ПриНачалеРаботыСистемы.
//Процедура ПриНачалеРаботыСистемы(Параметры) Экспорт
//	
//	ПараметрыРаботыКлиентаПриЗапуске = СтандартныеПодсистемыКлиент.ПараметрыРаботыКлиентаПриЗапуске();
//	Если ПараметрыРаботыКлиентаПриЗапуске.ПоказатьФормуБлокировкиРаботыСВнешнимиРесурсами Тогда
//		Параметры.ИнтерактивнаяОбработка = Новый ОписаниеОповещения("ПоказатьФормуБлокировкиРаботыСВнешнимиРесурсами", ЭтотОбъект);
//	КонецЕсли;
//	
//КонецПроцедуры

