&НаКлиенте
Процедура КочетовПриОткрытииПосле(Отказ)
	Элементы.Товарыххх_АлкогольнаяПродукцияДляПереносаС1РНА2Р.видимость=УСтановитьВидимостьДляПереносаС1РНа2Р();
КонецПроцедуры


Функция УСтановитьВидимостьДляПереносаС1РНа2Р()
	тч=Объект.Товары.Выгрузить();
	тч.Свернуть("ххх_АлкогольнаяПродукцияДляПереносаС1РНА2Р");
	Если тч.Количество()>0 и ЗначениеЗаполнено(тч[0].ххх_АлкогольнаяПродукцияДляПереносаС1РНА2Р) тогда
		возврат истина
	КонецЕсли;
	Возврат ложь;
КонецФункции


&ВМесто("ПричинаПостановкиНаБалансПриИзмененииСервер")
&НаСервере
Процедура ВместоПричинаПостановкиНаБалансПриИзмененииСерверКочетов()
	//
	//Если Объект.ПричинаПостановкиНаБаланс = Перечисления.ПричиныПостановкиНаБалансЕГАИС.Пересортица Тогда
	//	Элементы.АктСписанияЕГАИС.Доступность = Истина;
	//	Элементы.АктСписанияЕГАИС.АвтоОтметкаНезаполненного = Истина;
	//	Элементы.АктСписанияЕГАИС.ОтметкаНезаполненного = Истина;
	//Иначе
	//	Элементы.АктСписанияЕГАИС.Доступность = Ложь;
	//	Элементы.АктСписанияЕГАИС.АвтоОтметкаНезаполненного = Ложь;
	//	Элементы.АктСписанияЕГАИС.ОтметкаНезаполненного = Ложь;
	//КонецЕсли;
	//
КонецПроцедуры

&НаКлиенте
Процедура КочетовПередатьДанныеВЕГАИСПеред(Команда)
	СообщениеОбОшибке=КочетовПередатьДанныеВЕГАИСПередНаСервере();
	Если ЗначениеЗаполнено(СообщениеОбОшибке)Тогда
		сообщить(СообщениеОбОшибке);
		возврат
	КонецЕСли;
КонецПроцедуры

&НаСервере
Функция КочетовПередатьДанныеВЕГАИСПередНаСервере()
	СообщениеОбОшибке="";
	СообщениеОбОшибкеСтрока="";
	Для каждого стр из Объект.Товары цикл		
		
		СообщениеОбОшибкеСтрока=?(ЗначениеЗаполнено(стр.АлкогольнаяПродукция.Объем),СообщениеОбОшибкеСтрока+"",СообщениеОбОшибкеСтрока+
		" не заполнено значение:"+"Объем"+Символы.ВК);
		
		СообщениеОбОшибкеСтрока=?(ЗначениеЗаполнено(стр.АлкогольнаяПродукция.Крепость),СообщениеОбОшибкеСтрока+"",СообщениеОбОшибкеСтрока+
		" не заполнено значение:"+"Крепость"+Символы.ВК);
		
		СообщениеОбОшибкеСтрока=?(ЗначениеЗаполнено(стр.АлкогольнаяПродукция.ВидПродукции),СообщениеОбОшибкеСтрока+"",СообщениеОбОшибкеСтрока+
		" не заполнено значение:"+"ВидПродукции"+Символы.ВК);
		
		СообщениеОбОшибкеСтрока=?(ЗначениеЗаполнено(стр.АлкогольнаяПродукция.Производитель),СообщениеОбОшибкеСтрока+"",СообщениеОбОшибкеСтрока+
		" не заполнено значение:"+"Производитель"+Символы.ВК);
		
		СообщениеОбОшибкеСтрока=?(ЗначениеЗаполнено(стр.АлкогольнаяПродукция.ТипПродукции),СообщениеОбОшибкеСтрока+"",СообщениеОбОшибкеСтрока+
		" не заполнено значение:"+"ТипПродукции"+Символы.ВК);
		
		Если ЗначениеЗаполнено(СообщениеОбОшибкеСтрока)Тогда
			СообщениеОбОшибкеСтрока="В строке № "+Строка(стр.номерСтроки)+"для позиции: "+Строка(стр.АлкогольнаяПродукция.Код)+Символы.ВК+СообщениеОбОшибкеСтрока;
			СообщениеОбОшибке=СообщениеОбОшибке+СообщениеОбОшибкеСтрока;
			СообщениеОбОшибкеСтрока="";
		КонецЕсли;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СообщениеОбОшибке) Тогда		
		СообщениеОбОшибке="Для решение возникших проблем обратитесь к менеджеру по алкоголю."+Символы.ВК+СообщениеОбОшибке+Символы.ВК+
		"Данные позиции должны быть в допусках, что бы вы могли получить обновление по ним.";	
	КонецЕсли;
	
	Возврат СообщениеОбОшибке;
КонецФункции


















