
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ЭтаФорма.СписокПартий.Параметры.УстановитьЗначениеПараметра("Организация",Параметры.Организация);
	ЭтаФорма.СписокПартий.Параметры.УстановитьЗначениеПараметра("Магазин",Параметры.Магазин);
	ЭтаФорма.СписокПартий.Параметры.УстановитьЗначениеПараметра("Склад",Параметры.Склад);
	ЭтаФорма.СписокПартий.Параметры.УстановитьЗначениеПараметра("Номенклатура",Параметры.Номенклатура);
	ЭтаФорма.СписокПартий.Параметры.УстановитьЗначениеПараметра("Дата",Параметры.Дата);
КонецПроцедуры

&НаКлиенте
Процедура СписокПартийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ОповеститьОВыборе(Элементы.СписокПартий.ТекущиеДанные);
КонецПроцедуры
