
&НаКлиенте
&Вместо("УстановитьДоступностьЭлементовФормы")
Процедура КочетовУстановитьДоступностьЭлементовФормы()
	Если Объект.Сотрудник Тогда
		
		Элементы.ГруппаМагазин.ТекущаяСтраница = Элементы.СтраницаМагазин;
		//Элементы.НастроитьРаботыСотрудника.Видимость = Истина;
		
	Иначе
		
		Элементы.ГруппаМагазин.ТекущаяСтраница = Элементы.СтраницаПустышка;
		//Элементы.НастроитьРаботыСотрудника.Видимость = Ложь;
		
	КонецЕсли;
	
	Элементы.Пол.АвтоОтметкаНезаполненного          = Объект.Сотрудник;
	Элементы.ДатаРождения.АвтоОтметкаНезаполненного = Объект.Сотрудник;
	
	Если Не Объект.Сотрудник Тогда
		Элементы.Пол.ОтметкаНезаполненного          = Объект.Сотрудник;
		Элементы.ДатаРождения.ОтметкаНезаполненного = Объект.Сотрудник;
	КонецЕсли;

КонецПроцедуры

&НаСервере
&Вместо("ПередЗаписьюНаСервере")
Процедура КочетовПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.КонтактнаяИнформация
	УправлениеКонтактнойИнформацией.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.КонтактнаяИнформация
	
	Запрос=Новый запрос;
	Запрос.УстановитьПараметр("ссылка",ТекущийОбъект.ссылка);
	Запрос.УстановитьПараметр("ИНН",ТекущийОбъект.ИНН);
	Запрос.Текст="ВЫБРАТЬ
	             |	ФизическиеЛица.Ссылка КАК Ссылка
	             |ИЗ
	             |	Справочник.ФизическиеЛица КАК ФизическиеЛица
	             |ГДЕ
	             |	ФизическиеЛица.Ссылка <> &Ссылка
	             |	И ФизическиеЛица.ИНН = &ИНН";	
	
	выборка=Запрос.Выполнить().Выбрать();
	если выборка.Следующий() Тогда
		отказ=истина;
		сообщить("Уже существует физ лицо с таким ИНН!");
	КонецЕсли;
	

КонецПроцедуры
