
&НаКлиенте
Процедура КочетовТоварыЗаписьСкладскогоЖурналаНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("РежимВыбора", Истина);
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	ПараметрыФормы.Вставить("Продукция", ТекущиеДанные.Продукция);
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("ХозяйствующийСубъект", Объект.ГрузоотправительХозяйствующийСубъект);
	СтруктураОтбора.Вставить("Предприятие", Объект.ГрузоотправительПредприятие);
	//+++
	СтруктураОтбора.Вставить("Продукция", ТекущиеДанные.Продукция);
	//---	
	ПараметрыФормы.Вставить("Отбор", СтруктураОтбора);
	
	ОткрытьФорму("РегистрСведений.ОстаткиПродукцииВЕТИС.ФормаСписка",
		ПараметрыФормы, Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры
