
&НаСервере
Процедура КочетовПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КочетовПриОткрытииВместо(Отказ)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КочетовКассаККМНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура КочетовКассаККМОбработкаВыбораВместо(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	КочетовКассаККМОбработкаВыбораВместоСервер(ВыбранноеЗначение)
КонецПроцедуры


Процедура КочетовКассаККМОбработкаВыбораВместоСервер(Касса)
	
	Объект.Организация=касса.Владелец;
	
КонецПроцедуры