
&После("ПриЗаписи")
Процедура КочетовПриЗаписи(Отказ)
	если не отказ и Ссылка=Справочники.ххх_Справочник.ШаблонЦенниковПриЗаписиРаскидываетСоюСКДВсем.Значение тогда
		выборка=Справочники.ХранилищеШаблонов.Выбрать();
		пока выборка.Следующий() Цикл
			если Ссылка<>Справочники.ххх_Справочник.ШаблонЦенниковПриЗаписиРаскидываетСоюСКДВсем.Значение тогда
				об=выборка.Ссылка.ПолучитьОбъект();
				об.СхемаКомпоновкиДанных=СхемаКомпоновкиДанных;
				об.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
