
&После("ОбработкаЗаполнения")
Процедура КочетовОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ТТНВходящаяЕГАИС") Тогда
		
		ОрганизацияЕГАИС=ДанныеЗаполнения.Грузополучатель;	
		
		
		ДанныеПроверкиИПодбораТТН=ДанныеЗаполнения.ДанныеПроверкиИПодбора.получить();
		
		Если ДанныеПроверкиИПодбораТТН.ДеревоМаркированнойПродукции.Строки.количество()>0 Тогда
		
			СтрокиДрева=ДанныеПроверкиИПодбораТТН.ДеревоМаркированнойПродукции.Строки[0].Строки;
			
			
			
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры

&После("ОбработкаПроведения")
Процедура КочетовОбработкаПроведения(Отказ, РежимПроведения)
	
	мен=РегистрыСведений.СтатусыДокументовЕГАИС.СоздатьМенеджерЗаписи();
	мен.Документ=ссылка;
	мен.Прочитать();
	Если мен.Статус=Перечисления.СтатусыОбработкиАктаПостановкиНаБалансЕГАИС.ПроведенЕГАИС или ВидДокумента=Перечисления.ВидыДокументовЕГАИС.ххх_АктФиксацииМарок Тогда
		
		
		ххх_Сервер.ОтразитьДвиженияАкцизныхМарок(Движения,Ссылка,ВидДвиженияНакопления.Приход);
		
		
	КонецЕсли;
КонецПроцедуры
