
&НаСервере
Процедура КочетовПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Производители") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Поставщики",Справочники.ххх_Справочник.КонтрагентыПапкаПроизводители.значение);
	ИначеЕсли Параметры.Свойство("ИнтернетПокупателиПоставщики") Тогда
		мас=Новый массив;
		мас.Добавить(Справочники.ххх_Справочник.КонтрагентыПапкаИнтерентПокупатели.значение);
		мас.Добавить(Справочники.ххх_Справочник.КонтрагентыПапкаПОСТАВЩИКИ.значение);
		Список.Параметры.УстановитьЗначениеПараметра("Поставщики",мас);
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Поставщики",Справочники.ххх_Справочник.КонтрагентыПапкаПОСТАВЩИКИ.значение);
	КонецЕсли;
КонецПроцедуры
