
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостиПринтерЛп16();
	УстановитьКомментарииПараметровВесов();
КонецПроцедуры

Процедура УстановитьВидимостиПринтерЛп16();
	Если Объект.ТипОборудования=Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток Тогда
		ЭтаФорма.Элементы.ВесыЛп16.Видимость=Истина;
	Иначе
		ЭтаФорма.Элементы.ВесыЛп16.Видимость=Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТипОборудованияПриИзменении(Элемент)
	УстановитьВидимостиПринтерЛп16();
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыВесовЗначениеПриИзменении(Элемент)
	
	//Элементы.ПараметрыВесовКомментарий.Заголовок
	СпецПараметры = Элементы.ПараметрыВесов.ТекущиеДанные;
	Если СпецПараметры.Параметр = 404 Тогда
		Коммент = "использовать блокировку части клавиш функциональной клавиатуры";
		Если СпецПараметры.Значение = 0 Тогда
			Коммент = "не " + Коммент;
		КонецЕсли;
	ИначеЕсли СпецПараметры.Параметр = 438 Тогда
		Коммент = "после включения весов режим автоматической печати этикеток ";
		Если СпецПараметры.Значение = 0 Тогда
			Коммент = Коммент+"отключен";
		ИначеЕсли СпецПараметры.Значение = 1 Тогда
			Коммент = Коммент+"включен";
		КонецЕсли;
	КонецЕсли;
	
	СпецПараметры.Комментарий = Коммент;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьКомментарииПараметровВесов()
	
	Для Каждого СпецПараметры Из Объект.ПараметрыВесов Цикл
		Если СпецПараметры.Параметр = 404 Тогда
			Коммент = "использовать блокировку части клавиш функциональной клавиатуры";
			Если СпецПараметры.Значение = 0 Тогда
				Коммент = "не " + Коммент;
			КонецЕсли;
		ИначеЕсли СпецПараметры.Параметр = 438 Тогда
			Коммент = "после включения весов режим автоматической печати этикеток ";
			Если СпецПараметры.Значение = 0 Тогда
				Коммент = Коммент+"отключен";
			ИначеЕсли СпецПараметры.Значение = 1 Тогда
				Коммент = Коммент+"включен";
			КонецЕсли;
		КонецЕсли;
		СпецПараметры.Комментарий = Коммент;		
	КонецЦикла;
	
КонецПроцедуры
