#Область ПрограммныйИнтерфейс

// Возвращает сведения о коэффициенте пересчета единицы измерения ВетИС.
//
// Параметры:
//	ЕдиницаИзмеренияВЕТИС	- СправочникСсылка.ЕдиницыИзмеренияВЕТИС	- Единица измерения ВетИС, коэффициент которой нужно 
//																		получить.
//	Номенклатура			- СправочникСсылка.Номенклатура				- Номенклатура для единицы хранения, которой осуществляется 
//																		получение коэффициента пересчета.
//
// Возвращаемое значение:
//	Структура - Структура со свойствами:
//		* КодОшибки					- Число				- Код ошибки получения коэффициента.
//															0 - Нет ошибок;
//															1 - Не заполнена единица измерения в с правочнике 'ЕдиницыИзмеренияВЕТИС';
//															2 - В справочнике 'Номенклатура' выключена возможность пересчета количества 
//																в соответствующую мерную единицу измерения;
//															3 - Не удалось сопоставить единицу хранения справочника 'Номенклатура' 
//																с единицей измерения справочника 'ЕдиницыИзмеренияВЕТИС'.
//		* Коэффициент				- Число				- Коэффициент пересчета единицы измерения ВетИС.
//		* КэшироватьДанные			- Булево, Истина	- Признак необходимости кэшированния сведений о коэффициенте пересчета.
//		* НужноОкруглятьКоличество	- Булево, Истина	- Признак необходимости округления количества при пересчете.
//
Функция ДанныеЕдиницыИзмренияВЕТИС(ЕдиницаИзмеренияВЕТИС, Номенклатура) Экспорт
	
	ДанныеЕдиницыИзмренияВЕТИС = Справочники.БазовыеЕдиницыИзмерения.КоэффициентЕдиницыИзмеренияПоВЕТИС(
		ЕдиницаИзмеренияВЕТИС, Номенклатура);
	
	Возврат ДанныеЕдиницыИзмренияВЕТИС;
	
КонецФункции

#КонецОбласти