
&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	ОбъектПрямой=РеквизитФормыВЗначение("Объект");
	ОбъектПрямой.сформировать();
	//Объект.Масштаб=ОбъектПрямой.Масштаб;
	//ЭтаФорма.Масштаб=Объект.Масштаб;
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	//Объект.ТабличныйДокумент.АвтоМасштаб=Истина;
	Объект.ТабличныйДокумент.Напечатать(РежимИспользованияДиалогаПечати.Использовать);
КонецПроцедуры



&НаКлиенте
Процедура Сохранить(Команда)
	ОбъектыПечати=Новый СписокЗначений;
	ОбъектыПечати.Добавить(объект.ТабличныйДокумент);
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ОбъектыПечати", ОбъектыПечати);
	ОткрытьФорму("ОбщаяФорма.СохранениеПечатнойФормы", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Объект.ТабличныйДокумент.МасштабПечати=ЭтаФорма.Масштаб;
КонецПроцедуры
