
&НаКлиенте
Процедура КочетовЗаполнитьПоЦенамРевизииПеред(Команда)
	Если ТипЗнч(Объект.ДокументОснование)=Тип("ДокументСсылка.ПриказНаПроведениеИнвентаризацииТоваров") Тогда
		КочетовЗаполнитьПоЦенамРевизииПередСервер();		
	КонецЕсли;
КонецПроцедуры

Процедура КочетовЗаполнитьПоЦенамРевизииПередСервер()
	
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("пересчет",Объект.Документоснование);
	Запрос.Текст="";
	
	Для каждого стр из Объект.Товары Цикл
		
		стрДокОсн=Объект.Документоснование.Товары.Найти(стр.номенклатура);
		стр.Цена=стрДокОсн.Цена;
		Стр.Сумма=стр.цена*стр.количество;
		
	КонецЦикла;
	
	Объект.СуммаДокумента=Объект.Товары.Итог("Сумма");
	
КонецПроцедуры

&НаКлиенте
Процедура КочетовЗаполнитьЦеныПоЦенамРевизииПеред(Команда)
	Если ТипЗнч(Объект.ДокументОснование)=Тип("ДокументСсылка.ПриказНаПроведениеИнвентаризацииТоваров") Тогда
		КочетовЗаполнитьПоЦенамРевизииПередСервер();		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура КочетовПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	Если не РольДоступна("ПолныеПрава")Тогда
		
		Запрос=новый запрос;
		Запрос.УстановитьПараметр("Пользователь",ПараметрыСеанса.АвторизованныйПользователь);
		Запрос.УстановитьПараметр("ГруппаДоступаБухгалтер",Справочники.ххх_Справочник.ГруппаДоступаБухгалтер.значение);
		Запрос.Текст="ВЫБРАТЬ
		             |	ГруппыДоступаПользователи.Ссылка КАК Ссылка
		             |ИЗ
		             |	Справочник.ГруппыДоступа.Пользователи КАК ГруппыДоступаПользователи
		             |ГДЕ
		             |	ГруппыДоступаПользователи.Ссылка = &ГруппаДоступаБухгалтер
		             |	И ГруппыДоступаПользователи.Пользователь = &Пользователь";
		Выборка=Запрос.Выполнить().Выбрать();
		
		Если ЗначениеЗаполнено(Объект.ДокументОснование) 
			и ТипЗнч(Объект.ДокументОснование)=Тип("ДокументСсылка.ПриказНаПроведениеИнвентаризацииТоваров") 
			и не выборка.Следующий() тогда
			Отказ=истина;
			Сообщить("Не хватает прав!");
		КонецЕсли;
		
	КонецЕсли;
КонецПроцедуры
