
&НаСервере
&Вместо("ЗаполнитьРеквизитыПоПродукции")
Процедура КочетовЗаполнитьРеквизитыПоПродукции(Продукция1)
	РеквизитыПродукции = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Продукция1,
		"ТипПродукции,Продукция,ВидПродукции");
		
	ЭтаФорма.Продукция    = Продукция1;
	//ТипПродукции = РеквизитыПродукции.ТипПродукции;
	//ВидПродукции = РеквизитыПродукции.ВидПродукции;

КонецПроцедуры

&НаСервере
Процедура КочетовНоменклатураПриИзмененииВместоНаСервере()
	
	Если не ЗначениеЗаполнено(Номенклатура) Тогда
		Список.ТекстЗапроса="ВЫБРАТЬ
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.НомерЗаписи КАК НомерЗаписи,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.Статус КАК Статус,
		                    |	ОстаткиПродукцииВЕТИС.Продукция КАК Продукция,
		                    |	ОстаткиПродукцииВЕТИС.ХозяйствующийСубъект КАК ХозяйствующийСубъект,
		                    |	ОстаткиПродукцииВЕТИС.Предприятие КАК Предприятие,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваНачалоПериода КАК ДатаПроизводства,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиНачалоПериода КАК СрокГодности,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваСтрока КАК ДатаПроизводстваСтрока,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваТочностьЗаполнения КАК ДатаПроизводстваТочностьЗаполнения,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваНачалоПериода КАК ДатаПроизводстваНачалоПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваКонецПериода КАК ДатаПроизводстваКонецПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиСтрока КАК СрокГодностиСтрока,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиТочностьЗаполнения КАК СрокГодностиТочностьЗаполнения,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиНачалоПериода КАК СрокГодностиНачалоПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиКонецПериода КАК СрокГодностиКонецПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СтранаПроизводства КАК СтранаПроизводства,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СкоропортящаясяПродукция КАК СкоропортящаясяПродукция,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.НизкокачественнаяПродукция КАК НизкокачественнаяПродукция,
		                    |	ОстаткиПродукцииВЕТИС.ЕдиницаИзмеренияВЕТИС КАК ЕдиницаИзмеренияВЕТИС,
		                    |	ОстаткиПродукцииВЕТИС.КоличествоВЕТИС КАК КоличествоВЕТИС
		                    |ИЗ
		                    |	РегистрСведений.ОстаткиПродукцииВЕТИС КАК ОстаткиПродукцииВЕТИС";
	Иначе                                                                
		Список.ТекстЗапроса="ВЫБРАТЬ
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.НомерЗаписи КАК НомерЗаписи,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.Статус КАК Статус,
		                    |	ОстаткиПродукцииВЕТИС.Продукция КАК Продукция,
		                    |	ОстаткиПродукцииВЕТИС.ХозяйствующийСубъект КАК ХозяйствующийСубъект,
		                    |	ОстаткиПродукцииВЕТИС.Предприятие КАК Предприятие,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваНачалоПериода КАК ДатаПроизводства,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиНачалоПериода КАК СрокГодности,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала КАК ЗаписьСкладскогоЖурнала,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваСтрока КАК ДатаПроизводстваСтрока,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваТочностьЗаполнения КАК ДатаПроизводстваТочностьЗаполнения,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваНачалоПериода КАК ДатаПроизводстваНачалоПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.ДатаПроизводстваКонецПериода КАК ДатаПроизводстваКонецПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиСтрока КАК СрокГодностиСтрока,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиТочностьЗаполнения КАК СрокГодностиТочностьЗаполнения,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиНачалоПериода КАК СрокГодностиНачалоПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СрокГодностиКонецПериода КАК СрокГодностиКонецПериода,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СтранаПроизводства КАК СтранаПроизводства,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.СкоропортящаясяПродукция КАК СкоропортящаясяПродукция,
		                    |	ОстаткиПродукцииВЕТИС.ЗаписьСкладскогоЖурнала.НизкокачественнаяПродукция КАК НизкокачественнаяПродукция,
		                    |	ОстаткиПродукцииВЕТИС.ЕдиницаИзмеренияВЕТИС КАК ЕдиницаИзмеренияВЕТИС,
		                    |	ОстаткиПродукцииВЕТИС.КоличествоВЕТИС КАК КоличествоВЕТИС
		                    |ИЗ
		                    |	РегистрСведений.ОстаткиПродукцииВЕТИС КАК ОстаткиПродукцииВЕТИС
		                    |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                    |			ВходящаяТранспортнаяОперацияВЕТИСТовары.Продукция КАК Продукция
		                    |		ИЗ
		                    |			Документ.ВходящаяТранспортнаяОперацияВЕТИС.Товары КАК ВходящаяТранспортнаяОперацияВЕТИСТовары
		                    |		ГДЕ
		                    |			ВходящаяТранспортнаяОперацияВЕТИСТовары.Ссылка.Проведен
		                    |			И ВходящаяТранспортнаяОперацияВЕТИСТовары.Номенклатура = &Номенклатура
		                    |		
		                    |		СГРУППИРОВАТЬ ПО
		                    |			ВходящаяТранспортнаяОперацияВЕТИСТовары.Продукция) КАК ВложенныйЗапрос
		                    |		ПО ОстаткиПродукцииВЕТИС.Продукция = ВложенныйЗапрос.Продукция";
		
		список.Параметры.УстановитьЗначениеПараметра("номенклатура",номенклатура);
	КонецЕсли;
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура КочетовНоменклатураПриИзмененииВместо(Элемент)
	КочетовНоменклатураПриИзмененииВместоНаСервере();
КонецПроцедуры

