
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Дата=ТекущаяДата();
	Список.Параметры.УстановитьЗначениеПараметра("Параметр1","");
	Список.Параметры.УстановитьЗначениеПараметра("Параметр2",Формат(Дата,"ДФ=yyyyMMdd"));
	Список.Параметры.УстановитьЗначениеПараметра("Параметр3",Формат(Дата,"ДФ=yyyyMMdd"));
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()
	
	Список.Параметры.УстановитьЗначениеПараметра("Параметр1",?(ЗначениеЗаполнено(Папка),папка.ххх_ИдЦентр,""));
	Список.Параметры.УстановитьЗначениеПараметра("Параметр2",Формат(Дата,"ДФ=yyyyMMdd"));
	Список.Параметры.УстановитьЗначениеПараметра("Параметр3",Формат(Дата,"ДФ=yyyyMMdd"));

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ДатаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПапкаПриИзмененииНаСервере()
		
	Список.Параметры.УстановитьЗначениеПараметра("Параметр1",?(ЗначениеЗаполнено(Папка),папка.ххх_ИдЦентр,""));
	Список.Параметры.УстановитьЗначениеПараметра("Параметр2",Формат(Дата,"ДФ=yyyyMMdd"));
	Список.Параметры.УстановитьЗначениеПараметра("Параметр3",Формат(Дата,"ДФ=yyyyMMdd"));

КонецПроцедуры

&НаКлиенте
Процедура ПапкаПриИзменении(Элемент)
	ПапкаПриИзмененииНаСервере();
КонецПроцедуры
