
&После("ПриЗаписи")
Процедура КочетовПриЗаписи(Отказ)
	Если не отказ Тогда
		
		Запрос=новый запрос;
		запрос.УстановитьПараметр("НомерСправки1",РегистрационныйНомер);
		Запрос.Текст="ВЫБРАТЬ
		             |	Справки2ЕГАИС.Ссылка КАК Ссылка
		             |ИЗ
		             |	Справочник.Справки2ЕГАИС КАК Справки2ЕГАИС
		             |ГДЕ
		             |	Справки2ЕГАИС.НомерСправки1 = &НомерСправки1
		             |	И ЕСТЬNULL(Справки2ЕГАИС.Справка1.РегистрационныйНомер, """") <> &НомерСправки1";
		выборка=Запрос.Выполнить().Выбрать();
		
		Пока выборка.Следующий() Цикл
			справка2=выборка.ссылка.получитьОбъект();
			справка2.справка1=Ссылка;
			справка2.записать();
		КонецЦикла;
		
	КонецЕсли;
КонецПроцедуры
