
&НаКлиенте
Процедура КочетовТоварыАлкогольнаяПродукцияНачалоВыбораВместо(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	ПараметрыОткрытия=Новый структура;
	Отбор=Новый структура;
	Отбор.Вставить("номенклатура",Элементы.Товары.ТекущиеДанные.Номенклатура);
	ПараметрыОткрытия.Вставить("Отбор",Отбор);
	ОткрытьФорму("Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ФормаВыбора",ПараметрыОткрытия,Элемент,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
