
&После("ПриОпределенииОбъектовСКомандамиПечати")
// Определяет объекты конфигурации, в модулях менеджеров которых размещена процедура ДобавитьКомандыПечати,
// формирующая список команд печати, предоставляемых этим объектом.
//
// Параметры:
//  СписокОбъектов - Массив - менеджеры объектов с процедурой ДобавитьКомандыПечати.
//
Процедура КочетовПриОпределенииОбъектовСКомандамиПечати(СписокОбъектов)
	
	СписокОбъектов.Добавить(Документы.Я_ПересортицаТоваров); //ValMa - добавить наш новый документ для возможности печати
	
КонецПроцедуры
