
&НаКлиенте
Процедура КочетовЗаполнитьВсехПользователейПоТекущейСтрокеВместо(Команда)
	КочетовЗаполнитьВсехПользователейПоТекущейСтрокеВместоНаСервере(Элементы.Список.ТекущиеДанные.ссылка);
КонецПроцедуры

&НаСервере
Процедура КочетовЗаполнитьВсехПользователейПоТекущейСтрокеВместоНаСервере(ТекущийЮзверВетис)
	Юзверы=Справочники.Пользователи.Выбрать();
	Пока Юзверы.Следующий() Цикл
		
		ЮзверВетис=справочники.ПользователиВЕТИС.НайтиПоРеквизиту("Пользователь",Юзверы.Ссылка);
		Если Не ЗначениеЗаполнено(ЮзверВетис) тогда
			ЮзверВетис=Справочники.ПользователиВЕТИС.СоздатьЭлемент();
		Иначе
			ЮзверВетис=ЮзверВетис.получитьОбъект();
		КонецЕсли;
			
		//ЗаполнитьЗначенияСвойств(ЮзверВетис,ТекущийЮзверВетис);
		ЮзверВетис.НаименованиеПолное=ТекущийЮзверВетис.НаименованиеПолное;
		ЮзверВетис.Наименование=ТекущийЮзверВетис.Наименование;
		ЮзверВетис.УчетнаяЗапись=ТекущийЮзверВетис.УчетнаяЗапись;
		ЮзверВетис.Пользователь=Юзверы.ссылка;
		ЮзверВетис.записать();
		
		наб=РегистрыСведений.ПраваДоступаПользователейВЕТИС.СоздатьНаборЗаписей();
		наб.Отбор.ПравоДоступа.установить(Перечисления.ПраваДоступаВЕТИС.УполномоченноеОформлениеВозвратныхВСД);
		наб.Прочитать();
		
		ПользакСПравами=наб[0].ПользовательВЕТИС;
		
		наб=РегистрыСведений.ПраваДоступаПользователейВЕТИС.СоздатьНаборЗаписей();
		наб.Отбор.ПользовательВЕТИС.установить(ПользакСПравами);
		наб.Прочитать();
		
		Для каждого стр из наб цикл
			
			мен=РегистрыСведений.ПраваДоступаПользователейВЕТИС.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(мен,стр);
			мен.ПользовательВЕТИС=ЮзверВетис.ссылка;
			
			мен.Записать(Истина);

		КонецЦикла;
	//	стрОлд=стрОлд[0];
	//	
	//	
	//	мен=РегистрыСведений.ПраваДоступаПользователейВЕТИС.СоздатьМенеджерЗаписи();
	//	ЗаполнитьЗначенияСвойств(мен,стрОлд);
	//	мен.ПользовательВЕТИС=ЮзверВетис.ссылка;
	//	
	//	мен.Записать(Истина);
	//
	КонецЦикла;
КонецПроцедуры













