
&Вместо("ТекстЗапросаТТН")
//ValMa - в новом релизе функцию заменили на процедуру:

//Функция КочетовТекстЗапросаТТН(Организация, ТорговыйОбъект, ОжидаетсяОформление)
//	ТекстЗапроса = 
//	"ВЫБРАТЬ
//	|	ДокументТТНВходящаяЕГАИС.Ссылка КАК Ссылка,
//	|	ДокументТТНВходящаяЕГАИС.ПометкаУдаления КАК ПометкаУдаления,
//	|	ДокументТТНВходящаяЕГАИС.Номер КАК Номер,
//	|	ДокументТТНВходящаяЕГАИС.Дата КАК Дата,
//	|	ДокументТТНВходящаяЕГАИС.Проведен КАК Проведен,
//	|	ДокументТТНВходящаяЕГАИС.ТорговыйОбъект КАК ТорговыйОбъект,
//	|	ДокументТТНВходящаяЕГАИС.Организация КАК Организация,
//	|	ДокументТТНВходящаяЕГАИС.Идентификатор КАК Идентификатор,
//	|	ДокументТТНВходящаяЕГАИС.ИдентификаторЕГАИС КАК ИдентификаторЕГАИС,
//	|	ДокументТТНВходящаяЕГАИС.Упакована КАК Упакована,
//	|	ДокументТТНВходящаяЕГАИС.НомерТТН КАК НомерТТН,
//	|	ДокументТТНВходящаяЕГАИС.ДатаТТН КАК ДатаТТН,
//	|	ДокументТТНВходящаяЕГАИС.ДатаОтгрузки КАК ДатаОтгрузки,
//	|	ДокументТТНВходящаяЕГАИС.Грузоотправитель КАК Грузоотправитель,
//	|	ДокументТТНВходящаяЕГАИС.Грузополучатель КАК Грузополучатель,
//	|	ДокументТТНВходящаяЕГАИС.Поставщик КАК Поставщик,
//	|	ЕСТЬNULL(ДокументТТНВходящаяЕГАИС.Поставщик.Контрагент, ДокументТТНВходящаяЕГАИС.Грузоотправитель.Контрагент) КАК ПоставщикКонтрагент,
//	|	ДокументТТНВходящаяЕГАИС.Основание КАК Основание,
//	|	ДокументТТНВходящаяЕГАИС.Комментарий КАК Комментарий,
//	|	ДокументТТНВходящаяЕГАИС.ТипДоставки КАК ТипДоставки,
//	|	ДокументТТНВходящаяЕГАИС.Перевозчик КАК Перевозчик,
//	|	ДокументТТНВходящаяЕГАИС.Автомобиль КАК Автомобиль,
//	|	ДокументТТНВходящаяЕГАИС.Прицеп КАК Прицеп,
//	|	ДокументТТНВходящаяЕГАИС.Заказчик КАК Заказчик,
//	|	ДокументТТНВходящаяЕГАИС.Водитель КАК Водитель,
//	|	ДокументТТНВходящаяЕГАИС.ПунктПогрузки КАК ПунктПогрузки,
//	|	ДокументТТНВходящаяЕГАИС.ПунктРазгрузки КАК ПунктРазгрузки,
//	|	ДокументТТНВходящаяЕГАИС.Перенаправление КАК Перенаправление,
//	|	ДокументТТНВходящаяЕГАИС.Экспедитор КАК Экспедитор,
//	|	ДокументТТНВходящаяЕГАИС.СуммаДокумента КАК СуммаДокумента,
//	|	ДокументТТНВходящаяЕГАИС.МоментВремени КАК МоментВремени,
//	|	ДокументТТНВходящаяЕГАИС.ЕстьРасхождения КАК ЕстьРасхождения,
//	|	ВЫБОР
//	|		КОГДА ПоступлениеТоваров.Ссылка ЕСТЬ NULL
//	|				И ПеремещениеТоваров.Ссылка ЕСТЬ NULL
//	|			ТОГДА ЛОЖЬ
//	|		ИНАЧЕ ИСТИНА
//	|	КОНЕЦ КАК ВведеноПоступление,
//	|	ВЫБОР
//	|		КОГДА НЕ ПеремещениеТоваров.Ссылка ЕСТЬ NULL
//	|			ТОГДА ПеремещениеТоваров.Ссылка
//	|		КОГДА НЕ ПоступлениеТоваров.Ссылка ЕСТЬ NULL
//	|			ТОГДА ПоступлениеТоваров.Ссылка
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ПоступлениеТоваров.ПустаяСсылка)
//	|	КОНЕЦ КАК ПоступлениеТоваров,
//	|	ВЫБОР
//	|		КОГДА НЕ ПеремещениеТоваров.Ссылка ЕСТЬ NULL
//	|			ТОГДА ПеремещениеТоваров.Номер
//	|		КОГДА НЕ ПоступлениеТоваров.Ссылка ЕСТЬ NULL
//	|			ТОГДА ПоступлениеТоваров.Номер
//	|		ИНАЧЕ """"
//	|	КОНЕЦ КАК ПоступлениеТоваровПредставление,
//	|	ВЫБОР
//	|		КОГДА ПоступлениеТоваров.Ссылка ЕСТЬ NULL
//	|				И ПеремещениеТоваров.Ссылка ЕСТЬ NULL
//	|				И НЕ СтатусыДокументовЕГАИС.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаКПередаче), ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаПереданВУТМ), ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаОбрабатываетсяЕГАИС), ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаОшибка))
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовЕГАИС.НеОформлено)
//	|		КОГДА (НЕ ПоступлениеТоваров.Ссылка ЕСТЬ NULL
//	|				ИЛИ НЕ ПеремещениеТоваров.Ссылка ЕСТЬ NULL)
//	|				И НЕ СтатусыДокументовЕГАИС.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаКПередаче), ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаПереданВУТМ), ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаОбрабатываетсяЕГАИС), ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаОшибка))
//	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовЕГАИС.Оформлено)
//	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовЕГАИС.НеТребуется)
//	|	КОНЕЦ КАК ОформлениеПоступления,
//	|	ВЫБОР
//	|		КОГДА СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.ПустаяСсылка)
//	|			ТОГДА ИСТИНА
//	|		ИНАЧЕ ЛОЖЬ
//	|	КОНЕЦ КАК ПустойСтатус,
//	|	СтатусыДокументовЕГАИС.Статус КАК СтатусЕГАИС,
//	|	СтатусыДокументовЕГАИС.ДальнейшееДействие1 КАК ДальнейшееДействиеЕГАИС1,
//	|	СтатусыДокументовЕГАИС.ДальнейшееДействие2 КАК ДальнейшееДействиеЕГАИС2,
//	|	СтатусыДокументовЕГАИС.ДальнейшееДействие3 КАК ДальнейшееДействиеЕГАИС3,
//	|	ВЫБОР
//	|		КОГДА ПоступлениеТоваров.Ссылка ЕСТЬ NULL
//	|			ТОГДА ""Красный""
//	|		ИНАЧЕ ВЫБОР
//	|				КОГДА ПоступлениеТоваров.Ссылка.Проведен
//	|					ТОГДА ""Зеленый""
//	|				ИНАЧЕ ""Фиалетовый""
//	|			КОНЕЦ
//	|	КОНЕЦ КАК Цвет
//	|ИЗ
//	|	Документ.ТТНВходящаяЕГАИС КАК ДокументТТНВходящаяЕГАИС
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
//	|		ПО ДокументТТНВходящаяЕГАИС.ДокументОснование = ПоступлениеТоваров.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
//	|		ПО ДокументТТНВходящаяЕГАИС.ДокументОснование = ПеремещениеТоваров.Ссылка
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
//	|		ПО (СтатусыДокументовЕГАИС.Документ = ДокументТТНВходящаяЕГАИС.Ссылка)
//	|ГДЕ
//	|	&УсловиеОтбора";

//	
//	УсловиеОтбора = "";
//	Если ЗначениеЗаполнено(Организация) Тогда
//		УсловиеОтбора = УсловиеОтбора + "ДокументТТНВходящаяЕГАИС.Организация = &Организация";
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(ТорговыйОбъект) Тогда
//		Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
//			УсловиеОтбора = УсловиеОтбора + " И ";
//		КонецЕсли;
//		УсловиеОтбора = УсловиеОтбора + "ДокументТТНВходящаяЕГАИС.ТорговыйОбъект = &ТорговыйОбъект";
//	КонецЕсли;
//	
//	Если ОжидаетсяОформление Тогда
//		Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
//			УсловиеОтбора = УсловиеОтбора + " И ";
//		КонецЕсли;
//		УсловиеОтбора = УсловиеОтбора +
//		"(СтатусыДокументовЕГАИС.ДальнейшееДействие1 В(&ТребующиеДействия))";
//	КонецЕсли;
//	
//	Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеОтбора", УсловиеОтбора);
//	Иначе
//		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеОтбора", "ИСТИНА");
//	КонецЕсли;
//	
//	Возврат ТекстЗапроса;

//КонецФункции

// Заполняет текст запроса ТТН входящих динамического списка, отображаемого в форме списка документов.
//
// Параметры:
//   ТекстЗапроса - Строка - текст запроса динамического списка,
//   Организация - ОпределяемыйТип.ОрганизацияКонтрагентГосИС - организация, по которой нужно отобрать документы,
//   ТорговыйОбъект - ОпределяемыйТип.ТорговыйОбъектЕГАИС - торговый объект, по которому нужно отобрать документы,
//   ОжидаетсяОформление- Булево - если Истина, будут отобраны только документы, ожидающие оформления.
//
Процедура КочетовТекстЗапросаТТН(ТекстЗапроса, Организация = Неопределено, ТорговыйОбъект = Неопределено, ОжидаетсяОформление = Ложь) Экспорт
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДокументТТНВходящаяЕГАИС.Ссылка,
	|	ДокументТТНВходящаяЕГАИС.ПометкаУдаления,
	|	ДокументТТНВходящаяЕГАИС.Номер,
	|	ДокументТТНВходящаяЕГАИС.Дата,
	|	ДокументТТНВходящаяЕГАИС.Проведен,
	|	ДокументТТНВходящаяЕГАИС.ТорговыйОбъект,
	|	ДокументТТНВходящаяЕГАИС.Организация,
	|	ДокументТТНВходящаяЕГАИС.Идентификатор,
	|	ДокументТТНВходящаяЕГАИС.ИдентификаторЕГАИС,
	|	ДокументТТНВходящаяЕГАИС.Упакована,
	|	ДокументТТНВходящаяЕГАИС.НомерТТН,
	|	ДокументТТНВходящаяЕГАИС.ДатаТТН,
	|	ДокументТТНВходящаяЕГАИС.ДатаОтгрузки,
	|	ДокументТТНВходящаяЕГАИС.Грузоотправитель,
	|	ДокументТТНВходящаяЕГАИС.Грузополучатель,
	|	ДокументТТНВходящаяЕГАИС.Поставщик,
	|	ЕСТЬNULL(ДокументТТНВходящаяЕГАИС.Поставщик.Контрагент, ДокументТТНВходящаяЕГАИС.Грузоотправитель.Контрагент) КАК ПоставщикКонтрагент,
	|	ДокументТТНВходящаяЕГАИС.Основание,
	|	ДокументТТНВходящаяЕГАИС.Комментарий,
	|	ДокументТТНВходящаяЕГАИС.ТипДоставки,
	|	ДокументТТНВходящаяЕГАИС.Перевозчик,
	|	ДокументТТНВходящаяЕГАИС.Автомобиль,
	|	ДокументТТНВходящаяЕГАИС.Прицеп,
	|	ДокументТТНВходящаяЕГАИС.Заказчик,
	|	ДокументТТНВходящаяЕГАИС.Водитель,
	|	ДокументТТНВходящаяЕГАИС.ПунктПогрузки,
	|	ДокументТТНВходящаяЕГАИС.ПунктРазгрузки,
	|	ДокументТТНВходящаяЕГАИС.Перенаправление,
	|	ДокументТТНВходящаяЕГАИС.Экспедитор,
	|	ДокументТТНВходящаяЕГАИС.СуммаДокумента,
	|	ДокументТТНВходящаяЕГАИС.МоментВремени,
	|	ДокументТТНВходящаяЕГАИС.ЕстьРасхождения,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваров.Ссылка ЕСТЬ NULL И ПеремещениеТоваров.Ссылка ЕСТЬ NULL
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ВведеноПоступление,
	|	ВЫБОР
	|		КОГДА НЕ ПеремещениеТоваров.Ссылка ЕСТЬ NULL 
	|			ТОГДА ПеремещениеТоваров.Ссылка
	|		КОГДА НЕ ПоступлениеТоваров.Ссылка ЕСТЬ NULL 
	|			ТОГДА ПоступлениеТоваров.Ссылка
	|		ИНАЧЕ ЗНАЧЕНИЕ(Документ.ПоступлениеТоваров.ПустаяСсылка)
	|	КОНЕЦ КАК ПоступлениеТоваров,
	|	ВЫБОР
	|		КОГДА НЕ ПеремещениеТоваров.Ссылка ЕСТЬ NULL 
	|			ТОГДА ПеремещениеТоваров.Номер
	|		КОГДА НЕ ПоступлениеТоваров.Ссылка ЕСТЬ NULL 
	|			ТОГДА ПоступлениеТоваров.Номер
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК ПоступлениеТоваровПредставление,
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваров.Ссылка ЕСТЬ NULL И ПеремещениеТоваров.Ссылка ЕСТЬ NULL
	|			И НЕ СтатусыДокументовЕГАИС.Статус В (
	|			ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаКПередаче),
	|			ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаПереданВУТМ),
	|			ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаОбрабатываетсяЕГАИС),
	|			ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаОшибка))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовЕГАИС.НеОформлено)
	|		КОГДА (НЕ ПоступлениеТоваров.Ссылка ЕСТЬ NULL ИЛИ НЕ ПеремещениеТоваров.Ссылка ЕСТЬ NULL)
	|			И НЕ СтатусыДокументовЕГАИС.Статус В(
	|			ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаКПередаче),
	|			ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаПереданВУТМ),
	|			ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаОбрабатываетсяЕГАИС),
	|			ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.АктОтказаОшибка))
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовЕГАИС.Оформлено)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.СтатусыОформленияДокументовЕГАИС.НеТребуется)
	|	КОНЕЦ КАК ОформлениеПоступления,
	|	ВЫБОР
	|		КОГДА СтатусыДокументовЕГАИС.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыОбработкиТТНВходящейЕГАИС.ПустаяСсылка)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ПустойСтатус,
	|
	|	СтатусыДокументовЕГАИС.Статус              КАК СтатусЕГАИС,
	|	СтатусыДокументовЕГАИС.ДальнейшееДействие1 КАК ДальнейшееДействиеЕГАИС1,
	|	СтатусыДокументовЕГАИС.ДальнейшееДействие2 КАК ДальнейшееДействиеЕГАИС2,
	|	СтатусыДокументовЕГАИС.ДальнейшееДействие3 КАК ДальнейшееДействиеЕГАИС3,
	//+++
	|	ВЫБОР
	|		КОГДА ПоступлениеТоваров.Ссылка ЕСТЬ NULL
	|			ТОГДА ""Красный""
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПоступлениеТоваров.Ссылка.Проведен
	|					ТОГДА ""Зеленый""
	|				ИНАЧЕ ""Фиалетовый""
	|			КОНЕЦ
	|	КОНЕЦ КАК Цвет
	//---
	|ИЗ
	|	Документ.ТТНВходящаяЕГАИС КАК ДокументТТНВходящаяЕГАИС
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	|		ПО ДокументТТНВходящаяЕГАИС.ДокументОснование = ПоступлениеТоваров.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	|		ПО ДокументТТНВходящаяЕГАИС.ДокументОснование = ПеремещениеТоваров.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыДокументовЕГАИС КАК СтатусыДокументовЕГАИС
	|		ПО (СтатусыДокументовЕГАИС.Документ = ДокументТТНВходящаяЕГАИС.Ссылка)
	|ГДЕ
	|	&УсловиеОтбора";
	
	УсловиеОтбора = "";
	Если ЗначениеЗаполнено(Организация) Тогда
		УсловиеОтбора = УсловиеОтбора + "ДокументТТНВходящаяЕГАИС.Организация = &Организация";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТорговыйОбъект) Тогда
		Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
			УсловиеОтбора = УсловиеОтбора + " И ";
		КонецЕсли;
		УсловиеОтбора = УсловиеОтбора + "ДокументТТНВходящаяЕГАИС.ТорговыйОбъект = &ТорговыйОбъект";
	КонецЕсли;
	
	Если ОжидаетсяОформление Тогда
		Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
			УсловиеОтбора = УсловиеОтбора + " И ";
		КонецЕсли;
		УсловиеОтбора = УсловиеОтбора +
		"(СтатусыДокументовЕГАИС.ДальнейшееДействие1 В(&ТребующиеДействия))";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УсловиеОтбора) Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеОтбора", УсловиеОтбора);
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"&УсловиеОтбора", "ИСТИНА");
	КонецЕсли;
	
КонецПроцедуры
