
&Вместо("ОбработатьДанныеШтрихкода")
Процедура КочетовОбработатьДанныеШтрихкода(ОповещениеПриЗавершении, Форма, СтруктураШтрихкода, ПараметрыСканированияАкцизныхМарок)
	
	Если ПараметрыСканированияАкцизныхМарок = Неопределено Тогда
		ПараметрыСканированияАкцизныхМарок = АкцизныеМаркиКлиентСервер.ПараметрыСканированияАкцизныхМарок(Форма);
	КонецЕсли;
	
	СписокШтрихкодов = Новый Массив;
	
	Для Сч = 1 По СтруктураШтрихкода.Количество Цикл
		СписокШтрихкодов.Добавить(СтруктураШтрихкода.Штрихкод);
	КонецЦикла;
	
	ДанныеШтрихкодов = АкцизныеМаркиВызовСервера.ПолучитьДанныеПоШтрихкодам(
		СписокШтрихкодов, ПараметрыСканированияАкцизныхМарок,
		Неопределено, Форма.УникальныйИдентификатор);
		
	ОтразитьИзменениеАдресаДанныхОснованияВФорме(Форма, ПараметрыСканированияАкцизныхМарок);
	
	РезультатОбработки = ДанныеШтрихкодов.РезультатыОбработкиШтрихкодов[СтруктураШтрихкода.Штрихкод];
	
	Если РезультатОбработки.ЕстьОшибкиВДеревеУпаковок Тогда
		РезультатОбработки.ЕстьОшибкиВДеревеУпаковок=ложь;
		РезультатОбработки.ТекстОшибки="";
	КонецЕсли;
	
	Если РезультатОбработки <> Неопределено Тогда
		
		Если ПараметрыСканированияАкцизныхМарок.СоответствиеШтрихкодовСтрокДерева <> Неопределено 
			И РезультатОбработки.ТребуетсяВыборНоменклатуры Тогда
			
			Если ПараметрыСканированияАкцизныхМарок.СоответствиеШтрихкодовСтрокДерева.Получить(СтруктураШтрихкода.Штрихкод) <> Неопределено Тогда
				РезультатОбработки.ТребуетсяВыборНоменклатуры = Ложь;
			КонецЕсли;
			
		КонецЕсли;
		
		Если РезультатОбработки.ЕстьОшибкиВДеревеУпаковок
			Или Не ПустаяСтрока(РезультатОбработки.ТекстОшибки)
			Или РезультатОбработки.ТребуетсяВыборНоменклатуры
			Или РезультатОбработки.ТребуетсяВыборСправки2 Тогда
			ЗавершитьОбработкуВводаШтрихкода(Форма, РезультатОбработки, Неопределено, ОповещениеПриЗавершении);
		Иначе
			ДанныеШтрихкода = ПолучитьИзВременногоХранилища(РезультатОбработки.АдресДанныхШтрихкода);
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, ДанныеШтрихкода);
		КонецЕсли;
		
	КонецЕсли;
	

КонецПроцедуры
