

&После("ОбработкаЗаполнения")
Процедура КочетовОбработкаЗаполненияПосле(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения)=Тип("ДокументСсылка.ВозвратТоваровПоставщику") Тогда		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		ЭтотОбъект.УстановитьНовыйНомер();
		Дата=ТекущаяДата();
		ЭтотОбъект.ДокументОснование=ДанныеЗаполнения.ссылка;
		СтатусОбработки=Перечисления.СтатусыОбработкиВозвратаИзРегистра2ЕГАИС.Черновик;
		Для каждого стр из ДанныеЗаполнения.Товары Цикл
			Если стр.номенклатура.АлкогольнаяПродукция=Истина Тогда
				стрЕГ=Товары.Добавить();
				ЗаполнитьЗначенияСвойств(стрЕГ,стр);
				стрЕГ.АлкогольнаяПродукция=стрЕГ.Справка2.АлкогольнаяПродукция;
			КонецЕсли;
		КонеццИКЛА;	
	КонецЕсли;
	
КонецПроцедуры
