
&После("ПередЗаписью")
Процедура КочетовПередЗаписью(Отказ)
	Если не Отказ и не СоответствуетОрганизации Тогда
		Запрос=Новый запрос;
		Запрос.УстановитьПараметр("ИНН",ИНН);
		Запрос.УстановитьПараметр("КПП",КПП);
		Запрос.УстановитьПараметр("Поставщики",Справочники.ххх_Справочник.КонтрагентыПапкаПОСТАВЩИКИ);
		Запрос.Текст="ВЫБРАТЬ
		             |	Контрагенты.Ссылка КАК Ссылка
		             |ИЗ
		             |	Справочник.Контрагенты КАК Контрагенты
		             |ГДЕ
		             |	Контрагенты.ИНН = &ИНН
		             |	И Контрагенты.КПП = &КПП
		             |	И Контрагенты.Ссылка В ИЕРАРХИИ(&Поставщики)";
		Выборка=ЗАпрос.Выполнить().Выбрать();
		Если выборка.Следующий() Тогда
			Контрагент=выборка.ссылка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
