
&Вместо("ОбработкаОповещенияВФормеДокументаОснования")
// ValMa - в новом релизе функцию заменили на процедуру
//Функция КочетовОбработкаОповещенияВФормеДокументаОснования(Форма, Объект, ИмяПодсистемы, ИмяСобытия, Параметр, Источник)
//	
//	ОповещениеОбработано = Ложь;
//	
//	Если ИмяПодсистемы = ИнтеграцияИСКлиентСервер.ПодсистемаВЕТИС() Тогда
//		
//		ОповещениеОбработано = ИнтеграцияИСКлиентРТ_ОбработкаОповещенияВФормеДокументаОснованияВЕТИС(
//			Форма,
//			Объект,
//			ИмяСобытия,
//			Параметр,
//			Источник);
//		
//	КонецЕсли;
//	
//	Возврат ОповещениеОбработано;
//КонецФункции

// Вызывается при возникновении события ОбработкаОповещения в форме документа-основания.
// В данной процедуре можно переопределить стандартную обработку этого события механизмом ВЕТИС.
// Если процедура переопределена, то необходимо установить параметр СобытиеОбработано в значение Истина.
//
Процедура КочетовОбработкаОповещенияВФормеДокументаОснования(Форма, Объект, ИмяСобытия,
			Параметр, Источник, СобытиеОбработано) Экспорт
	
	СобытиеОбработано = Ложь;
	
	СобытиеОбработано = ИнтеграцияИСКлиентРТ_ОбработкаОповещенияВФормеДокументаОснованияВЕТИС(
		Форма,
		Объект,
		ИмяСобытия,
		Параметр,
		Источник);
	
КонецПроцедуры

