
&НаКлиенте
Процедура Команда1(Команда)
	ЭтаФорма.Закрыть(Новый структура("ПоискПоВесовомуТовару,Штрихкод",ПоискПоВесовомуТовару,Штрихкод));
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры


Функция БыстрыйВызов(Код, Alt=0, Control=0, Shift=0) Экспорт
    Возврат ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,
        |{0,"+ Формат(Код, "ЧН=0; ЧГ=0") +","+ Формат(Alt*16+Control*8+Shift*4, "ЧН=0; ЧГ=0") +"}
        |}");
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
    Элементы.Команда1.СочетаниеКлавиш = БыстрыйВызов(13);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

