
&Вместо("ЗаполнитьУчетныеОстатки")
Процедура ВместоЗаполнитьУчетныеОстаткиКочетов() Экспорт
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Магазин", Магазин);
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаУчетныхОстатков);
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("КорректироватьОстаткиНемаркируемойПродукции", КорректироватьОстаткиНемаркируемойПродукции);
	Запрос.УстановитьПараметр("ОстаткиНаСкладе", ОстаткиНаСкладе);
	Запрос.УстановитьПараметр("ОстаткиВТорговомЗале", ОстаткиВТорговомЗале);
	Запрос.УстановитьПараметр("КорректироватьОстаткиНемаркируемойПродукции", КорректироватьОстаткиНемаркируемойПродукции);
	

	
	УсловиеПоДате = ?(ЗначениеЗаполнено(ДатаУчетныхОстатков), "&ДатаОстатков", "");
//	
//Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ВложенныйЗапрос.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
//		|	СУММА(ВложенныйЗапрос.ОстатокСклад) КАК ОстатокСкладЕГАИС,
//		|	СУММА(ВложенныйЗапрос.ОстатокТорговыйЗал) КАК ОстатокТорговыйЗалЕГАИС
//		|ПОМЕСТИТЬ ОстаткиЕГАИС
//		|ИЗ
//		|	(ВЫБРАТЬ
//		|		ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
//		|		СУММА(ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Количество) КАК ОстатокСклад,
//		|		0 КАК ОстатокТорговыйЗал
//		|	ИЗ
//		|		Документ.ОстаткиЕГАИС.ОстаткиПоДаннымЕГАИС КАК ОстаткиЕГАИСОстаткиПоДаннымЕГАИС
//		|	ГДЕ
//		|		ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка = &ОстаткиНаСкладе
//		|		И ВЫБОР
//		|				КОГДА НЕ ЕСТЬNULL(ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция.ВидПродукции.Маркируемый, ЛОЖЬ)
//		|					ТОГДА &КорректироватьОстаткиНемаркируемойПродукции
//		|				ИНАЧЕ ИСТИНА
//		|			КОНЕЦ
//		|	
//		|	СГРУППИРОВАТЬ ПО
//		|		ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция
//		|	
//		|	ОБЪЕДИНИТЬ ВСЕ
//		|	
//		|	ВЫБРАТЬ
//		|		ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция,
//		|		0,
//		|		СУММА(ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Количество)
//		|	ИЗ
//		|		Документ.ОстаткиЕГАИС.ОстаткиПоДаннымЕГАИС КАК ОстаткиЕГАИСОстаткиПоДаннымЕГАИС
//		|	ГДЕ
//		|		ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка = &ОстаткиВТорговомЗале
//		|		И ВЫБОР
//		|				КОГДА НЕ ЕСТЬNULL(ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция.ВидПродукции.Маркируемый, ЛОЖЬ)
//		|					ТОГДА &КорректироватьОстаткиНемаркируемойПродукции
//		|				ИНАЧЕ ИСТИНА
//		|			КОНЕЦ
//		|	
//		|	СГРУППИРОВАТЬ ПО
//		|		ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция) КАК ВложенныйЗапрос
//		|ГДЕ
//		|	ВложенныйЗапрос.ОстатокСклад + ВложенныйЗапрос.ОстатокТорговыйЗал > 0
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ВложенныйЗапрос.АлкогольнаяПродукция
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
//		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
//		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ) КАК ПродаетсяВРозлив,
//		|	ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ КАК ОбъемДАЛ,
//		|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)) КАК АлкогольнаяПродукция,
//		|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) КАК ТипПродукции,
//		|	ВЫБОР
//		|		КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток * ВЫБОР
//		|				КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ)
//		|					ТОГДА ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ
//		|				ИНАЧЕ 1
//		|			КОНЕЦ < 0
//		|			ТОГДА 0
//		|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток * ВЫБОР
//		|				КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ)
//		|					ТОГДА ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ
//		|				ИНАЧЕ 1
//		|			КОНЕЦ
//		|	КОНЕЦ КАК ОстатокТорговыйЗал,
//		|	ВЫБОР
//		|		КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток < 0
//		|			ТОГДА 0
//		|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
//		|	КОНЕЦ КАК ОстатокТорговыйЗалБазЕд,
//		|	0 КАК ОстатокСклад,
//		|	0 КАК ОстатокСкладБазЕд,
//		|	ЕСТЬNULL(ОстаткиЕГАИС.ОстатокТорговыйЗалЕГАИС + ОстаткиЕГАИС.ОстатокСкладЕГАИС, 0) КАК ОстатокЕГАИС
//		|ИЗ
//		|	РегистрНакопления.ТоварыНаСкладах.Остатки(
//		|			,
//		|			Склад.Магазин = &Магазин
//		|				И Номенклатура.АлкогольнаяПродукция
//		|				И ВЫБОР
//		|					КОГДА НЕ ЕСТЬNULL(Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ)
//		|						ТОГДА &КорректироватьОстаткиНемаркируемойПродукции
//		|					ИНАЧЕ ИСТИНА
//		|				КОНЕЦ) КАК ТоварыНаСкладахОстатки
//		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
//		|			ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиЕГАИС КАК ОстаткиЕГАИС
//		|			ПО СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция = ОстаткиЕГАИС.АлкогольнаяПродукция
//		|				И (ЕСТЬNULL(ОстаткиЕГАИС.ОстатокТорговыйЗалЕГАИС + ОстаткиЕГАИС.ОстатокСкладЕГАИС, 0) > 0)
//		|		ПО ТоварыНаСкладахОстатки.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
//		|			И ТоварыНаСкладахОстатки.Характеристика = СоответствиеНоменклатурыЕГАИС.Характеристика
//		|			И (ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения = СоответствиеНоменклатурыЕГАИС.Упаковка.ЕдиницаИзмерения
//		|				ИЛИ СоответствиеНоменклатурыЕГАИС.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка))
//		|
//		|СГРУППИРОВАТЬ ПО
//		|	ТоварыНаСкладахОстатки.Номенклатура,
//		|	ТоварыНаСкладахОстатки.Характеристика,
//		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ),
//		|	ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ,
//		|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)),
//		|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)),
//		|	ЕСТЬNULL(ОстаткиЕГАИС.ОстатокТорговыйЗалЕГАИС + ОстаткиЕГАИС.ОстатокСкладЕГАИС, 0),
//		|	ВЫБОР
//		|		КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток * ВЫБОР
//		|				КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ)
//		|					ТОГДА ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ
//		|				ИНАЧЕ 1
//		|			КОНЕЦ < 0
//		|			ТОГДА 0
//		|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток * ВЫБОР
//		|				КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ)
//		|					ТОГДА ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ
//		|				ИНАЧЕ 1
//		|			КОНЕЦ
//		|	КОНЕЦ,
//		|	ВЫБОР
//		|		КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток < 0
//		|			ТОГДА 0
//		|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
//		|	КОНЕЦ
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	Номенклатура,
//		|	ОстатокЕГАИС УБЫВ
//		|ИТОГИ
//		|	СРЕДНЕЕ(ОстатокТорговыйЗал),
//		|	СРЕДНЕЕ(ОстатокТорговыйЗалБазЕд),
//		|	СУММА(ОстатокЕГАИС)
//		|ПО
//		|	Номенклатура
//		|АВТОУПОРЯДОЧИВАНИЕ";

//		
//		
//		
//		
//		
//		
//		
//		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ВложенныйЗапрос.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|	СУММА(ВложенныйЗапрос.ОстатокСклад) КАК ОстатокСкладЕГАИС,
		|	СУММА(ВложенныйЗапрос.ОстатокТорговыйЗал) КАК ОстатокТорговыйЗалЕГАИС
		|ПОМЕСТИТЬ ОстаткиЕГАИС
		|ИЗ
		|	(ВЫБРАТЬ
		|		ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
		|		СУММА(ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Количество) КАК ОстатокСклад,
		|		0 КАК ОстатокТорговыйЗал
		|	ИЗ
		|		Документ.ОстаткиЕГАИС.ОстаткиПоДаннымЕГАИС КАК ОстаткиЕГАИСОстаткиПоДаннымЕГАИС
		|	ГДЕ
		|		ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка = &ОстаткиНаСкладе
		|		И ВЫБОР
		|				КОГДА НЕ ЕСТЬNULL(ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция.ВидПродукции.Маркируемый, ЛОЖЬ)
		|					ТОГДА &КорректироватьОстаткиНемаркируемойПродукции
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция,
		|		0,
		|		СУММА(ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Количество)
		|	ИЗ
		|		Документ.ОстаткиЕГАИС.ОстаткиПоДаннымЕГАИС КАК ОстаткиЕГАИСОстаткиПоДаннымЕГАИС
		|	ГДЕ
		|		ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.Ссылка = &ОстаткиВТорговомЗале
		|		И ВЫБОР
		|				КОГДА НЕ ЕСТЬNULL(ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция.ВидПродукции.Маркируемый, ЛОЖЬ)
		|					ТОГДА &КорректироватьОстаткиНемаркируемойПродукции
		|				ИНАЧЕ ИСТИНА
		|			КОНЕЦ
		|	
		|	СГРУППИРОВАТЬ ПО
		|		ОстаткиЕГАИСОстаткиПоДаннымЕГАИС.АлкогольнаяПродукция) КАК ВложенныйЗапрос
		|ГДЕ
		|	ВложенныйЗапрос.ОстатокСклад + ВложенныйЗапрос.ОстатокТорговыйЗал > 0
		|
		|СГРУППИРОВАТЬ ПО
		|	ВложенныйЗапрос.АлкогольнаяПродукция
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ) КАК ПродаетсяВРозлив,
		|	ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ КАК ОбъемДАЛ,
		|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)) КАК АлкогольнаяПродукция,
		|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)) КАК ТипПродукции,
		|	ВЫБОР
		|		КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток * ВЫБОР
		|				КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ)
		|					ТОГДА ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ
		|				ИНАЧЕ 1
		|			КОНЕЦ < 0
		|			ТОГДА 0
		|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток * ВЫБОР
		|				КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ)
		|					ТОГДА ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ
		|				ИНАЧЕ 1
		|			КОНЕЦ
		|	КОНЕЦ КАК ОстатокТорговыйЗал,
		|	ВЫБОР
		|		КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
		|	КОНЕЦ КАК ОстатокТорговыйЗалБазЕд,
		|	0 КАК ОстатокСклад,
		|	0 КАК ОстатокСкладБазЕд,
		|	ЕСТЬNULL(ОстаткиЕГАИС.ОстатокТорговыйЗалЕГАИС + ОстаткиЕГАИС.ОстатокСкладЕГАИС, 0) КАК ОстатокЕГАИС
		|ИЗ
		|	РегистрНакопления.ТоварыОрганизаций.Остатки(
		|			,
		|			Склад.Магазин = &Магазин
		|				И Организация=&Организация
		|				И Номенклатура.АлкогольнаяПродукция
		|				И ВЫБОР
		|					КОГДА НЕ ЕСТЬNULL(Номенклатура.ВидАлкогольнойПродукцииЕГАИС.Маркируемый, ЛОЖЬ)
		|						ТОГДА &КорректироватьОстаткиНемаркируемойПродукции
		|					ИНАЧЕ ИСТИНА
		|				КОНЕЦ) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
		|			ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиЕГАИС КАК ОстаткиЕГАИС
		|			ПО СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция = ОстаткиЕГАИС.АлкогольнаяПродукция
		|				И (ЕСТЬNULL(ОстаткиЕГАИС.ОстатокТорговыйЗалЕГАИС + ОстаткиЕГАИС.ОстатокСкладЕГАИС, 0) > 0)
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
		|			И ТоварыНаСкладахОстатки.Характеристика = СоответствиеНоменклатурыЕГАИС.Характеристика
		|			И (ТоварыНаСкладахОстатки.Номенклатура.ЕдиницаИзмерения = СоответствиеНоменклатурыЕГАИС.Упаковка.ЕдиницаИзмерения
		|				ИЛИ СоответствиеНоменклатурыЕГАИС.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка))
		|
		|СГРУППИРОВАТЬ ПО
		|	ТоварыНаСкладахОстатки.Номенклатура,
		|	ТоварыНаСкладахОстатки.Характеристика,
		|	ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ),
		|	ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ,
		|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция, ЗНАЧЕНИЕ(Справочник.КлассификаторАлкогольнойПродукцииЕГАИС.ПустаяСсылка)),
		|	ЕСТЬNULL(СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция.ТипПродукции, ЗНАЧЕНИЕ(Перечисление.ТипыПродукцииЕГАИС.ПустаяСсылка)),
		|	ЕСТЬNULL(ОстаткиЕГАИС.ОстатокТорговыйЗалЕГАИС + ОстаткиЕГАИС.ОстатокСкладЕГАИС, 0),
		|	ВЫБОР
		|		КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток * ВЫБОР
		|				КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ)
		|					ТОГДА ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ
		|				ИНАЧЕ 1
		|			КОНЕЦ < 0
		|			ТОГДА 0
		|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток * ВЫБОР
		|				КОГДА ЕСТЬNULL(ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры.ПродаетсяВРозлив, ЛОЖЬ)
		|					ТОГДА ТоварыНаСкладахОстатки.Номенклатура.ОбъемДАЛ
		|				ИНАЧЕ 1
		|			КОНЕЦ
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА ТоварыНаСкладахОстатки.КоличествоОстаток < 0
		|			ТОГДА 0
		|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
		|	КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	ОстатокЕГАИС УБЫВ
		|ИТОГИ
		|	СРЕДНЕЕ(ОстатокТорговыйЗал),
		|	СРЕДНЕЕ(ОстатокТорговыйЗалБазЕд),
		|	СУММА(ОстатокЕГАИС)
		|ПО
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";


		
	Номка=Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);	
	Пока Номка.Следующий() Цикл
		Алкашка=Номка.Выбрать();
		Если Номка.ОстатокТорговыйЗалБазЕд>Номка.ОстатокЕГАИС тогда
			ОстатокТорговыйЗал=Номка.ОстатокТорговыйЗалБазЕд-Номка.ОстатокЕГАИС;
			Пока Алкашка.Следующий()Цикл
				стр=УчетныеОстатки.Добавить();
				ЗаполнитьЗначенияСвойств(стр,Алкашка);
				стр.ОстатокТорговыйЗал=Алкашка.ОстатокЕГАИС;
				стр.ОстатокТорговыйЗалБазЕд=Алкашка.ОстатокЕГАИС;
			КонецЦикла;
			стр.ОстатокТорговыйЗал=стр.ОстатокТорговыйЗал+ОстатокТорговыйЗал;
			стр.ОстатокТорговыйЗалБазЕд=стр.ОстатокТорговыйЗалБазЕд+ОстатокТорговыйЗал;
		Иначе
			ОстатокТорговыйЗал=Номка.ОстатокТорговыйЗалБазЕд;
			Пока Алкашка.Следующий()Цикл
				стр=УчетныеОстатки.Добавить();
				ЗаполнитьЗначенияСвойств(стр,Алкашка);
				Если ОстатокТорговыйЗал>Алкашка.ОстатокЕГАИС Тогда
					стр.ОстатокТорговыйЗал=Алкашка.ОстатокЕГАИС;
					стр.ОстатокТорговыйЗалБазЕд=Алкашка.ОстатокЕГАИС;
					ОстатокТорговыйЗал=ОстатокТорговыйЗал-Алкашка.ОстатокЕГАИС;
				Иначе
					стр.ОстатокТорговыйЗал=ОстатокТорговыйЗал;
					стр.ОстатокТорговыйЗалБазЕд=ОстатокТорговыйЗал;
					прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры






&Вместо("СоздатьАктСписанияИзТорговогоЗала")
// Создает акт списания из торгового зала ЕГАИС.
//
Процедура ВместоСоздатьАктСписанияИзТорговогоЗалаКочетов(РезультатЗапроса)
	
	Док = Документы.АктСписанияЕГАИС.СоздатьДокумент();
	Док.Дата = ТекущаяДатаСеанса();
	Док.Заполнить(ЭтотОбъект);
	
	Док.ВидДокумента = Перечисления.ВидыДокументовЕГАИС.АктСписанияИзТорговогоЗала;
	Док.ПричинаСписания = Перечисления.ПричиныСписанийЕГАИС.пересортица;
	
	Док.ОрганизацияЕГАИС = ОрганизацияЕГАИС;
	Док.Магазин = Магазин;
	Док.Организация = Организация;
	Док.Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Магазин, "СкладПродажи");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Док.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
	КонецЦикла;
	
	ЗаписатьДокументКорректировкиОстатков(Док);
	
КонецПроцедуры


&Вместо("СоздатьАктПостановкиНаБалансВТорговыйЗал")
// Создает акт постановки на баланс в торговый зал ЕГАИС.
//
Процедура ВместоВместоСоздатьАктПостановкиНаБалансВТорговыйЗалКочетов(РезультатЗапроса)
	
	Док = Документы.АктПостановкиНаБалансЕГАИС.СоздатьДокумент();
	Док.Дата = ТекущаяДатаСеанса();
	Док.Заполнить(ЭтотОбъект);
	
	Док.ВидДокумента = Перечисления.ВидыДокументовЕГАИС.АктПостановкиНаБалансВТорговомЗале;
	Док.ПричинаПостановкиНаБаланс = Перечисления.ПричиныПостановкиНаБалансЕГАИС.Пересортица;
	
	Док.ОрганизацияЕГАИС = ОрганизацияЕГАИС;
	Док.Магазин = Магазин;
	Док.Организация = Организация;
	Док.Склад = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Магазин, "СкладПродажи");
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СтрокаТЧ = Док.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТЧ, Выборка);
	КонецЦикла;
	
	ЗаписатьДокументКорректировкиОстатков(Док);
	
КонецПроцедуры






















