
Функция сформировать()экспорт
	ТабличныйДокумент.Очистить();
	
	//ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_Печать_Сиграетного_Ценника";
	
	//ЭтотОбъект.Масштаб=ТабличныйДокумент.МасштабПечати;
	Запрос=Новый запрос;
	запрос.УстановитьПараметр("Цена",Справочники.ххх_Справочник.РозничнаяЦена.Значение);
	запрос.УстановитьПараметр("ГруппаСигареты",Справочники.ххх_Справочник.ГруппаСигареты.Значение);
	запрос.УстановитьПараметр("ГруппаСигаретыБлоки",Справочники.ххх_Справочник.ГруппаСигаретыБлоки.Значение);
	Если Блоки Тогда
		Запрос.Текст="ВЫБРАТЬ
		             |	ТоварыНаСкладахОстатки.Номенклатура.ххх_НаименованиеЦенник КАК НаименованиеЦенник,
		             |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		             |ИЗ
		             |	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура В ИЕРАРХИИ (&ГруппаСигаретыБлоки)) КАК ТоварыНаСкладахОстатки
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		             |				,
		             |				ВидЦены = &Цена
		             |					И Номенклатура В ИЕРАРХИИ (&ГруппаСигаретыБлоки)) КАК ЦеныНоменклатурыСрезПоследних
		             |		ПО ТоварыНаСкладахОстатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		             |ГДЕ
		             |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	НаименованиеЦенник";
		Макет=ЭтотОбъект.ПолучитьМакет("МакетБлоки");

	иначе
		мас=Новый массив;
		мас.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("ххх_ИдЦентр","4898"));
		мас.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("ххх_ИдЦентр","5902"));
		мас.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("ххх_ИдЦентр","90"));
		мас.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("ххх_ИдЦентр","2200"));
		мас.Добавить(Справочники.Номенклатура.НайтиПоРеквизиту("ххх_ИдЦентр","6055"));
		мас.Добавить(Справочники.ххх_Справочник.ГруппаСигаретыБлоки.Значение);

		запрос.УстановитьПараметр("ИсключенныеПапки",мас);
		Запрос.Текст="ВЫБРАТЬ
		             |	ТоварыНаСкладахОстатки.Номенклатура.ххх_НаименованиеЦенник КАК НаименованиеЦенник,
		             |	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
		             |ИЗ
		             |	РегистрНакопления.ТоварыНаСкладах.Остатки(
		             |			,
		             |			Номенклатура В ИЕРАРХИИ (&ГруппаСигареты)
		             |				И НЕ Номенклатура В ИЕРАРХИИ (&ИсключенныеПапки)) КАК ТоварыНаСкладахОстатки
		             |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
		             |				,
		             |				ВидЦены = &Цена
		             |					И Номенклатура В ИЕРАРХИИ (&ГруппаСигареты)
		             |					И НЕ Номенклатура В ИЕРАРХИИ (&ИсключенныеПапки)) КАК ЦеныНоменклатурыСрезПоследних
		             |		ПО ТоварыНаСкладахОстатки.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
		             |ГДЕ
		             |	ТоварыНаСкладахОстатки.КоличествоОстаток > 0
		             |
		             |УПОРЯДОЧИТЬ ПО
		             |	НаименованиеЦенник";
		Макет=ЭтотОбъект.ПолучитьМакет("МакетСигареты");
	КонецЕсли;
	//Выгрузка=запрос.Выполнить().Выгрузить();
	Выборка=Запрос.Выполнить().Выбрать();
	//Для каждого стр из Выгрузка Цикл
	//	стр.НастройкиКомпоновкиДанных=ххх_Сервер.ОписаниеПараметровНастройки(стр.скд, стр.НастройкиКомпоновкиДанных);
	//КонецЦикла
	
	
	Шапка=макет.ПолучитьОбласть("Шапка");
	Шапка.параметры.дата=текущаяДата();
	Шапка.параметры.Организация=Организация;
	ТабличныйДокумент.Вывести(Шапка);

	ШапкаТаблицы=макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ШапкаТаблицы);

	й=1;;
	
	Пока Выборка.Следующий() Цикл
		
		
		
		Строка=макет.ПолучитьОбласть("Строка");
		Строка.параметры.Номер=й;
		Строка.параметры.Наименование=Выборка.НаименованиеЦенник;
		Строка.параметры.Цена=Выборка.Цена;
		
		Если не ТабличныйДокумент.ПроверитьВывод(Строка) ТОгда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			ТабличныйДокумент.Вывести(Шапка);
		КонецЕСли;
		
		ТабличныйДокумент.Вывести(Строка);
		
		й=й+1;
	КонецЦикла;
	
	
	//возврат ТабличныйДокумент;
КонецФункции
	





















