#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Ключ", 				ВыбраннаяСтрока);
	ПараметрыФормы.Вставить("ВводСНООрганизации", 	Истина);
	
	// &ЗамерПроизводительности 	
        ОценкаПроизводительностиРТКлиент.НачатьЗамер(
                 Истина, "РегистрСведений.ПрименениеСистемНалогообложения.ФормаЗаписи");		

	ОткрытьФорму("РегистрСведений.ПрименениеСистемНалогообложения.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ТекущаяСтрока 	= Элемент.ТекущиеДанные;	
	
	ПараметрыФормы 	= Новый Структура;
	ПараметрыФормы.Вставить("ВводСНООрганизации", 	Истина);
	ПараметрыФормы.Вставить("Организация", 			ТекущаяСтрока.Организация);
	
	Если Копирование Тогда
		ПараметрыФормы.Вставить("СистемаНалогообложения", ТекущаяСтрока.СистемаНалогообложения);		
	КонецЕсли;	
	
	// &ЗамерПроизводительности 	
        ОценкаПроизводительностиРТКлиент.НачатьЗамер(
                 Истина, "РегистрСведений.ПрименениеСистемНалогообложения.ФормаЗаписи");		

	ОткрытьФорму("РегистрСведений.ПрименениеСистемНалогообложения.ФормаЗаписи", ПараметрыФормы, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	
	ТекущаяСтрока = Элемент.ТекущиеДанные;
	
	РазрешеноУдалять = РазрешеноУдалятьЗапись(ТекущаяСтрока.Период, ТекущаяСтрока.Организация);
	
	Если НЕ РазрешеноУдалять Тогда	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				НСтр("ru = 'Невозможно удалить запись. Должна быть хотя бы одна запись.'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция РазрешеноУдалятьЗапись(Период, Организация)
		
	Возврат РегистрыСведений.ПрименениеСистемНалогообложения.РазрешеноУдалятьЗапись(Период, Организация);
		
КонецФункции

#КонецОбласти