
&После("ПередЗаписью")
Процедура КочетовПередЗаписью(Отказ)
	//Если не РольДоступна("ПолныеПрава") и РольДоступна("ххх_ПользовательИнтернетМагазина") И Родитель<>Справочники.ххх_Справочник.КонтрагентыПапкаИнтерентПокупатели.Значение Тогда
	//	Сообщить("У вас нет прав на создание контрагентов в папке: "+Родитель.наименование);
	//	Отказ=истина;
	//КонецЕсли;
КонецПроцедуры

&После("ПриЗаписи")
Процедура КочетовПриЗаписи(Отказ)
	
	Если отказ тогда
		возврат;
	КонецЕсли;
	
	
	
	
КонецПроцедуры
