#Область ПрограмныйИнтерфейс

#Область СерииНоменклатуры

// Добавляет специфичные параметры указания серий для товаров, указанных в форме.
//
// Параметры:
//	Форма - УправляемаяФорма - форма с товарами, для которой необходимо определить параметры указания серий.
//	ПараметрыУказанияСерий - Структура - дополняемые параметры указания серий.
//
Процедура ДополнитьПараметрыУказанияСерий(Форма, ПараметрыУказанияСерий) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

Процедура ПередОткрытиемФормыПроверкиПодбора(Форма, ПараметрыОткрытияФормыПроверки, ПараметрыФормыПроверки, Отказ) Экспорт
	
	Если СтрНачинаетсяС(Форма.ИмяФормы, "Обработка.РМКУправляемыйРежим.Форма.Форма") Тогда 
		ПараметрыФормыПроверки.Склад = Форма.Элементы.Товары.ТекущиеДанные.Склад;
		ПараметрыФормыПроверки.Организация = Форма.Элементы.Товары.ТекущиеДанные.Организация;
	ИначеЕсли СтрНачинаетсяС(Форма.ИмяФормы, "Документ.ЧекККМ.Форма.ФормаДокумента") Тогда 
		ПараметрыФормыПроверки.Склад = Форма.Элементы.Товары.ТекущиеДанные.Склад;
		ПараметрыФормыПроверки.Организация = Форма.Объект.Организация;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
