
&НаКлиенте
Процедура Кочетовххх_ЗаполнитьПоЗакупочнымЦенамВместо(Команда)
	
	
	ххх_ЗаполнитьПоЗакупочнымЦенамВместо()	
		
		
КонецПроцедуры


Процедура ххх_ЗаполнитьПоЗакупочнымЦенамВместо()

	ЗапасыСервер.ЗаполнитьЦеныВыделенныхСтрокПоВидуЦенПересортица(Объект, "Товары", 
		Элементы.Товары.ВыделенныеСтроки,
		Справочники.ххх_Справочник.ЗакупочнаяЦена.значение, ЗапасыСервер.ДатаДляЦенообразованияДляДокумента(Объект));
		
	Для каждого стр из Объект.Товары  Цикл
			
			
		стр.ххх_СуммаСписания=стр.цена*стр.Количество;
		стр.ххх_СуммаОприходывания=стр.Количество*стр.ЦенаОприходование;
		стр.ххх_ДельтаСписаниеОприходывание=стр.ххх_СуммаСписания-стр.ххх_СуммаОприходывания;
		
			
	КонецЦикла;
	
	

КонецПроцедуры	

&НаКлиенте
Процедура КочетовТоварыКоличествоПриИзмененииПосле(Элемент)
	Элементы.Товары.ТекущиеДанные.ххх_СуммаСписания=Элементы.Товары.ТекущиеДанные.цена*Элементы.Товары.ТекущиеДанные.Количество;
	Элементы.Товары.ТекущиеДанные.ххх_СуммаОприходывания=Элементы.Товары.ТекущиеДанные.Количество*Элементы.Товары.ТекущиеДанные.ЦенаОприходование;
	Элементы.Товары.ТекущиеДанные.ххх_ДельтаСписаниеОприходывание=Элементы.Товары.ТекущиеДанные.ххх_СуммаСписания-Элементы.Товары.ТекущиеДанные.ххх_СуммаОприходывания;
КонецПроцедуры
