#Если сервер тогда
&После("ДобавитьКомандыПечати")
Процедура КочетовДобавитьКомандыПечати(КомандыПечати)
	// СписокНоменклатуры
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СписокНоменклатуры";
	КомандаПечати.Представление = НСтр("ru = 'Список номенклатуры (Не товаросопроводительный документ)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = ложь;

КонецПроцедуры

&После("Печать")
Процедура КочетовПечать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода)
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СписокНоменклатуры") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "СписокНоменклатуры",
			НСтр("ru = 'Список номенклатуры (Не товаросопроводительный документ)'"),
			ПечатьСписокНоменклатуры(МассивОбъектов, ОбъектыПечати));
		
	КонецЕсли;
КонецПроцедуры


Функция ПечатьСписокНоменклатуры(МассивОбъектов, ОбъектыПечати)
	
	
	ТабличныйДокумент  = Новый ТабличныйДокумент;
	
	Для каждого Объект из МассивОбъектов Цикл
		ххх_ФункцииПечати.ПечатьСписокНоменклатуры(ТабличныйДокумент,Объект);	
	КонецЦикла;
		
	Возврат ТабличныйДокумент;
	
КонецФункции




#КонецЕсли

















