
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)	
	Если ТипЗнч(ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент	)=Тип("ТаблицаФормы") 
			и ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент.ТекущийЭлемент.Имя="ДеревоЦенНоменклатура" Тогда
		Если ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент.ТекущиеДанные<>Неопределено тогда
			Форма=ПараметрыВыполненияКоманды.Источник.ТекущийЭлемент.ТекущиеДанные.Номенклатура.ПолучитьФорму("ФормаЭлемента");
		КонецЕсли;	
		Форма.Открыть();
	КонецЕсли;	
КонецПроцедуры
