#Область ПрограммныйИнтерфейс

// Получает данные для печати и открывает форму обработки печати этикеток и ценников.
//
// Параметры:
//   ОбъектыПечати        - Структура        - структура с описанием штрихкода.
//   Форма                - УправляемаяФорма - форма-владелец из которой выполняется печать
//   СтандартнаяОбработка - Булево           - признак что требуется печатать из вызывающей функции
//
Процедура ПечатьШтрихкодовУпаковок(ОбъектыПечати, Форма, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.ШтрихкодыУпаковокТоваров.ПустаяСсылка"));
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
		"Обработка.ГенерацияШтрихкодовУпаковок",
		"ШтрихкодыУпаковокТоваров",
		ПараметрКоманды,
		Форма,
		ПолучитьПараметрыДляШтрихкодовУпаковок(ОбъектыПечати, Форма));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПараметрыДляШтрихкодовУпаковок(ОбъектыПечати, Форма)
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("АдресВХранилище"       , ПоместитьВоВременноеХранилище(ОбъектыПечати, Форма.УникальныйИдентификатор));
	ПараметрыПечати.Вставить("КоличествоЭкземпляров" , 1);
	
	Возврат ПараметрыПечати;
	
КонецФункции

#КонецОбласти
