
&НаСервере
&Вместо("КОбъектуМожноПрисоединятьФайлы")
Функция КочетовКОбъектуМожноПрисоединятьФайлы(СсылкаНаОбъект)
	
	//МожноПрисоединять = Неопределено;
	//
	//Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.РаботаСФайлами") Тогда
	//	МодульРаботаСФайлами = ОбщегоНазначения.ОбщийМодуль("ПрисоединенныеФайлы");
	//	МожноПрисоединять = РаботаСФайлами.КОбъектуМожноПрисоединятьФайлы(СсылкаНаОбъект);
	//КонецЕсли;
	//
	//Если МожноПрисоединять = Неопределено Тогда
	//	МожноПрисоединять = Ложь;
	//КонецЕсли;
	
	Возврат ложь;

КонецФункции
