
&Вместо("ЭтоШтрихкодАкцизнойМарки")
Функция КочетовЭтоШтрихкодАкцизнойМарки(Штрихкод, ТипШтрихкода)
	
	ВидДокумента = Перечисления.ВидыДокументовЕГАИС.ЧекККМ;
	ТипШтрихкодМарки = ФабрикаXDTO.Тип(
		Перечисления.ВидыДокументовЕГАИС.ПространствоИмен(
			ВидДокумента, Перечисления.ФорматыОбменаЕГАИС.ПустаяСсылка()), "BK");
	
	//Попытка
	//	ТипШтрихкодМарки.Проверить(Штрихкод);
	//Исключение
	//	Возврат Ложь;
	//КонецПопытки;
	
	Если СтрДлина(Штрихкод) = 150 Тогда
		ТипШтрихкода = Перечисления.ТипыШтрихкодов.DataMatrix;
	Иначе 
		ТипШтрихкода = Перечисления.ТипыШтрихкодов.PDF417;
	КонецЕсли;
	
	Возврат Истина;

КонецФункции

//"ВЫБРАТЬ
//|	Номенклатура.Ссылка КАК Номенклатура
//|ПОМЕСТИТЬ НомкаНоваяВСегменте
//|ИЗ
//|	Справочник.Номенклатура КАК Номенклатура
//|ГДЕ
//|	Номенклатура.ххх_ИдЦентр В(&мас)
//|	И Номенклатура.ЭтоГруппа = ЛОЖЬ
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	ЕСТЬNULL(НоменклатураСегмента.Номенклатура, НомкаНоваяВСегменте.Номенклатура) КАК Номенклатура,
//|	ВЫБОР
//|		КОГДА НоменклатураСегмента.Номенклатура ЕСТЬ NULL
//|			ТОГДА ""Красный""
//|		ИНАЧЕ ""Белый""
//|	КОНЕЦ КАК ЦветЦенника
//|ПОМЕСТИТЬ СвязкаССегментами
//|ИЗ
//|	НомкаНоваяВСегменте КАК НомкаНоваяВСегменте
//|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрСведений.НоменклатураСегмента КАК НоменклатураСегмента
//|		ПО НомкаНоваяВСегменте.Номенклатура = НоменклатураСегмента.Номенклатура
//|;
//|
//|////////////////////////////////////////////////////////////////////////////////
//|ВЫБРАТЬ
//|	СвязкаССегментами.Номенклатура КАК Номенклатура,
//|	СвязкаССегментами.ЦветЦенника КАК ЦветЦенника
//|ИЗ
//|	СвязкаССегментами КАК СвязкаССегментами
//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ххх_ИстиорияЦветаЦенника.СрезПоследних КАК ххх_ИстиорияЦветаЦенникаСрезПоследних
//|		ПО СвязкаССегментами.Номенклатура = ххх_ИстиорияЦветаЦенникаСрезПоследних.Номенклатура
//|			И СвязкаССегментами.ЦветЦенника <> ххх_ИстиорияЦветаЦенникаСрезПоследних.ЦветЦенника"