#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	
	ОрганизацияЕГАИС = "";
	Параметры.Свойство("ОрганизацияЕГАИС", ОрганизацияЕГАИС);
	Список.Параметры.УстановитьЗначениеПараметра("ОрганизацияЕГАИС", 
												  ОрганизацияЕГАИС);
	Список.Параметры.УстановитьЗначениеПараметра("ПроверкаОрганизацииЕГАИС", 
												  ЗначениеЗаполнено(ОрганизацияЕГАИС));
	
	Организация = "";
	Параметры.Свойство("Организация", Организация);
	Список.Параметры.УстановитьЗначениеПараметра("Организация", 
												  Организация);
	Список.Параметры.УстановитьЗначениеПараметра("ПроверкаОрганизации", 
												  ЗначениеЗаполнено(Организация));
	
	Магазин = "";
	Параметры.Свойство("Магазин", Магазин);
	Список.Параметры.УстановитьЗначениеПараметра("Магазин", 
												  Магазин);
	Список.Параметры.УстановитьЗначениеПараметра("ПроверкаМагазина", 
												  ЗначениеЗаполнено(Магазин));
	
	ПроверкаПоступления = Параметры.Свойство("ПроверитьПоступление");
	Список.Параметры.УстановитьЗначениеПараметра("ПроверкаПоступления", 
												  ПроверкаПоступления);

КонецПроцедуры

#КонецОбласти
