
////////////////////////////////////////////////////////////////////////////////
// Общий модуль ОбменСКонтрагентамиВызовСервераРТ
//
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// См. ОбменСКонтрагентамиРТ.СоздатьНоменклатуруПоДаннымКонтрагента.
Функция СоздатьНоменклатуруПоДаннымКонтрагента(Знач НаборНоменклатурыКонтрагентов, Знач ЗначенияПоУмолчанию) Экспорт
	
	СозданнаяНоменклатура = ОбменСКонтрагентамиРТ.СоздатьНоменклатуруПоДаннымКонтрагента(
		НаборНоменклатурыКонтрагентов, ЗначенияПоУмолчанию);
	
	Возврат СозданнаяНоменклатура;
	
КонецФункции

#КонецОбласти