#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ПрограммныйИнтерфейс
	
	// Получение данных для формирования электронного документа.
	//
	// Параметры:
	//  СсылкаНаОбъект - ДокументСсылка.РеализацияТоваровУслуг - ссылка на документ.
	// 
	// Возвращаемое значение:
	//  Структура - структура данных для печати.
	//
	Функция ПолучитьДанныеДляЭД(СсылкаНаОбъект) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.Ссылка.Контрагент КАК Владелец,
		|	Товары.ИдентификаторНоменклатурыПоставщика КАК Идентификатор,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.Характеристика КАК Характеристика,
		|	Товары.Упаковка КАК Упаковка
		|ИЗ
		|	Документ.ОтчетКомитентуОСписании.Товары КАК Товары
		|ГДЕ
		|	Товары.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		ТаблицаОтбора = Запрос.Выполнить().Выгрузить();
		
		МенеджерТаблиц = Новый МенеджерВременныхТаблиц;
		ОбменСКонтрагентами.СоздатьВременнуюТаблицуСоответствияНоменклатуры(ТаблицаОтбора, "втНоменклатураКонтрагента", МенеджерТаблиц);
		
		Запрос = Новый Запрос;
		Запрос.МенеджерВременныхТаблиц = МенеджерТаблиц;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	ЕСТЬNULL(втНоменклатураКонтрагента.Артикул, Товары.Номенклатура.Артикул) КАК Артикул,
		|	ЕСТЬNULL(втНоменклатураКонтрагента.Наименование, Товары.Номенклатура.Наименование) КАК Наименование,
		|	Товары.Номенклатура КАК Номенклатура,
		|	Товары.ДатаРеализации КАК ДатаПродажи,
		|	Товары.Номенклатура.ЕдиницаИзмерения КАК БазоваяЕдиницаСсылка,
		|	Товары.Номенклатура.ЕдиницаИзмерения КАК БазоваяЕдиница,
		|	Товары.Номенклатура.ЕдиницаИзмерения.Код КАК БазоваяЕдиницаКод,
		|	Товары.Номенклатура.ЕдиницаИзмерения.Наименование КАК БазоваяЕдиницаНаименование,
		|	Товары.Номенклатура.ЕдиницаИзмерения.НаименованиеПолное КАК БазоваяЕдиницаНаименованиеПолное,
		|	Товары.Номенклатура.ЕдиницаИзмерения.МеждународноеСокращение КАК БазоваяЕдиницаМеждународноеСокращение,
		|	ЕСТЬNULL(втНоменклатураКонтрагента.ЕдиницаИзмерения, ВЫБОР
		|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|				ТОГДА Товары.Номенклатура.ЕдиницаИзмерения
		|			ИНАЧЕ Товары.Упаковка
		|		КОНЕЦ) КАК ЕдиницаИзмерения,
		|	ЕСТЬNULL(втНоменклатураКонтрагента.ЕдиницаИзмеренияКод, ВЫБОР
		|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|				ТОГДА Товары.Номенклатура.ЕдиницаИзмерения.Код
		|			ИНАЧЕ ""0000""
		|		КОНЕЦ) КАК ЕдиницаИзмеренияКод,
		|	ЕСТЬNULL(втНоменклатураКонтрагента.ЕдиницаИзмеренияКод, ВЫБОР
		|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|				ТОГДА Товары.Номенклатура.ЕдиницаИзмерения.Код
		|			ИНАЧЕ ""0000""
		|		КОНЕЦ) КАК ЕдиницаИзмеренияКодПоОКЕИ,
		|	1 КАК ЕдиницаИзмеренияКоэффициент,
		|	ЕСТЬNULL(втНоменклатураКонтрагента.НаименованиеХарактеристики, Товары.Характеристика) КАК Характеристика,
		|	Товары.КоличествоУпаковок КАК Количество,
		|	Товары.Цена КАК Цена,
		|	Товары.Сумма КАК Сумма,
		|	Товары.СтавкаНДС КАК СтавкаНДС,
		|	Товары.Ссылка.ЦенаВключаетНДС КАК НДСУчтеноВСумме,
		|	Товары.СуммаНДС КАК СуммаНДС,
		|	ВЫБОР
		|		КОГДА Товары.Ссылка.ЦенаВключаетНДС
		|			ТОГДА Товары.Сумма
		|		ИНАЧЕ Товары.Сумма + Товары.СуммаНДС
		|	КОНЕЦ КАК СуммаСНДС,
		|	ВЫБОР
		|		КОГДА втНоменклатураКонтрагента.Идентификатор ЕСТЬ NULL
		|			ТОГДА Товары.Номенклатура
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	КОНЕЦ КАК НоменклатураИБ,
		|	ВЫБОР
		|		КОГДА втНоменклатураКонтрагента.Идентификатор ЕСТЬ NULL
		|			ТОГДА Товары.Характеристика
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ КАК ХарактеристикаИБ,
		|	ВЫБОР
		|		КОГДА втНоменклатураКонтрагента.Идентификатор ЕСТЬ NULL
		|			ТОГДА Товары.Упаковка
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ КАК УпаковкаИБ,
		|	ЕСТЬNULL(втНоменклатураКонтрагента.Идентификатор, """") КАК ИдентификаторНоменклатурыПоставщика
		|ИЗ
		|	Документ.ОтчетКомитентуОСписании.Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ втНоменклатураКонтрагента КАК втНоменклатураКонтрагента
		|		ПО Товары.Номенклатура = втНоменклатураКонтрагента.Номенклатура
		|			И Товары.Характеристика = втНоменклатураКонтрагента.Характеристика
		|			И Товары.Упаковка = втНоменклатураКонтрагента.Упаковка
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|	И Товары.ИдентификаторНоменклатурыПоставщика = """"
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Товары.НомерСтроки,
		|	ЕСТЬNULL(втНоменклатураКонтрагента.Артикул, Товары.Номенклатура.Артикул),
		|	ЕСТЬNULL(втНоменклатураКонтрагента.Наименование, Товары.Номенклатура.Наименование),
		|	Товары.Номенклатура,
		|	Товары.ДатаРеализации,
		|	Товары.Номенклатура.ЕдиницаИзмерения,
		|	Товары.Номенклатура.ЕдиницаИзмерения,
		|	Товары.Номенклатура.ЕдиницаИзмерения.Код,
		|	Товары.Номенклатура.ЕдиницаИзмерения.Наименование,
		|	Товары.Номенклатура.ЕдиницаИзмерения.НаименованиеПолное,
		|	Товары.Номенклатура.ЕдиницаИзмерения.МеждународноеСокращение,
		|	ЕСТЬNULL(втНоменклатураКонтрагента.ЕдиницаИзмерения, ВЫБОР
		|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|				ТОГДА Товары.Номенклатура.ЕдиницаИзмерения
		|			ИНАЧЕ Товары.Упаковка
		|		КОНЕЦ),
		|	ЕСТЬNULL(втНоменклатураКонтрагента.ЕдиницаИзмеренияКод, ВЫБОР
		|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|				ТОГДА Товары.Номенклатура.ЕдиницаИзмерения.Код
		|			ИНАЧЕ ""0000""
		|		КОНЕЦ),
		|	ЕСТЬNULL(втНоменклатураКонтрагента.ЕдиницаИзмеренияКод, ВЫБОР
		|			КОГДА Товары.Упаковка = ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|				ТОГДА Товары.Номенклатура.ЕдиницаИзмерения.Код
		|			ИНАЧЕ ""0000""
		|		КОНЕЦ),
		|	1,
		|	ЕСТЬNULL(втНоменклатураКонтрагента.НаименованиеХарактеристики, Товары.Характеристика),
		|	Товары.КоличествоУпаковок,
		|	Товары.Цена,
		|	Товары.Сумма,
		|	Товары.СтавкаНДС,
		|	Товары.Ссылка.ЦенаВключаетНДС,
		|	Товары.СуммаНДС,
		|	ВЫБОР
		|		КОГДА Товары.Ссылка.ЦенаВключаетНДС
		|			ТОГДА Товары.Сумма
		|		ИНАЧЕ Товары.Сумма + Товары.СуммаНДС
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА втНоменклатураКонтрагента.Идентификатор ЕСТЬ NULL
		|			ТОГДА Товары.Номенклатура
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА втНоменклатураКонтрагента.Идентификатор ЕСТЬ NULL
		|			ТОГДА Товары.Характеристика
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ,
		|	ВЫБОР
		|		КОГДА втНоменклатураКонтрагента.Идентификатор ЕСТЬ NULL
		|			ТОГДА Товары.Упаковка
		|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.УпаковкиНоменклатуры.ПустаяСсылка)
		|	КОНЕЦ,
		|	Товары.ИдентификаторНоменклатурыПоставщика
		|ИЗ
		|	Документ.ОтчетКомитентуОСписании.Товары КАК Товары
		|		ЛЕВОЕ СОЕДИНЕНИЕ втНоменклатураКонтрагента КАК втНоменклатураКонтрагента
		|		ПО Товары.ИдентификаторНоменклатурыПоставщика = втНоменклатураКонтрагента.Идентификатор
		|ГДЕ
		|	Товары.Ссылка = &Ссылка
		|	И Товары.ИдентификаторНоменклатурыПоставщика <> """"
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ОтчетКомитентуОСписании.Номер КАК Номер,
		|	ОтчетКомитентуОСписании.Дата КАК Дата,
		|	ОтчетКомитентуОСписании.Организация КАК Организация,
		|	ОтчетКомитентуОСписании.Контрагент КАК Контрагент,
		|	ОтчетКомитентуОСписании.НачалоПериода КАК НачалоПериода,
		|	ОтчетКомитентуОСписании.КонецПериода КАК КонецПериода,
		|	ОтчетКомитентуОСписании.СуммаДокумента КАК СуммаДокумента,
		|	&ХозОперация КАК ХозОперация,
		|	ОтчетКомитентуОСписании.Комментарий КАК ДополнительнаяИнформация,
		|	ОтчетКомитентуОСписании.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		|	&ВалютаКод КАК ВалютаКод,
		|	&Валюта КАК Валюта,
		|	"""" КАК ДокументОснование
		|ИЗ
		|	Документ.ОтчетКомитентуОСписании КАК ОтчетКомитентуОСписании
		|ГДЕ
		|	ОтчетКомитентуОСписании.Ссылка В(&Ссылка)";
		
		Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
		Запрос.УстановитьПараметр("ХозОперация", НСтр("ru = 'Отчет о списании комиссионного товара'"));
		
		Запрос.УстановитьПараметр("ВалютаКод", НСтр("ru = '643'"));
		Запрос.УстановитьПараметр("Валюта", НСтр("ru = 'руб.'"));
		Запрос.УстановитьПараметр("Доставка", НСтр("ru = 'Доставка'"));
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		РезультатПоТабличнойЧасти = МассивРезультатов[0];
		РезультатПоШапке = МассивРезультатов[1];
		
		СтруктураДанныхДляПечати = Новый Структура("РезультатПоШапке, РезультатПоТабличнойЧасти",
		РезультатПоШапке, РезультатПоТабличнойЧасти);
		
		Возврат СтруктураДанныхДляПечати;
		
	КонецФункции
	// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
	//
	// Параметры:
	//  Настройки - Структура - настройки подсистемы.
	Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт
		
	КонецПроцедуры
	
	// Заполняет список команд печати.
	// 
	// Параметры:
	//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
	//
	Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
		
	КонецПроцедуры
	
	// Сформировать печатные формы объектов.
	//
	// ВХОДЯЩИЕ:
	//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую.
	//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать.
	//   ПараметрыПечати - Структура - Структура дополнительных параметров печати.
	//
	// ИСХОДЯЩИЕ:
	//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы.
	//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
	//
	Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
		
	КонецПроцедуры
	
	// Инициализирует таблицы значений, содержащие данные документа.
	// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
	//
	Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		
		Запрос.Текст ="ВЫБРАТЬ
		| ОтчетКомитентуОСписанииТовары.Ссылка КАК Ссылка,
		| СУММА(ОтчетКомитентуОСписанииТовары.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ТоварыСумма
		|ИЗ
		| Документ.ОтчетКомитентуОСписании.Товары КАК ОтчетКомитентуОСписанииТовары
		|ГДЕ
		| ОтчетКомитентуОСписанииТовары.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		| ОтчетКомитентуОСписанииТовары.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		| ДанныеДокумента.Дата КАК Период,
		| ДанныеДокумента.Ссылка КАК Ссылка,
		| ДанныеДокумента.Организация КАК Организация,
		| ДанныеДокумента.Магазин КАК Магазин,
		| ДанныеДокумента.Контрагент КАК Контрагент,
		| ДанныеДокумента.Договор КАК Договор,
		| ДанныеДокумента.Ссылка КАК Основание,
		| ДанныеДокумента.Магазин.ИспользоватьОрдернуюСхемуПриПоступлении КАК ПоступлениеПоОрдернойСхеме,
		| ДанныеДокумента.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
		| ДанныеДокумента.УчитыватьНДС КАК УчитыватьНДС,
		| ДанныеДокумента.СуммаДокумента КАК СуммаДокумента,
		| НЕ ДанныеДокумента.Магазин.СкладУправляющейСистемы КАК ФормироватьДвижения,
		| ТоварыСумма.Сумма КАК Сумма
		|ИЗ
		| Документ.ОтчетКомитентуОСписании КАК ДанныеДокумента
		|     ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСумма КАК ТоварыСумма
		|     ПО ДанныеДокумента.Ссылка = ТоварыСумма.Ссылка
		|ГДЕ
		| ДанныеДокумента.Ссылка = &Ссылка";
		
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Реквизиты = РезультатЗапроса.Выбрать();
		Реквизиты.Следующий(); 
		
		ОбщегоНазначенияРТ.ПеренестиСтрокуВыборкиВПараметрыЗапроса(РезультатЗапроса, Реквизиты, Запрос);
		
		ИспользоватьРасчетыСКлиентами = ПолучитьФункциональнуюОпцию("ИспользоватьРасчетыСКлиентами");
		Запрос.УстановитьПараметр("ИспользоватьРасчетыСКлиентами", ИспользоватьРасчетыСКлиентами);
		
		// 0 ТаблицаРасчетыСПоставщиками 
		ТекстЗапроса =
		"ВЫБРАТЬ
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Период КАК Период,
		|	&Магазин КАК Магазин,
		|	&Контрагент КАК Поставщик,
		|	&Ссылка КАК ДокументРасчета,
		|	&Сумма КАК Сумма,
		|	&Сумма КАК КОплате,
		|	0 КАК КПоступлению,
		|	ЗНАЧЕНИЕ(Перечисление.ФормыОплаты.ПустаяСсылка) КАК ФормаОплаты,
		|	ЛОЖЬ КАК Взаимозачет
		|ГДЕ
		|	&ФормироватьДвижения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблицаТовары.НомерСтроки              КАК НомерСтроки,
		|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
		|	&Период                                КАК Период,
		|	&Организация                           КАК Организация,
		|	ТаблицаТовары.Склад                    КАК Склад,
		|	&Контрагент                            КАК Поставщик,
		|	&Договор                               КАК Договор,
		|	ТаблицаТовары.Номенклатура             КАК Номенклатура,
		|	ТаблицаТовары.Характеристика           КАК Характеристика,
		|	ТаблицаТовары.НомерГТД                 КАК НомерГТД,
		|	ТаблицаТовары.Сумма                    КАК Сумма,
		|	ТаблицаТовары.Количество               КАК КоличествоСписано
		|ИЗ
		|	Документ.ОтчетКомитентуОСписании.Товары КАК ТаблицаТовары
		|ГДЕ
		|	&ФормироватьДвижения
		|	И ТаблицаТовары.Номенклатура.ТипНоменклатуры <> ЗНАЧЕНИЕ(Перечисление.ТипыНоменклатуры.Услуга)
		|	И ТаблицаТовары.Ссылка = &Ссылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";
		
		Запрос.Текст = ТекстЗапроса;
		Результат    = Запрос.ВыполнитьПакет();
		
		ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;	
		ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПоставщиками"               , Результат[0].Выгрузить());
		ТаблицыДляДвижений.Вставить("ТаблицаТоварыКОформлениюОтчетовКомитенту"  , Результат[1].Выгрузить());
		
	КонецПроцедуры
	
	// СтандартныеПодсистемы.УправлениеДоступом
	
	// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
	Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
		
		Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Магазин)";
		
	КонецПроцедуры
	
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	#КонецОбласти
	
	#Область СлужебныеПроцедурыИФункции
	
	#КонецОбласти
	
#КонецЕсли
