
&НаСервере
Процедура КочетовПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)

	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Предопределенный Тогда
		
		ОбъектЭлемент = РеквизитФормыВЗначение("Объект");
		ПравильнаяХозяйственнаяОперация = ОбъектЭлемент.ПолучитьПравильнуюХозяйственнуюОперацию();
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(ПравильнаяХозяйственнаяОперация);
		
		Если ПравильнаяХозяйственнаяОперация = Объект.ХозяйственнаяОперация Тогда
			
			Элементы.ХозяйственнаяОперация.ТолькоПросмотр = Истина;
			
		Иначе
			
			Объект.ХозяйственнаяОперация = ПравильнаяХозяйственнаяОперация;
			
		КонецЕсли; 
		
	Иначе
		
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратОтПокупателя);
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ВозвратПоставщику);
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.Оприходование);
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ОприходованиеПоИнвентаризации);
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.СписаниеНаЗатраты);
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.СписаниеПоИнвентаризации);
		
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ПоступлениеТоваров);
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.РеализацияТоваров);
		
		Элементы.ХозяйственнаяОперация.СписокВыбора.Добавить(Перечисления.ХозяйственныеОперации.ххх_Своё);

		
	КонецЕсли;
	
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки
КонецПроцедуры
