
&НаСервере
Процедура КочетовПриСозданииНаСервереВместо(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
	РежимОтладки = ОбщегоНазначенияКлиентСервер.РежимОтладки();
	
	Элементы.Код.ТолькоПросмотр                        = Не РежимОтладки;
	Элементы.ТипОрганизации.ТолькоПросмотр             = Не РежимОтладки;
	//Элементы.ТипОрганизации.ТолькоПросмотр           = Не РежимОтладки; //дубль
	Элементы.ИНН.ТолькоПросмотр                        = Не РежимОтладки;
	Элементы.КПП.ТолькоПросмотр                        = Не РежимОтладки;
	//Элементы.НаименованиеПолное.ТолькоПросмотр       = Не РежимОтладки;
	Элементы.ИдентификаторОрганизацииТС.ТолькоПросмотр = Не РежимОтладки;
	Элементы.ФорматОбмена.ТолькоПросмотр               = Не РежимОтладки;
	СобытияФормЕГАИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	//СобытияФормИСПереопределяемый.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка); //ValMa - В новом релизе
	
КонецПроцедуры
