
&НаКлиенте
&Вместо("СписокВыбор")
Процедура КочетовСписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.Список.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//Если Поле = Элементы.СписокПоступлениеТоваров Тогда
	//	
	//	СтандартнаяОбработка = Ложь;
	//	КомандаОформитьДокументПоступления(Неопределено);
	//	
	//КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КочетовПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КочетовСписокПриПолученииДанныхНаСервереПосле(ИмяЭлемента, Настройки, Строки)
	// Вставить содержимое обработчика.
КонецПроцедуры
