
&После("ПриЗаписи")
Процедура КочетовПриЗаписи(Отказ, Замещение)
	
	Если отказ Тогда
		возврат;
	КонецЕсли;
	
	наб=ЭтотОбъект.Выгрузить();
	
	
	Для каждого стр из наб цикл
		
		
		Если Тип("ДокументСсылка.ТТНИсходящаяЕГАИС")=ТипЗнч(стр.документ)  Тогда
			
			
			Если стр.статус=Перечисления.СтатусыОбработкиТТНИсходящейЕГАИС.ОбрабатываетсяКлиентом Тогда
				
				
				Запрос=Новый запрос;
				Запрос.УстановитьПараметр("кпп",СокрЛП(стр.документ.Грузополучатель.КПП));
				Запрос.УстановитьПараметр("инн",СокрЛп(стр.документ.Грузополучатель.ИНН));
				Запрос.Текст="ВЫБРАТЬ
				             |	Контрагенты.Ссылка КАК Ссылка
				             |ИЗ
				             |	Справочник.Контрагенты КАК Контрагенты
				             |ГДЕ
				             |	Контрагенты.КПП = &КПП
				             |	И Контрагенты.ИНН = &ИНН";
				Выборка=Запрос.Выполнить().Выбрать();
				
				
				контрагент=неопределено;
				
				
				Если выборка.Следующий() Тогда			
					контрагент=выборка.ссылка;			
				КонецЕсли;

				
				ВозвратДок=Документы.ВозвратТоваровПоставщику.СоздатьДокумент();
				ВозвратДок.Дата=ТекущаяДата();
				ВозвратДок.Магазин=Справочники.ххх_Справочник.магазин.значение;
				
				
				//стр.документ.Поставщик
				ВозвратДок.Контрагент=контрагент;
				ВозвратДок.Организация=стр.документ.Организация;
				ВозвратДок.Склад=Справочники.ххх_Справочник.магазин.значение.СкладПродажи;
				ВозвратДок.ТТНИсходящаяЕГАИС=стр.документ;
				
				
				ВозвратДок.Товары.загрузить(стр.документ.Товары.Выгрузить());
				
				ВозвратДок.Записать();
				
				
			КонецЕсли;
			
			
		КонецЕсли;
		
		
	КонецЦикла;
	
	
КонецПроцедуры
